[Killed] BlockStatement
bin/src/cli.ts:11:50
 cli
   .command('run_static_analysis', 'Run static analysis command from openspec/config.json')
   .option('--project-root <path>', 'Override project root directory')
-  .action((options: { projectRoot?: string }) => {
-    const exitCode = runStaticAnalysis({ projectRoot: options.projectRoot });
-    process.exit(exitCode);
-  });
+  .action((options: { projectRoot?: string }) => {});
 
 cli
killedBy: dev-team run_static_analysis command registration 命令 action 应调用 runStaticAnalysis
statusReason: expected "vi.fn()" to be called at least once

[Killed] ObjectLiteral
bin/src/cli.ts:12:40
   .command('run_static_analysis', 'Run static analysis command from openspec/config.json')
   .option('--project-root <path>', 'Override project root directory')
   .action((options: { projectRoot?: string }) => {
-    const exitCode = runStaticAnalysis({ projectRoot: options.projectRoot });
+    const exitCode = runStaticAnalysis({});
     process.exit(exitCode);
   });
killedBy: dev-team run_static_analysis -- 边界 --project-root 值为空字符串时使用默认 project dir
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
bin/src/cli.ts:36:11
       files?: string;
       framework?: string;
       skipMutation?: boolean;
-    }) => {
-      const files = options.files
-        ? options.files
-            .split(',')
-            .map((f: string) => f.trim())
-            .filter(Boolean)
-        : undefined;
-      const exitCode = await runTestExecution({
-        change: options.change,
-        projectRoot: options.projectRoot,
-        files,
-        framework: options.framework,
-        noMutation: options.skipMutation,
-      });
-      process.exit(exitCode);
-    },
+    }) => {},
   );
 
killedBy: dev-team test-execution command registration 命令 action 应调用 runTestExecution
statusReason: expected "vi.fn()" to be called at least once

[Killed] MethodExpression
bin/src/cli.ts:38:11
       skipMutation?: boolean;
     }) => {
       const files = options.files
-        ? options.files
-            .split(',')
-            .map((f: string) => f.trim())
-            .filter(Boolean)
+        ? options.files.split(',').map((f: string) => f.trim())
         : undefined;
       const exitCode = await runTestExecution({
killedBy: dev-team test-execution — 选项面 (AC-7) --files 逗号分隔解析、trim 与空段过滤后透传；缺省时为 undefined
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] StringLiteral
bin/src/cli.ts:39:20
     }) => {
       const files = options.files
         ? options.files
-            .split(',')
+            .split("")
             .map((f: string) => f.trim())
             .filter(Boolean)
killedBy: dev-team test-execution — 选项面 (AC-7) --files 逗号分隔解析、trim 与空段过滤后透传；缺省时为 undefined
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ArrowFunction
bin/src/cli.ts:40:18
       const files = options.files
         ? options.files
             .split(',')
-            .map((f: string) => f.trim())
+            .map(() => undefined)
             .filter(Boolean)
         : undefined;
killedBy: dev-team test-execution — 选项面 (AC-7) --files 逗号分隔解析、trim 与空段过滤后透传；缺省时为 undefined
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] MethodExpression
bin/src/cli.ts:40:33
       const files = options.files
         ? options.files
             .split(',')
-            .map((f: string) => f.trim())
+            .map((f: string) => f)
             .filter(Boolean)
         : undefined;
killedBy: dev-team test-execution — 选项面 (AC-7) --files 逗号分隔解析、trim 与空段过滤后透传；缺省时为 undefined
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
bin/src/cli.ts:54:40
     },
   );
 
-cli.command('[*]').action((command) => {
-  if (command) {
-    process.stderr.write(`Unknown command: "${command}"`);
-  } else {
-    process.stderr.write('No command specified');
-  }
-  // 展示帮助信息
-  cli.outputHelp();
-  process.exit(1);
-});
+cli.command('[*]').action((command) => {});
 
 if (require.main === module) {
killedBy: cli 命令 -- 异常 未指定命令时 CLI 报错而非静默忽略
statusReason: expected '' to include 'No command specified'

[Killed] ConditionalExpression
bin/src/cli.ts:55:7
   );
 
 cli.command('[*]').action((command) => {
-  if (command) {
+  if (false) {
     process.stderr.write(`Unknown command: "${command}"`);
   } else {
killedBy: cli 命令 -- 异常 执行未注册命令时 CLI 报错而非静默忽略
statusReason: expected 'No command specified' to include 'Unknown command: "un-registered-comma…'

[Killed] ConditionalExpression
bin/src/cli.ts:55:7
   );
 
 cli.command('[*]').action((command) => {
-  if (command) {
+  if (true) {
     process.stderr.write(`Unknown command: "${command}"`);
   } else {
killedBy: cli 命令 -- 异常 未指定命令时 CLI 报错而非静默忽略
statusReason: expected 'Unknown command: "undefined"' to include 'No command specified'

[Killed] BlockStatement
bin/src/cli.ts:57:10
 cli.command('[*]').action((command) => {
   if (command) {
     process.stderr.write(`Unknown command: "${command}"`);
-  } else {
-    process.stderr.write('No command specified');
-  }
+  } else {}
   // 展示帮助信息
   cli.outputHelp();
killedBy: cli 命令 -- 异常 未指定命令时 CLI 报错而非静默忽略
statusReason: expected '' to include 'No command specified'

[NoCoverage] BlockStatement
bin/src/cli.ts:65:30
   process.exit(1);
 });
 
-if (require.main === module) {
-  cli.help();
-  cli.parse();
-}
+if (require.main === module) {}
 
