[Killed] BlockStatement
bin/src/hooks.ts:42:69
  * Type guard: value is a non-null, non-array object.
  * Allows safe narrowing from `unknown` to `Record<string, unknown>`.
  */
-function isRecord(value: unknown): value is Record<string, unknown> {
-  return value != null && typeof value === 'object' && !Array.isArray(value);
-}
+function isRecord(value: unknown): value is Record<string, unknown> {}
 
 // ---------------------------------------------------------------------------
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [] to deeply equal [ 'src/b.ts' ]

[Killed] EqualityOperator
bin/src/hooks.ts:43:10
  * Allows safe narrowing from `unknown` to `Record<string, unknown>`.
  */
 function isRecord(value: unknown): value is Record<string, unknown> {
-  return value != null && typeof value === 'object' && !Array.isArray(value);
+  return value == null && typeof value === 'object' && !Array.isArray(value);
 }
 
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [] to deeply equal [ 'src/b.ts' ]

[Killed] ConditionalExpression
bin/src/hooks.ts:43:10
  * Allows safe narrowing from `unknown` to `Record<string, unknown>`.
  */
 function isRecord(value: unknown): value is Record<string, unknown> {
-  return value != null && typeof value === 'object' && !Array.isArray(value);
+  return false;
 }
 
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [] to deeply equal [ 'src/b.ts' ]

[Killed] StringLiteral
bin/src/hooks.ts:63:7
   patterns.push({
     glob: '**/openspec/changes/**/workflow.json',
     reason:
-      '该文件受写入保护：%s。detected via %t。请使用 phase_log / backtrack / change_create MCP 工具替代。',
+      "",
   });
   patterns.push({
killedBy: protect-files 功能等价迁移 (AC-2) 内置保护模式匹配 workflow.json 时返回 deny，reason 含 phase_log MCP 工具提示
statusReason: expected '该文件受写入保护：openspec/changes/test/workfl…' to contain 'phase_log'

[Killed] OptionalChaining
bin/src/hooks.ts:71:17
   });
 
   const config = readConfig(projectRoot);
-  const files = config.write_protection?.files ?? [];
+  const files = config.write_protection.files ?? [];
   for (const file of files) {
     if (!file.glob) {
killedBy: hooks 子命令调度 (AC-1) process.argv[2] = "protect-files" 时 main 调用 runProtectFiles 并输出 allow JSON
statusReason: Cannot read properties of undefined (reading 'files')

[Killed] LogicalOperator
bin/src/hooks.ts:71:17
   });
 
   const config = readConfig(projectRoot);
-  const files = config.write_protection?.files ?? [];
+  const files = config.write_protection?.files && [];
   for (const file of files) {
     if (!file.glob) {
killedBy: hooks 子命令调度 (AC-1) process.argv[2] = "protect-files" 时 main 调用 runProtectFiles 并输出 allow JSON
statusReason: files is not iterable

[Killed] BlockStatement
bin/src/hooks.ts:72:29
 
   const config = readConfig(projectRoot);
   const files = config.write_protection?.files ?? [];
-  for (const file of files) {
-    if (!file.glob) {
-      continue;
-    }
-    patterns.push({
-      glob: path.isAbsolute(file.glob) ? file.glob : `**/${file.glob}`,
-      reason: file.reason,
-    });
-  }
+  for (const file of files) {}
 
   return patterns;
killedBy: protect-files 功能等价迁移 (AC-2) buildDenyReason — 自定义 reason 含 %s 和 %t 占位符替换
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] BlockStatement
bin/src/hooks.ts:73:21
   const config = readConfig(projectRoot);
   const files = config.write_protection?.files ?? [];
   for (const file of files) {
-    if (!file.glob) {
-      continue;
-    }
+    if (!file.glob) {}
     patterns.push({
       glob: path.isAbsolute(file.glob) ? file.glob : `**/${file.glob}`,
killedBy: protect-files 功能等价迁移 (AC-2) loadPatterns 用户配置 file 条目缺失 glob 时跳过该条目 (边界)
statusReason: The "path" argument must be of type string. Received undefined

[Killed] ConditionalExpression
bin/src/hooks.ts:73:9
   const config = readConfig(projectRoot);
   const files = config.write_protection?.files ?? [];
   for (const file of files) {
-    if (!file.glob) {
+    if (true) {
       continue;
     }
killedBy: protect-files 功能等价迁移 (AC-2) buildDenyReason — 自定义 reason 含 %s 和 %t 占位符替换
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] BlockStatement
bin/src/hooks.ts:96:88
  *
  * @internal Exported for testing only.
  */
-function isProtected(filePath: string, patterns: ProtectedPattern[]): ProtectionResult {
-  if (!filePath) return { matched: false };
-  const normalized = filePath.replace(/\\/g, '/');
-
-  for (const p of patterns) {
-    if (matchGlob(normalized, p.glob)) {
-      return {
-        matched: true,
-        matchedGlob: p.glob,
-        reason: p.reason,
-      };
-    }
-  }
-
-  return { matched: false };
-}
+function isProtected(filePath: string, patterns: ProtectedPattern[]): ProtectionResult {}
 
 // ---------------------------------------------------------------------------
killedBy: hooks 子命令调度 (AC-1) process.argv[2] = "protect-files" 时 main 调用 runProtectFiles 并输出 allow JSON
statusReason: Cannot read properties of undefined (reading 'matched')

[Killed] BooleanLiteral
bin/src/hooks.ts:97:7
  * @internal Exported for testing only.
  */
 function isProtected(filePath: string, patterns: ProtectedPattern[]): ProtectionResult {
-  if (!filePath) return { matched: false };
+  if (filePath) return { matched: false };
   const normalized = filePath.replace(/\\/g, '/');
 
killedBy: hooks 子命令调度 (AC-1) runProtectFiles 输出格式为 { hookSpecificOutput: { hookEventName, permissionDecision } }
statusReason: expected { hookSpecificOutput: { …(2) } } to deeply equal { hookSpecificOutput: { …(3) } }

[Killed] ConditionalExpression
bin/src/hooks.ts:97:7
  * @internal Exported for testing only.
  */
 function isProtected(filePath: string, patterns: ProtectedPattern[]): ProtectionResult {
-  if (!filePath) return { matched: false };
+  if (true) return { matched: false };
   const normalized = filePath.replace(/\\/g, '/');
 
killedBy: hooks 子命令调度 (AC-1) runProtectFiles 输出格式为 { hookSpecificOutput: { hookEventName, permissionDecision } }
statusReason: expected { hookSpecificOutput: { …(2) } } to deeply equal { hookSpecificOutput: { …(3) } }

[Killed] BlockStatement
bin/src/hooks.ts:100:29
   if (!filePath) return { matched: false };
   const normalized = filePath.replace(/\\/g, '/');
 
-  for (const p of patterns) {
-    if (matchGlob(normalized, p.glob)) {
-      return {
-        matched: true,
-        matchedGlob: p.glob,
-        reason: p.reason,
-      };
-    }
-  }
+  for (const p of patterns) {}
 
   return { matched: false };
killedBy: hooks 子命令调度 (AC-1) runProtectFiles 输出格式为 { hookSpecificOutput: { hookEventName, permissionDecision } }
statusReason: expected { hookSpecificOutput: { …(2) } } to deeply equal { hookSpecificOutput: { …(3) } }

[Killed] ConditionalExpression
bin/src/hooks.ts:101:9
   const normalized = filePath.replace(/\\/g, '/');
 
   for (const p of patterns) {
-    if (matchGlob(normalized, p.glob)) {
+    if (false) {
       return {
         matched: true,
killedBy: 工具 deny 与 fs 成功并存 Write workflow.json 时 hook deny，同时 writeEvalJson 在临时 change 目录写成功（AC-8）
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] BlockStatement
bin/src/hooks.ts:101:40
   const normalized = filePath.replace(/\\/g, '/');
 
   for (const p of patterns) {
-    if (matchGlob(normalized, p.glob)) {
-      return {
-        matched: true,
-        matchedGlob: p.glob,
-        reason: p.reason,
-      };
-    }
+    if (matchGlob(normalized, p.glob)) {}
   }
 
killedBy: hooks 子命令调度 (AC-1) runProtectFiles 输出格式为 { hookSpecificOutput: { hookEventName, permissionDecision } }
statusReason: expected { hookSpecificOutput: { …(2) } } to deeply equal { hookSpecificOutput: { …(3) } }

[Killed] ObjectLiteral
bin/src/hooks.ts:102:14
 
   for (const p of patterns) {
     if (matchGlob(normalized, p.glob)) {
-      return {
-        matched: true,
-        matchedGlob: p.glob,
-        reason: p.reason,
-      };
+      return {};
     }
   }
killedBy: hooks 子命令调度 (AC-1) runProtectFiles 输出格式为 { hookSpecificOutput: { hookEventName, permissionDecision } }
statusReason: expected { hookSpecificOutput: { …(2) } } to deeply equal { hookSpecificOutput: { …(3) } }

[Killed] BooleanLiteral
bin/src/hooks.ts:110:21
     }
   }
 
-  return { matched: false };
+  return { matched: true };
 }
 
killedBy: protect-files 功能等价迁移 (AC-2) parseInput 解析 Write 未受保护文件路径返回 allow
statusReason: expected 'deny' to be 'allow' // Object.is equality

[Killed] BlockStatement
bin/src/hooks.ts:128:11
   pattern: ProtectionResult | null,
   filePath: string,
   toolName: string,
-): string {
-  if (pattern && pattern.reason) {
-    return pattern.reason.replace(/%s/g, filePath).replace(/%t/g, toolName);
-  }
-  return `该文件受写入保护：${filePath}。detected via ${toolName}。`;
-}
+): string {}
 
 /**
killedBy: hooks 子命令调度 (AC-1) runProtectFiles 输出格式为 { hookSpecificOutput: { hookEventName, permissionDecision } }
statusReason: expected { hookSpecificOutput: { …(2) } } to deeply equal { hookSpecificOutput: { …(3) } }

[Killed] ConditionalExpression
bin/src/hooks.ts:129:7
   filePath: string,
   toolName: string,
 ): string {
-  if (pattern && pattern.reason) {
+  if (true) {
     return pattern.reason.replace(/%s/g, filePath).replace(/%t/g, toolName);
   }
killedBy: protect-files 功能等价迁移 (AC-2) buildDenyReason pattern 无 reason 时使用默认回退文案
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] ConditionalExpression
bin/src/hooks.ts:129:7
   filePath: string,
   toolName: string,
 ): string {
-  if (pattern && pattern.reason) {
+  if (false) {
     return pattern.reason.replace(/%s/g, filePath).replace(/%t/g, toolName);
   }
killedBy: protect-files 功能等价迁移 (AC-2) 内置保护模式匹配 workflow.json 时返回 deny，reason 含 phase_log MCP 工具提示
statusReason: expected '该文件受写入保护：openspec/changes/test/workfl…' to contain 'phase_log'

[Survived] BlockStatement
bin/src/hooks.ts:140:78
  * workspace wholesale and are invisible to the file recorder, so they are
  * denied instead of recorded.
  */
-function buildBulkRevertDenyReason(toolName: string, detail: string): string {
-  return (
-    `该命令被拦截（detected via ${toolName}）：${detail}。` +
-    '批量还原/清理对文件清单记录器不可见；请改用逐路径 git restore <path>（可被记录并折叠为净 untouched）。'
-  );
-}
+function buildBulkRevertDenyReason(toolName: string, detail: string): string {}
 
 // ---------------------------------------------------------------------------

[Killed] BlockStatement
bin/src/hooks.ts:152:43
 // ---------------------------------------------------------------------------
 
 /** Split a command-argument string into whitespace tokens with quotes stripped. */
-function tokenize(args: string): string[] {
-  return args
-    .split(/\s+/)
-    .filter(Boolean)
-    .map((t) => t.replace(/^['"]|['"]$/g, ''))
-    .filter(Boolean);
-}
+function tokenize(args: string): string[] {}
 
 /** True for option tokens ( `-f`, `-rf`, `--cached` ). */
killedBy: record-files — 归账写清单 (AC-2, AC-4, AC-13) Bash rm src/old.ts → deleted 含 src/old.ts；PowerShell Remove-Item 同语义 (AC-2)
statusReason: expected "vi.fn()" to be called at least once

[Survived] MethodExpression
bin/src/hooks.ts:153:10
 
 /** Split a command-argument string into whitespace tokens with quotes stripped. */
 function tokenize(args: string): string[] {
-  return args
-    .split(/\s+/)
-    .filter(Boolean)
+  return args.split(/\s+/)
     .map((t) => t.replace(/^['"]|['"]$/g, ''))
     .filter(Boolean);

[Survived] MethodExpression
bin/src/hooks.ts:153:10
 
 /** Split a command-argument string into whitespace tokens with quotes stripped. */
 function tokenize(args: string): string[] {
-  return args
-    .split(/\s+/)
-    .filter(Boolean)
-    .map((t) => t.replace(/^['"]|['"]$/g, ''))
-    .filter(Boolean);
+  return args.split(/\s+/).filter(Boolean).map(t => t.replace(/^['"]|['"]$/g, ''));
 }
 

[Killed] ArrowFunction
bin/src/hooks.ts:156:10
   return args
     .split(/\s+/)
     .filter(Boolean)
-    .map((t) => t.replace(/^['"]|['"]$/g, ''))
+    .map(() => undefined)
     .filter(Boolean);
 }
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [ 'src/foo.ts', 'src/bar.ts' ] to deeply equal [ 'src/b.ts' ]

[Killed] BlockStatement
bin/src/hooks.ts:161:41
 }
 
 /** True for option tokens ( `-f`, `-rf`, `--cached` ). */
-function isFlag(token: string): boolean {
-  return token.startsWith('-');
-}
+function isFlag(token: string): boolean {}
 
 /**
killedBy: protect-files — 扩拦截：git stash / clean / restore / rm / mv (AC-5, AC-4) git stash / git stash pop / git clean -fd（无路径限定）→ deny (AC-5)
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] MethodExpression
bin/src/hooks.ts:162:10
 
 /** True for option tokens ( `-f`, `-rf`, `--cached` ). */
 function isFlag(token: string): boolean {
-  return token.startsWith('-');
+  return token.endsWith('-');
 }
 
killedBy: protect-files — 扩拦截：git stash / clean / restore / rm / mv (AC-5, AC-4) git stash / git stash pop / git clean -fd（无路径限定）→ deny (AC-5)
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] BlockStatement
bin/src/hooks.ts:169:75
  * Scan `command <args>` occurrences for the given command names.
  * The argument string stops at a command separator (`;`, `|`, `&`) or newline.
  */
-function scanCommand(cmd: string, names: string): Array<{ args: string }> {
-  const results: Array<{ args: string }> = [];
-  const re = new RegExp(`(?:^|[\\s;&|(])(?:${names})\\s+([^;&|\\n]*)`, 'gi');
-  re.lastIndex = 0;
-  let m: RegExpExecArray | null;
-  while ((m = re.exec(cmd)) !== null) {
-    results.push({ args: m[1] });
-  }
-  return results;
-}
+function scanCommand(cmd: string, names: string): Array<{ args: string }> {}
 
 // ---------------------------------------------------------------------------
killedBy: 工具 deny 与 fs 成功并存 Shell 重定向写 workflow.json 时 deny，且不影响随后的 writeEvalJson
statusReason: scanCommand is not a function or its return value is not iterable

[Killed] ArrayDeclaration
bin/src/hooks.ts:170:44
  * The argument string stops at a command separator (`;`, `|`, `&`) or newline.
  */
 function scanCommand(cmd: string, names: string): Array<{ args: string }> {
-  const results: Array<{ args: string }> = [];
+  const results: Array<{ args: string }> = ["Stryker was here"];
   const re = new RegExp(`(?:^|[\\s;&|(])(?:${names})\\s+([^;&|\\n]*)`, 'gi');
   re.lastIndex = 0;
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [ 'src/foo.ts' ] to deeply equal [ 'src/b.ts' ]

[Timeout] StringLiteral
bin/src/hooks.ts:171:25
  */
 function scanCommand(cmd: string, names: string): Array<{ args: string }> {
   const results: Array<{ args: string }> = [];
-  const re = new RegExp(`(?:^|[\\s;&|(])(?:${names})\\s+([^;&|\\n]*)`, 'gi');
+  const re = new RegExp(``, 'gi');
   re.lastIndex = 0;
   let m: RegExpExecArray | null;

[Killed] ConditionalExpression
bin/src/hooks.ts:174:10
   const re = new RegExp(`(?:^|[\\s;&|(])(?:${names})\\s+([^;&|\\n]*)`, 'gi');
   re.lastIndex = 0;
   let m: RegExpExecArray | null;
-  while ((m = re.exec(cmd)) !== null) {
+  while (false) {
     results.push({ args: m[1] });
   }
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [ 'src/foo.ts' ] to deeply equal [ 'src/b.ts' ]

[Killed] BlockStatement
bin/src/hooks.ts:174:39
   const re = new RegExp(`(?:^|[\\s;&|(])(?:${names})\\s+([^;&|\\n]*)`, 'gi');
   re.lastIndex = 0;
   let m: RegExpExecArray | null;
-  while ((m = re.exec(cmd)) !== null) {
-    results.push({ args: m[1] });
-  }
+  while ((m = re.exec(cmd)) !== null) {}
   return results;
 }
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [ 'src/foo.ts' ] to deeply equal [ 'src/b.ts' ]

[Killed] Regex
bin/src/hooks.ts:197:14
  */
 function extractGitOps(cmd: string): FileOp[] {
   const ops: FileOp[] = [];
-  const re = /\bgit\s+(restore|checkout|rm)\b([^\n;&|]*)/gi;
+  const re = /\bgit\s+(restore|checkout|rm)\b([^\n;&|])/gi;
   re.lastIndex = 0;
   let m: RegExpExecArray | null;
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [ 'src/bar.ts', 'src/b.ts' ] to deeply equal [ 'src/b.ts' ]

[Killed] EqualityOperator
bin/src/hooks.ts:200:10
   const re = /\bgit\s+(restore|checkout|rm)\b([^\n;&|]*)/gi;
   re.lastIndex = 0;
   let m: RegExpExecArray | null;
-  while ((m = re.exec(cmd)) !== null) {
+  while ((m = re.exec(cmd)) === null) {
     const sub = m[1].toLowerCase();
     const tokens = tokenize(m[2]);
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [ 'src/foo.ts' ] to deeply equal [ 'src/b.ts' ]

[Killed] MethodExpression
bin/src/hooks.ts:201:17
   re.lastIndex = 0;
   let m: RegExpExecArray | null;
   while ((m = re.exec(cmd)) !== null) {
-    const sub = m[1].toLowerCase();
+    const sub = m[1].toUpperCase();
     const tokens = tokenize(m[2]);
 
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [ 'src/bar.ts', 'src/b.ts' ] to deeply equal [ 'src/b.ts' ]

[Killed] EqualityOperator
bin/src/hooks.ts:204:9
     const sub = m[1].toLowerCase();
     const tokens = tokenize(m[2]);
 
-    if (sub === 'rm') {
+    if (sub !== 'rm') {
       for (const t of tokens) {
         if (!isFlag(t)) ops.push({ op: 'delete', path: t });
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [ 'src/a.ts', 'src/bar.ts', …(1) ] to deeply equal [ 'src/a.ts', 'src/foo.ts' ]

[Killed] ConditionalExpression
bin/src/hooks.ts:204:9
     const sub = m[1].toLowerCase();
     const tokens = tokenize(m[2]);
 
-    if (sub === 'rm') {
+    if (true) {
       for (const t of tokens) {
         if (!isFlag(t)) ops.push({ op: 'delete', path: t });
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [ 'src/a.ts', 'src/bar.ts', …(1) ] to deeply equal [ 'src/a.ts', 'src/foo.ts' ]

[NoCoverage] BlockStatement
bin/src/hooks.ts:205:31
     const tokens = tokenize(m[2]);
 
     if (sub === 'rm') {
-      for (const t of tokens) {
-        if (!isFlag(t)) ops.push({ op: 'delete', path: t });
-      }
+      for (const t of tokens) {}
       continue;
     }

[NoCoverage] ConditionalExpression
bin/src/hooks.ts:206:13
 
     if (sub === 'rm') {
       for (const t of tokens) {
-        if (!isFlag(t)) ops.push({ op: 'delete', path: t });
+        if (true) ops.push({ op: 'delete', path: t });
       }
       continue;

[NoCoverage] BooleanLiteral
bin/src/hooks.ts:206:13
 
     if (sub === 'rm') {
       for (const t of tokens) {
-        if (!isFlag(t)) ops.push({ op: 'delete', path: t });
+        if (isFlag(t)) ops.push({ op: 'delete', path: t });
       }
       continue;

[Killed] ConditionalExpression
bin/src/hooks.ts:211:9
       continue;
     }
 
-    if (sub === 'restore') {
+    if (false) {
       let fromSource = false;
       const paths: string[] = [];
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [ 'src/bar.ts', 'src/b.ts' ] to deeply equal [ 'src/b.ts' ]

[Killed] ConditionalExpression
bin/src/hooks.ts:211:9
       continue;
     }
 
-    if (sub === 'restore') {
+    if (true) {
       let fromSource = false;
       const paths: string[] = [];
killedBy: protect-files — 扩拦截：git stash / clean / restore / rm / mv (AC-5, AC-4) git restore --source=<commit> <path> / git checkout <commit> -- <paths> 归 write 分类（还原到历史版本为内容写入语义，AC-4）
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] BooleanLiteral
bin/src/hooks.ts:212:24
     }
 
     if (sub === 'restore') {
-      let fromSource = false;
+      let fromSource = true;
       const paths: string[] = [];
       for (let i = 0; i < tokens.length; i++) {
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [ 'src/bar.ts', 'src/b.ts' ] to deeply equal [ 'src/b.ts' ]

[Killed] EqualityOperator
bin/src/hooks.ts:214:23
     if (sub === 'restore') {
       let fromSource = false;
       const paths: string[] = [];
-      for (let i = 0; i < tokens.length; i++) {
+      for (let i = 0; i <= tokens.length; i++) {
         const t = tokens[i];
         if (t.startsWith('--source=') || t === '-s') {
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [ 'src/bar.ts', 'src/b.ts' ] to deeply equal [ 'src/b.ts' ]

[Killed] EqualityOperator
bin/src/hooks.ts:214:23
     if (sub === 'restore') {
       let fromSource = false;
       const paths: string[] = [];
-      for (let i = 0; i < tokens.length; i++) {
+      for (let i = 0; i >= tokens.length; i++) {
         const t = tokens[i];
         if (t.startsWith('--source=') || t === '-s') {
killedBy: record-files — 归账写清单 (AC-2, AC-4, AC-13) Bash git restore src/foo.ts → 折叠为净 untouched（written/deleted 均无该路径，AC-4）
statusReason: expected [ 'src/foo.ts' ] to deeply equal []

[Killed] EqualityOperator
bin/src/hooks.ts:216:42
       const paths: string[] = [];
       for (let i = 0; i < tokens.length; i++) {
         const t = tokens[i];
-        if (t.startsWith('--source=') || t === '-s') {
+        if (t.startsWith('--source=') || t !== '-s') {
           fromSource = true;
           if (t === '-s') i++; // separate value form: skip the commit-ish
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [ 'src/bar.ts', 'src/b.ts' ] to deeply equal [ 'src/b.ts' ]

[Killed] ConditionalExpression
bin/src/hooks.ts:216:13
       const paths: string[] = [];
       for (let i = 0; i < tokens.length; i++) {
         const t = tokens[i];
-        if (t.startsWith('--source=') || t === '-s') {
+        if (true) {
           fromSource = true;
           if (t === '-s') i++; // separate value form: skip the commit-ish
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [ 'src/bar.ts', 'src/b.ts' ] to deeply equal [ 'src/b.ts' ]

[Survived] BooleanLiteral
bin/src/hooks.ts:217:24
       for (let i = 0; i < tokens.length; i++) {
         const t = tokens[i];
         if (t.startsWith('--source=') || t === '-s') {
-          fromSource = true;
+          fromSource = false;
           if (t === '-s') i++; // separate value form: skip the commit-ish
           continue;

[Killed] EqualityOperator
bin/src/hooks.ts:218:15
         const t = tokens[i];
         if (t.startsWith('--source=') || t === '-s') {
           fromSource = true;
-          if (t === '-s') i++; // separate value form: skip the commit-ish
+          if (t !== '-s') i++; // separate value form: skip the commit-ish
           continue;
         }
killedBy: protect-files — 扩拦截：git stash / clean / restore / rm / mv (AC-5, AC-4) git restore --source=<commit> <path> / git checkout <commit> -- <paths> 归 write 分类（还原到历史版本为内容写入语义，AC-4）
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] ConditionalExpression
bin/src/hooks.ts:218:15
         const t = tokens[i];
         if (t.startsWith('--source=') || t === '-s') {
           fromSource = true;
-          if (t === '-s') i++; // separate value form: skip the commit-ish
+          if (true) i++; // separate value form: skip the commit-ish
           continue;
         }
killedBy: protect-files — 扩拦截：git stash / clean / restore / rm / mv (AC-5, AC-4) git restore --source=<commit> <path> / git checkout <commit> -- <paths> 归 write 分类（还原到历史版本为内容写入语义，AC-4）
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] ConditionalExpression
bin/src/hooks.ts:221:13
           if (t === '-s') i++; // separate value form: skip the commit-ish
           continue;
         }
-        if (isFlag(t)) continue;
+        if (true) continue;
         paths.push(t);
       }
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [ 'src/bar.ts', 'src/b.ts' ] to deeply equal [ 'src/b.ts' ]

[Survived] ConditionalExpression
bin/src/hooks.ts:221:13
           if (t === '-s') i++; // separate value form: skip the commit-ish
           continue;
         }
-        if (isFlag(t)) continue;
+        if (false) continue;
         paths.push(t);
       }

[Killed] BlockStatement
bin/src/hooks.ts:224:30
         if (isFlag(t)) continue;
         paths.push(t);
       }
-      for (const p of paths) {
-        ops.push({ op: fromSource ? 'write' : 'revert', path: p });
-      }
+      for (const p of paths) {}
       continue;
     }
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [ 'src/bar.ts', 'src/b.ts' ] to deeply equal [ 'src/b.ts' ]

[Survived] StringLiteral
bin/src/hooks.ts:225:37
         paths.push(t);
       }
       for (const p of paths) {
-        ops.push({ op: fromSource ? 'write' : 'revert', path: p });
+        ops.push({ op: fromSource ? "" : 'revert', path: p });
       }
       continue;

[Killed] StringLiteral
bin/src/hooks.ts:231:32
     }
 
     // checkout: only the path-restoring forms (with `--`) are recognized
-    const sep = tokens.indexOf('--');
+    const sep = tokens.indexOf("");
     if (sep === -1) continue;
     const commitish = tokens.slice(0, sep).filter((t) => !isFlag(t));
killedBy: protect-files — 扩拦截：git stash / clean / restore / rm / mv (AC-5, AC-4) git restore --source=<commit> <path> / git checkout <commit> -- <paths> 归 write 分类（还原到历史版本为内容写入语义，AC-4）
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] EqualityOperator
bin/src/hooks.ts:232:9
 
     // checkout: only the path-restoring forms (with `--`) are recognized
     const sep = tokens.indexOf('--');
-    if (sep === -1) continue;
+    if (sep !== -1) continue;
     const commitish = tokens.slice(0, sep).filter((t) => !isFlag(t));
     const fromSource = commitish.length > 0;
killedBy: protect-files — 扩拦截：git stash / clean / restore / rm / mv (AC-5, AC-4) git restore --source=<commit> <path> / git checkout <commit> -- <paths> 归 write 分类（还原到历史版本为内容写入语义，AC-4）
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] UnaryOperator
bin/src/hooks.ts:232:17
 
     // checkout: only the path-restoring forms (with `--`) are recognized
     const sep = tokens.indexOf('--');
-    if (sep === -1) continue;
+    if (sep === +1) continue;
     const commitish = tokens.slice(0, sep).filter((t) => !isFlag(t));
     const fromSource = commitish.length > 0;
killedBy: protect-files — 扩拦截：git stash / clean / restore / rm / mv (AC-5, AC-4) git restore --source=<commit> <path> / git checkout <commit> -- <paths> 归 write 分类（还原到历史版本为内容写入语义，AC-4）
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] ArrowFunction
bin/src/hooks.ts:233:51
     // checkout: only the path-restoring forms (with `--`) are recognized
     const sep = tokens.indexOf('--');
     if (sep === -1) continue;
-    const commitish = tokens.slice(0, sep).filter((t) => !isFlag(t));
+    const commitish = tokens.slice(0, sep).filter(() => undefined);
     const fromSource = commitish.length > 0;
     for (const p of tokens.slice(sep + 1).filter((t) => !isFlag(t))) {
killedBy: protect-files — 扩拦截：git stash / clean / restore / rm / mv (AC-5, AC-4) git restore --source=<commit> <path> / git checkout <commit> -- <paths> 归 write 分类（还原到历史版本为内容写入语义，AC-4）
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] BooleanLiteral
bin/src/hooks.ts:233:58
     // checkout: only the path-restoring forms (with `--`) are recognized
     const sep = tokens.indexOf('--');
     if (sep === -1) continue;
-    const commitish = tokens.slice(0, sep).filter((t) => !isFlag(t));
+    const commitish = tokens.slice(0, sep).filter((t) => isFlag(t));
     const fromSource = commitish.length > 0;
     for (const p of tokens.slice(sep + 1).filter((t) => !isFlag(t))) {
killedBy: protect-files — 扩拦截：git stash / clean / restore / rm / mv (AC-5, AC-4) git restore --source=<commit> <path> / git checkout <commit> -- <paths> 归 write 分类（还原到历史版本为内容写入语义，AC-4）
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] EqualityOperator
bin/src/hooks.ts:234:24
     const sep = tokens.indexOf('--');
     if (sep === -1) continue;
     const commitish = tokens.slice(0, sep).filter((t) => !isFlag(t));
-    const fromSource = commitish.length > 0;
+    const fromSource = commitish.length <= 0;
     for (const p of tokens.slice(sep + 1).filter((t) => !isFlag(t))) {
       ops.push({ op: fromSource ? 'write' : 'revert', path: p });
killedBy: protect-files — 扩拦截：git stash / clean / restore / rm / mv (AC-5, AC-4) git restore --source=<commit> <path> / git checkout <commit> -- <paths> 归 write 分类（还原到历史版本为内容写入语义，AC-4）
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] ConditionalExpression
bin/src/hooks.ts:234:24
     const sep = tokens.indexOf('--');
     if (sep === -1) continue;
     const commitish = tokens.slice(0, sep).filter((t) => !isFlag(t));
-    const fromSource = commitish.length > 0;
+    const fromSource = false;
     for (const p of tokens.slice(sep + 1).filter((t) => !isFlag(t))) {
       ops.push({ op: fromSource ? 'write' : 'revert', path: p });
killedBy: protect-files — 扩拦截：git stash / clean / restore / rm / mv (AC-5, AC-4) git restore --source=<commit> <path> / git checkout <commit> -- <paths> 归 write 分类（还原到历史版本为内容写入语义，AC-4）
statusReason: expected 'allow' to be 'deny' // Object.is equality
