[Killed] BooleanLiteral
bin/src/hooks.ts:235:57
     if (sep === -1) continue;
     const commitish = tokens.slice(0, sep).filter((t) => !isFlag(t));
     const fromSource = commitish.length > 0;
-    for (const p of tokens.slice(sep + 1).filter((t) => !isFlag(t))) {
+    for (const p of tokens.slice(sep + 1).filter((t) => isFlag(t))) {
       ops.push({ op: fromSource ? 'write' : 'revert', path: p });
     }
killedBy: protect-files — 扩拦截：git stash / clean / restore / rm / mv (AC-5, AC-4) git restore --source=<commit> <path> / git checkout <commit> -- <paths> 归 write 分类（还原到历史版本为内容写入语义，AC-4）
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] ArrowFunction
bin/src/hooks.ts:235:50
     if (sep === -1) continue;
     const commitish = tokens.slice(0, sep).filter((t) => !isFlag(t));
     const fromSource = commitish.length > 0;
-    for (const p of tokens.slice(sep + 1).filter((t) => !isFlag(t))) {
+    for (const p of tokens.slice(sep + 1).filter(() => undefined)) {
       ops.push({ op: fromSource ? 'write' : 'revert', path: p });
     }
killedBy: protect-files — 扩拦截：git stash / clean / restore / rm / mv (AC-5, AC-4) git restore --source=<commit> <path> / git checkout <commit> -- <paths> 归 write 分类（还原到历史版本为内容写入语义，AC-4）
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] BlockStatement
bin/src/hooks.ts:247:61
 // ---------------------------------------------------------------------------
 
 /** Write ops from bash redirections (existing regex set preserved). */
-function extractBashRedirectWriteOps(cmd: string): FileOp[] {
-  const ops: FileOp[] = [];
-  const writeRegexes: readonly RegExp[] = [
-    // > and >> redirect (not preceded by - or part of ->)
-    /(?:^|[^-])>{1,2}\s+['"]?([^\s;|`$&()'"]+)['"]?/g,
-    // >| redirect (noclobber override)
-    />\|\s+['"]?([^\s;|`$&()'"]+)['"]?/g,
-    // tee (possibly with -a or other flags)
-    /(?:^|[\s;|&(])\s*tee\s+(?:-[a-zA-Z]+\s+)?['"]?([^\s;|`$&()'"]+)['"]?/g,
-    // >& redirect
-    />&\s*['"]?([^\s;|`$&()'"]+)['"]?/g,
-  ];
-  for (const re of writeRegexes) {
-    re.lastIndex = 0;
-    let m: RegExpExecArray | null;
-    while ((m = re.exec(cmd)) !== null) {
-      ops.push({ op: 'write', path: m[1] });
-    }
-  }
-  return ops;
-}
+function extractBashRedirectWriteOps(cmd: string): FileOp[] {}
 
 /** Write ops from PowerShell redirects, file-writing cmdlets and .NET methods. */
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [ 'src/foo.ts' ] to deeply equal [ 'src/b.ts' ]

[Killed] Regex
bin/src/hooks.ts:251:5
   const ops: FileOp[] = [];
   const writeRegexes: readonly RegExp[] = [
     // > and >> redirect (not preceded by - or part of ->)
-    /(?:^|[^-])>{1,2}\s+['"]?([^\s;|`$&()'"]+)['"]?/g,
+    /(?:^|[-])>{1,2}\s+['"]?([^\s;|`$&()'"]+)['"]?/g,
     // >| redirect (noclobber override)
     />\|\s+['"]?([^\s;|`$&()'"]+)['"]?/g,
killedBy: protect-files 功能等价迁移 (AC-2) detectBashWrite 含 "->" 但无写入操作时返回 allow
statusReason: expected 'deny' to be 'allow' // Object.is equality

[Survived] Regex
bin/src/hooks.ts:251:5
   const ops: FileOp[] = [];
   const writeRegexes: readonly RegExp[] = [
     // > and >> redirect (not preceded by - or part of ->)
-    /(?:^|[^-])>{1,2}\s+['"]?([^\s;|`$&()'"]+)['"]?/g,
+    /(?:[^-])>{1,2}\s+['"]?([^\s;|`$&()'"]+)['"]?/g,
     // >| redirect (noclobber override)
     />\|\s+['"]?([^\s;|`$&()'"]+)['"]?/g,

[Killed] Regex
bin/src/hooks.ts:253:5
     // > and >> redirect (not preceded by - or part of ->)
     /(?:^|[^-])>{1,2}\s+['"]?([^\s;|`$&()'"]+)['"]?/g,
     // >| redirect (noclobber override)
-    />\|\s+['"]?([^\s;|`$&()'"]+)['"]?/g,
+    />\|\s+['"]?([\s;|`$&()'"]+)['"]?/g,
     // tee (possibly with -a or other flags)
     /(?:^|[\s;|&(])\s*tee\s+(?:-[a-zA-Z]+\s+)?['"]?([^\s;|`$&()'"]+)['"]?/g,
killedBy: protect-files 功能等价迁移 (AC-2) detectBashWrite — >| noclobber 重定向到 workflow.json 返回 deny
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] Regex
bin/src/hooks.ts:255:5
     // >| redirect (noclobber override)
     />\|\s+['"]?([^\s;|`$&()'"]+)['"]?/g,
     // tee (possibly with -a or other flags)
-    /(?:^|[\s;|&(])\s*tee\s+(?:-[a-zA-Z]+\s+)?['"]?([^\s;|`$&()'"]+)['"]?/g,
+    /(?:^|[\s;|&(])\s*tee\s+(?:-[a-zA-Z]+\s+)?[^'"]?([^\s;|`$&()'"]+)['"]?/g,
     // >& redirect
     />&\s*['"]?([^\s;|`$&()'"]+)['"]?/g,
killedBy: protect-files 功能等价迁移 (AC-2) detectBashWrite — tee 写入 workflow.json 返回 deny
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Survived] Regex
bin/src/hooks.ts:255:5
     // >| redirect (noclobber override)
     />\|\s+['"]?([^\s;|`$&()'"]+)['"]?/g,
     // tee (possibly with -a or other flags)
-    /(?:^|[\s;|&(])\s*tee\s+(?:-[a-zA-Z]+\s+)?['"]?([^\s;|`$&()'"]+)['"]?/g,
+    /(?:^|[\S;|&(])\s*tee\s+(?:-[a-zA-Z]+\s+)?['"]?([^\s;|`$&()'"]+)['"]?/g,
     // >& redirect
     />&\s*['"]?([^\s;|`$&()'"]+)['"]?/g,

[Killed] Regex
bin/src/hooks.ts:257:5
     // tee (possibly with -a or other flags)
     /(?:^|[\s;|&(])\s*tee\s+(?:-[a-zA-Z]+\s+)?['"]?([^\s;|`$&()'"]+)['"]?/g,
     // >& redirect
-    />&\s*['"]?([^\s;|`$&()'"]+)['"]?/g,
+    />&\s*[^'"]?([^\s;|`$&()'"]+)['"]?/g,
   ];
   for (const re of writeRegexes) {
killedBy: protect-files 功能等价迁移 (AC-2) detectBashWrite — >& 重定向到 workflow.json 返回 deny
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] Regex
bin/src/hooks.ts:257:5
     // tee (possibly with -a or other flags)
     /(?:^|[\s;|&(])\s*tee\s+(?:-[a-zA-Z]+\s+)?['"]?([^\s;|`$&()'"]+)['"]?/g,
     // >& redirect
-    />&\s*['"]?([^\s;|`$&()'"]+)['"]?/g,
+    />&\s*['"]?([^\s;|`$&()'"])['"]?/g,
   ];
   for (const re of writeRegexes) {
killedBy: protect-files 功能等价迁移 (AC-2) detectBashWrite — >& 重定向到 workflow.json 返回 deny
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] BlockStatement
bin/src/hooks.ts:259:34
     // >& redirect
     />&\s*['"]?([^\s;|`$&()'"]+)['"]?/g,
   ];
-  for (const re of writeRegexes) {
-    re.lastIndex = 0;
-    let m: RegExpExecArray | null;
-    while ((m = re.exec(cmd)) !== null) {
-      ops.push({ op: 'write', path: m[1] });
-    }
-  }
+  for (const re of writeRegexes) {}
   return ops;
 }
killedBy: protect-files 功能等价迁移 (AC-2) detectBashWrite — tee 写入 workflow.json 返回 deny
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] BlockStatement
bin/src/hooks.ts:262:41
   for (const re of writeRegexes) {
     re.lastIndex = 0;
     let m: RegExpExecArray | null;
-    while ((m = re.exec(cmd)) !== null) {
-      ops.push({ op: 'write', path: m[1] });
-    }
+    while ((m = re.exec(cmd)) !== null) {}
   }
   return ops;
killedBy: protect-files 功能等价迁移 (AC-2) detectBashWrite — tee 写入 workflow.json 返回 deny
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Survived] Regex
bin/src/hooks.ts:275:22
   let m: RegExpExecArray | null;
 
   // Redirect operators: >, >>, *>, 1>, 2>, etc.
-  const psRedirect = /(?:^|[\s;|&(])(?:\d*|\*)?>{1,2}\s+['"]?([^\s;|`$&()'",=]+)['"]?/g;
+  const psRedirect = /(?:^|[\s;|&(])(?:\d*|\*)?>{1,2}\s+['"]?([^\S;|`$&()'",=]+)['"]?/g;
   while ((m = psRedirect.exec(cmd)) !== null) {
     ops.push({ op: 'write', path: m[1] });

[Survived] Regex
bin/src/hooks.ts:275:22
   let m: RegExpExecArray | null;
 
   // Redirect operators: >, >>, *>, 1>, 2>, etc.
-  const psRedirect = /(?:^|[\s;|&(])(?:\d*|\*)?>{1,2}\s+['"]?([^\s;|`$&()'",=]+)['"]?/g;
+  const psRedirect = /(?:^|[\s;|&(])(?:\d*|\*)?>{1,2}\s+['"]([^\s;|`$&()'",=]+)['"]?/g;
   while ((m = psRedirect.exec(cmd)) !== null) {
     ops.push({ op: 'write', path: m[1] });

[Killed] EqualityOperator
bin/src/hooks.ts:276:10
 
   // Redirect operators: >, >>, *>, 1>, 2>, etc.
   const psRedirect = /(?:^|[\s;|&(])(?:\d*|\*)?>{1,2}\s+['"]?([^\s;|`$&()'",=]+)['"]?/g;
-  while ((m = psRedirect.exec(cmd)) !== null) {
+  while ((m = psRedirect.exec(cmd)) === null) {
     ops.push({ op: 'write', path: m[1] });
   }
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [ 'src/foo.ts', 'src/bar.ts' ] to deeply equal [ 'src/b.ts' ]

[Survived] ConditionalExpression
bin/src/hooks.ts:276:10
 
   // Redirect operators: >, >>, *>, 1>, 2>, etc.
   const psRedirect = /(?:^|[\s;|&(])(?:\d*|\*)?>{1,2}\s+['"]?([^\s;|`$&()'",=]+)['"]?/g;
-  while ((m = psRedirect.exec(cmd)) !== null) {
+  while (false) {
     ops.push({ op: 'write', path: m[1] });
   }

[Survived] StringLiteral
bin/src/hooks.ts:277:20
   // Redirect operators: >, >>, *>, 1>, 2>, etc.
   const psRedirect = /(?:^|[\s;|&(])(?:\d*|\*)?>{1,2}\s+['"]?([^\s;|`$&()'",=]+)['"]?/g;
   while ((m = psRedirect.exec(cmd)) !== null) {
-    ops.push({ op: 'write', path: m[1] });
+    ops.push({ op: "", path: m[1] });
   }
 

[Killed] ArrayDeclaration
bin/src/hooks.ts:280:19
     ops.push({ op: 'write', path: m[1] });
   }
 
-  const cmdlets = [
-    'Set-Content',
-    'Out-File',
-    'Add-Content',
-    'Export-Csv',
-    'Export-CliXml',
-    'Tee-Object',
-  ];
+  const cmdlets = [];
   for (const cmdlet of cmdlets) {
     const re = new RegExp(
killedBy: protect-files 功能等价迁移 (AC-2) detectPowerShellWrite — Set-Content 写入 workflow.json 返回 deny
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] StringLiteral
bin/src/hooks.ts:284:5
     'Set-Content',
     'Out-File',
     'Add-Content',
-    'Export-Csv',
+    "",
     'Export-CliXml',
     'Tee-Object',
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [ 'x', '>', 'restore', 'src/b.ts' ] to deeply equal [ 'src/b.ts' ]

[Killed] BlockStatement
bin/src/hooks.ts:288:33
     'Export-CliXml',
     'Tee-Object',
   ];
-  for (const cmdlet of cmdlets) {
-    const re = new RegExp(
-      `\\b${cmdlet}\\s+(?:-(?:Path|FilePath)\\s+)?['"]?([^\\s;\`$&()'",=]+)['"]?`,
-      'gi',
-    );
-    while ((m = re.exec(cmd)) !== null) {
-      ops.push({ op: 'write', path: m[1] });
-    }
-  }
+  for (const cmdlet of cmdlets) {}
 
   const dotnetMethods = ['WriteAllText', 'WriteAllLines', 'WriteAllBytes', 'AppendAllText'];
killedBy: protect-files 功能等价迁移 (AC-2) detectPowerShellWrite — Set-Content 写入 workflow.json 返回 deny
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] ConditionalExpression
bin/src/hooks.ts:293:12
       `\\b${cmdlet}\\s+(?:-(?:Path|FilePath)\\s+)?['"]?([^\\s;\`$&()'",=]+)['"]?`,
       'gi',
     );
-    while ((m = re.exec(cmd)) !== null) {
+    while (false) {
       ops.push({ op: 'write', path: m[1] });
     }
killedBy: protect-files 功能等价迁移 (AC-2) detectPowerShellWrite — Set-Content 写入 workflow.json 返回 deny
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] BlockStatement
bin/src/hooks.ts:293:41
       `\\b${cmdlet}\\s+(?:-(?:Path|FilePath)\\s+)?['"]?([^\\s;\`$&()'",=]+)['"]?`,
       'gi',
     );
-    while ((m = re.exec(cmd)) !== null) {
-      ops.push({ op: 'write', path: m[1] });
-    }
+    while ((m = re.exec(cmd)) !== null) {}
   }
 
killedBy: protect-files 功能等价迁移 (AC-2) detectPowerShellWrite — Set-Content 写入 workflow.json 返回 deny
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] ObjectLiteral
bin/src/hooks.ts:294:16
       'gi',
     );
     while ((m = re.exec(cmd)) !== null) {
-      ops.push({ op: 'write', path: m[1] });
+      ops.push({});
     }
   }
killedBy: protect-files 功能等价迁移 (AC-2) detectPowerShellWrite — Set-Content 写入 workflow.json 返回 deny
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Survived] StringLiteral
bin/src/hooks.ts:294:22
       'gi',
     );
     while ((m = re.exec(cmd)) !== null) {
-      ops.push({ op: 'write', path: m[1] });
+      ops.push({ op: "", path: m[1] });
     }
   }

[Killed] StringLiteral
bin/src/hooks.ts:298:76
     }
   }
 
-  const dotnetMethods = ['WriteAllText', 'WriteAllLines', 'WriteAllBytes', 'AppendAllText'];
+  const dotnetMethods = ['WriteAllText', 'WriteAllLines', 'WriteAllBytes', ""];
   for (const method of dotnetMethods) {
     const re = new RegExp(
killedBy: protect-files 功能等价迁移 (AC-2) detectPowerShellWrite — [System.IO.File]::AppendAllText 追加 workflow.json 返回 deny
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] StringLiteral
bin/src/hooks.ts:298:42
     }
   }
 
-  const dotnetMethods = ['WriteAllText', 'WriteAllLines', 'WriteAllBytes', 'AppendAllText'];
+  const dotnetMethods = ['WriteAllText', "", 'WriteAllBytes', 'AppendAllText'];
   for (const method of dotnetMethods) {
     const re = new RegExp(
killedBy: protect-files 功能等价迁移 (AC-2) detectPowerShellWrite [System.IO.File]::WriteAllLines 写入 workflow.json 返回 deny (覆盖扩展)
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] BlockStatement
bin/src/hooks.ts:299:39
   }
 
   const dotnetMethods = ['WriteAllText', 'WriteAllLines', 'WriteAllBytes', 'AppendAllText'];
-  for (const method of dotnetMethods) {
-    const re = new RegExp(
-      `\\[System\\.IO\\.File\\]::${method}\\s*\\(\\s*['"]?([^,;\\)'"]+)['"]?`,
-      'gi',
-    );
-    while ((m = re.exec(cmd)) !== null) {
-      ops.push({ op: 'write', path: m[1] });
-    }
-  }
+  for (const method of dotnetMethods) {}
   return ops;
 }
killedBy: protect-files 功能等价迁移 (AC-2) detectPowerShellWrite — [System.IO.File]::WriteAllText 写入 workflow.json 返回 deny
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] EqualityOperator
bin/src/hooks.ts:304:12
       `\\[System\\.IO\\.File\\]::${method}\\s*\\(\\s*['"]?([^,;\\)'"]+)['"]?`,
       'gi',
     );
-    while ((m = re.exec(cmd)) !== null) {
+    while ((m = re.exec(cmd)) === null) {
       ops.push({ op: 'write', path: m[1] });
     }
killedBy: protect-files 功能等价迁移 (AC-2) detectBashWrite — > 重定向到 workflow.json 返回 deny
statusReason: Cannot read properties of null (reading '1')

[Killed] BlockStatement
bin/src/hooks.ts:315:50
  * Delete ops from per-path delete commands (flags skipped). `git rm` is
  * covered by the `rm` match; folding deduplicates.
  */
-function extractDeleteOps(cmd: string): FileOp[] {
-  const ops: FileOp[] = [];
-  for (const { args } of scanCommand(cmd, 'Remove-Item|rmdir|unlink|rm|del|rd')) {
-    for (const t of tokenize(args)) {
-      if (!isFlag(t)) ops.push({ op: 'delete', path: t });
-    }
-  }
-  return ops;
-}
+function extractDeleteOps(cmd: string): FileOp[] {}
 
 /** Move ops: two-argument form → delete(old) + write(new) double entry. */
killedBy: protect-files 功能等价迁移 (AC-2) detectBashWrite — > 重定向到 workflow.json 返回 deny
statusReason: extractDeleteOps is not a function or its return value is not iterable

[Killed] BlockStatement
bin/src/hooks.ts:317:82
  */
 function extractDeleteOps(cmd: string): FileOp[] {
   const ops: FileOp[] = [];
-  for (const { args } of scanCommand(cmd, 'Remove-Item|rmdir|unlink|rm|del|rd')) {
-    for (const t of tokenize(args)) {
-      if (!isFlag(t)) ops.push({ op: 'delete', path: t });
-    }
-  }
+  for (const { args } of scanCommand(cmd, 'Remove-Item|rmdir|unlink|rm|del|rd')) {}
   return ops;
 }
killedBy: record-files — 归账写清单 (AC-2, AC-4, AC-13) Bash rm src/old.ts → deleted 含 src/old.ts；PowerShell Remove-Item 同语义 (AC-2)
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
bin/src/hooks.ts:318:37
 function extractDeleteOps(cmd: string): FileOp[] {
   const ops: FileOp[] = [];
   for (const { args } of scanCommand(cmd, 'Remove-Item|rmdir|unlink|rm|del|rd')) {
-    for (const t of tokenize(args)) {
-      if (!isFlag(t)) ops.push({ op: 'delete', path: t });
-    }
+    for (const t of tokenize(args)) {}
   }
   return ops;
killedBy: record-files — 归账写清单 (AC-2, AC-4, AC-13) Bash rm src/old.ts → deleted 含 src/old.ts；PowerShell Remove-Item 同语义 (AC-2)
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
bin/src/hooks.ts:319:11
   const ops: FileOp[] = [];
   for (const { args } of scanCommand(cmd, 'Remove-Item|rmdir|unlink|rm|del|rd')) {
     for (const t of tokenize(args)) {
-      if (!isFlag(t)) ops.push({ op: 'delete', path: t });
+      if (false) ops.push({ op: 'delete', path: t });
     }
   }
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [ 'src/foo.ts', 'src/b.ts' ] to deeply equal [ 'src/b.ts' ]

[Killed] BooleanLiteral
bin/src/hooks.ts:319:11
   const ops: FileOp[] = [];
   for (const { args } of scanCommand(cmd, 'Remove-Item|rmdir|unlink|rm|del|rd')) {
     for (const t of tokenize(args)) {
-      if (!isFlag(t)) ops.push({ op: 'delete', path: t });
+      if (isFlag(t)) ops.push({ op: 'delete', path: t });
     }
   }
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [ 'src/foo.ts', 'src/b.ts' ] to deeply equal [ 'src/b.ts' ]

[Killed] BlockStatement
bin/src/hooks.ts:326:48
 }
 
 /** Move ops: two-argument form → delete(old) + write(new) double entry. */
-function extractMoveOps(cmd: string): FileOp[] {
-  const ops: FileOp[] = [];
-  for (const { args } of scanCommand(cmd, 'Move-Item|Rename-Item|ren|mv')) {
-    const paths = tokenize(args).filter((t) => !isFlag(t));
-    if (paths.length === 2) {
-      ops.push({ op: 'delete', path: paths[0] });
-      ops.push({ op: 'write', path: paths[1] });
-    }
-  }
-  return ops;
-}
+function extractMoveOps(cmd: string): FileOp[] {}
 
 /**
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [ 'src/foo.ts' ] to deeply equal [ 'src/b.ts' ]

[Survived] ArrayDeclaration
bin/src/hooks.ts:327:25
 
 /** Move ops: two-argument form → delete(old) + write(new) double entry. */
 function extractMoveOps(cmd: string): FileOp[] {
-  const ops: FileOp[] = [];
+  const ops: FileOp[] = ["Stryker was here"];
   for (const { args } of scanCommand(cmd, 'Move-Item|Rename-Item|ren|mv')) {
     const paths = tokenize(args).filter((t) => !isFlag(t));

[Killed] BlockStatement
bin/src/hooks.ts:328:76
 /** Move ops: two-argument form → delete(old) + write(new) double entry. */
 function extractMoveOps(cmd: string): FileOp[] {
   const ops: FileOp[] = [];
-  for (const { args } of scanCommand(cmd, 'Move-Item|Rename-Item|ren|mv')) {
-    const paths = tokenize(args).filter((t) => !isFlag(t));
-    if (paths.length === 2) {
-      ops.push({ op: 'delete', path: paths[0] });
-      ops.push({ op: 'write', path: paths[1] });
-    }
-  }
+  for (const { args } of scanCommand(cmd, 'Move-Item|Rename-Item|ren|mv')) {}
   return ops;
 }
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [] to deeply equal [ 'src/b.ts' ]

[Killed] ArrowFunction
bin/src/hooks.ts:329:41
 function extractMoveOps(cmd: string): FileOp[] {
   const ops: FileOp[] = [];
   for (const { args } of scanCommand(cmd, 'Move-Item|Rename-Item|ren|mv')) {
-    const paths = tokenize(args).filter((t) => !isFlag(t));
+    const paths = tokenize(args).filter(() => undefined);
     if (paths.length === 2) {
       ops.push({ op: 'delete', path: paths[0] });
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [] to deeply equal [ 'src/b.ts' ]

[Killed] BooleanLiteral
bin/src/hooks.ts:329:48
 function extractMoveOps(cmd: string): FileOp[] {
   const ops: FileOp[] = [];
   for (const { args } of scanCommand(cmd, 'Move-Item|Rename-Item|ren|mv')) {
-    const paths = tokenize(args).filter((t) => !isFlag(t));
+    const paths = tokenize(args).filter((t) => isFlag(t));
     if (paths.length === 2) {
       ops.push({ op: 'delete', path: paths[0] });
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [] to deeply equal [ 'src/b.ts' ]

[Killed] BlockStatement
bin/src/hooks.ts:330:29
   const ops: FileOp[] = [];
   for (const { args } of scanCommand(cmd, 'Move-Item|Rename-Item|ren|mv')) {
     const paths = tokenize(args).filter((t) => !isFlag(t));
-    if (paths.length === 2) {
-      ops.push({ op: 'delete', path: paths[0] });
-      ops.push({ op: 'write', path: paths[1] });
-    }
+    if (paths.length === 2) {}
   }
   return ops;
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [] to deeply equal [ 'src/b.ts' ]

[Killed] ConditionalExpression
bin/src/hooks.ts:330:9
   const ops: FileOp[] = [];
   for (const { args } of scanCommand(cmd, 'Move-Item|Rename-Item|ren|mv')) {
     const paths = tokenize(args).filter((t) => !isFlag(t));
-    if (paths.length === 2) {
+    if (false) {
       ops.push({ op: 'delete', path: paths[0] });
       ops.push({ op: 'write', path: paths[1] });
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [] to deeply equal [ 'src/b.ts' ]

[Killed] StringLiteral
bin/src/hooks.ts:331:22
   for (const { args } of scanCommand(cmd, 'Move-Item|Rename-Item|ren|mv')) {
     const paths = tokenize(args).filter((t) => !isFlag(t));
     if (paths.length === 2) {
-      ops.push({ op: 'delete', path: paths[0] });
+      ops.push({ op: "", path: paths[0] });
       ops.push({ op: 'write', path: paths[1] });
     }
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [ 'src/foo.ts' ] to deeply equal [ 'src/a.ts', 'src/foo.ts' ]

[Killed] BlockStatement
bin/src/hooks.ts:356:48
  * evaluator and the `change_files` tool. No python/node exemption here — the
  * exemption is a PreToolUse protection concern applied by the check functions.
  */
-function extractFileOps(cmd: string): FileOp[] {
-  return [
-    ...extractBashRedirectWriteOps(cmd),
-    ...extractPowerShellWriteOps(cmd),
-    ...extractDeleteOps(cmd),
-    ...extractMoveOps(cmd),
-    ...extractGitOps(cmd),
-  ];
-}
+function extractFileOps(cmd: string): FileOp[] {}
 
 // ---------------------------------------------------------------------------
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [ 'src/foo.ts' ] to deeply equal [ 'src/b.ts' ]

[Survived] StringLiteral
bin/src/hooks.ts:372:31
 
 /** Directory globs for the bulk-revert interception rules. */
 const OPENSPEC_GLOB = '**/openspec/**';
-const OPENSPEC_CHANGES_GLOB = '**/openspec/changes/**';
+const OPENSPEC_CHANGES_GLOB = "";
 
 /**

[Killed] BlockStatement
bin/src/hooks.ts:384:18
   cmd: string,
   patterns: ProtectedPattern[],
   toolName: string,
-): string | null {
-  for (const op of extractFileOps(cmd)) {
-    if (op.op === 'revert') continue;
-    const result = isProtected(op.path, patterns);
-    if (result.matched) {
-      return buildDenyReason(result, op.path, toolName);
-    }
-  }
-  return null;
-}
+): string | null {}
 
 /**
killedBy: protect-files 功能等价迁移 (AC-2) detectBashWrite — > 重定向到 workflow.json 返回 deny
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] BlockStatement
bin/src/hooks.ts:385:41
   patterns: ProtectedPattern[],
   toolName: string,
 ): string | null {
-  for (const op of extractFileOps(cmd)) {
-    if (op.op === 'revert') continue;
-    const result = isProtected(op.path, patterns);
-    if (result.matched) {
-      return buildDenyReason(result, op.path, toolName);
-    }
-  }
+  for (const op of extractFileOps(cmd)) {}
   return null;
 }
killedBy: 工具 deny 与 fs 成功并存 Shell 重定向写 workflow.json 时 deny，且不影响随后的 writeEvalJson
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] ConditionalExpression
bin/src/hooks.ts:386:9
   toolName: string,
 ): string | null {
   for (const op of extractFileOps(cmd)) {
-    if (op.op === 'revert') continue;
+    if (true) continue;
     const result = isProtected(op.path, patterns);
     if (result.matched) {
killedBy: protect-files 功能等价迁移 (AC-2) detectBashWrite — > 重定向到 workflow.json 返回 deny
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] EqualityOperator
bin/src/hooks.ts:386:9
   toolName: string,
 ): string | null {
   for (const op of extractFileOps(cmd)) {
-    if (op.op === 'revert') continue;
+    if (op.op !== 'revert') continue;
     const result = isProtected(op.path, patterns);
     if (result.matched) {
killedBy: protect-files 功能等价迁移 (AC-2) detectBashWrite — > 重定向到 workflow.json 返回 deny
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] BlockStatement
bin/src/hooks.ts:388:25
   for (const op of extractFileOps(cmd)) {
     if (op.op === 'revert') continue;
     const result = isProtected(op.path, patterns);
-    if (result.matched) {
-      return buildDenyReason(result, op.path, toolName);
-    }
+    if (result.matched) {}
   }
   return null;
killedBy: protect-files 功能等价迁移 (AC-2) detectBashWrite — > 重定向到 workflow.json 返回 deny
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] ConditionalExpression
bin/src/hooks.ts:388:9
   for (const op of extractFileOps(cmd)) {
     if (op.op === 'revert') continue;
     const result = isProtected(op.path, patterns);
-    if (result.matched) {
+    if (true) {
       return buildDenyReason(result, op.path, toolName);
     }
killedBy: protect-files 功能等价迁移 (AC-2) detectPowerShellWrite 写入非受保护文件时返回 allow (覆盖扩展)
statusReason: expected 'deny' to be 'allow' // Object.is equality

[Killed] ConditionalExpression
bin/src/hooks.ts:408:10
   const stashRe = /\bgit\s+stash\b([^\n;&|]*)/gi;
   stashRe.lastIndex = 0;
   let m: RegExpExecArray | null;
-  while ((m = stashRe.exec(cmd)) !== null) {
+  while (false) {
     const args = m[1].trim();
     if (!/^(list|show)\b/.test(args)) {
killedBy: protect-files — 扩拦截：git stash / clean / restore / rm / mv (AC-5, AC-4) git stash / git stash pop / git clean -fd（无路径限定）→ deny (AC-5)
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] EqualityOperator
bin/src/hooks.ts:408:10
   const stashRe = /\bgit\s+stash\b([^\n;&|]*)/gi;
   stashRe.lastIndex = 0;
   let m: RegExpExecArray | null;
-  while ((m = stashRe.exec(cmd)) !== null) {
+  while ((m = stashRe.exec(cmd)) === null) {
     const args = m[1].trim();
     if (!/^(list|show)\b/.test(args)) {
killedBy: protect-files 功能等价迁移 (AC-2) detectBashWrite 含 "->" 但无写入操作时返回 allow
statusReason: Cannot read properties of null (reading '1')

[Killed] MethodExpression
bin/src/hooks.ts:409:18
   stashRe.lastIndex = 0;
   let m: RegExpExecArray | null;
   while ((m = stashRe.exec(cmd)) !== null) {
-    const args = m[1].trim();
+    const args = m[1];
     if (!/^(list|show)\b/.test(args)) {
       return buildBulkRevertDenyReason(toolName, 'git stash 会批量改写工作区');
killedBy: protect-files — 扩拦截：git stash / clean / restore / rm / mv (AC-5, AC-4) git stash list / git stash show 只读形态 → allow (AC-5)
statusReason: expected 'deny' to be 'allow' // Object.is equality

[Killed] ConditionalExpression
bin/src/hooks.ts:410:9
   let m: RegExpExecArray | null;
   while ((m = stashRe.exec(cmd)) !== null) {
     const args = m[1].trim();
-    if (!/^(list|show)\b/.test(args)) {
+    if (true) {
       return buildBulkRevertDenyReason(toolName, 'git stash 会批量改写工作区');
     }
killedBy: protect-files — 扩拦截：git stash / clean / restore / rm / mv (AC-5, AC-4) git stash list / git stash show 只读形态 → allow (AC-5)
statusReason: expected 'deny' to be 'allow' // Object.is equality

[Killed] BlockStatement
bin/src/hooks.ts:410:39
   let m: RegExpExecArray | null;
   while ((m = stashRe.exec(cmd)) !== null) {
     const args = m[1].trim();
-    if (!/^(list|show)\b/.test(args)) {
-      return buildBulkRevertDenyReason(toolName, 'git stash 会批量改写工作区');
-    }
+    if (!/^(list|show)\b/.test(args)) {}
   }
 
killedBy: protect-files — 扩拦截：git stash / clean / restore / rm / mv (AC-5, AC-4) git stash / git stash pop / git clean -fd（无路径限定）→ deny (AC-5)
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Survived] StringLiteral
bin/src/hooks.ts:411:50
   while ((m = stashRe.exec(cmd)) !== null) {
     const args = m[1].trim();
     if (!/^(list|show)\b/.test(args)) {
-      return buildBulkRevertDenyReason(toolName, 'git stash 会批量改写工作区');
+      return buildBulkRevertDenyReason(toolName, "");
     }
   }

[Killed] Regex
bin/src/hooks.ts:415:19
     }
   }
 
-  const cleanRe = /\bgit\s+clean\b([^\n;&|]*)/gi;
+  const cleanRe = /\bgit\s+clean\b([^\n;&|])/gi;
   cleanRe.lastIndex = 0;
   while ((m = cleanRe.exec(cmd)) !== null) {
killedBy: protect-files — 扩拦截：git stash / clean / restore / rm / mv (AC-5, AC-4) git clean <openspec 下路径> → deny；git clean -n / --dry-run 只读形态 → allow (AC-5)
statusReason: expected 'deny' to be 'allow' // Object.is equality

[Killed] Regex
bin/src/hooks.ts:415:19
     }
   }
 
-  const cleanRe = /\bgit\s+clean\b([^\n;&|]*)/gi;
+  const cleanRe = /\bgit\S+clean\b([^\n;&|]*)/gi;
   cleanRe.lastIndex = 0;
   while ((m = cleanRe.exec(cmd)) !== null) {
killedBy: protect-files — 扩拦截：git stash / clean / restore / rm / mv (AC-5, AC-4) git stash / git stash pop / git clean -fd（无路径限定）→ deny (AC-5)
statusReason: expected 'allow' to be 'deny' // Object.is equality

[Killed] EqualityOperator
bin/src/hooks.ts:417:10
 
   const cleanRe = /\bgit\s+clean\b([^\n;&|]*)/gi;
   cleanRe.lastIndex = 0;
-  while ((m = cleanRe.exec(cmd)) !== null) {
+  while ((m = cleanRe.exec(cmd)) === null) {
     const tokens = tokenize(m[1]);
     const isDryRun = tokens.some((t) => t === '--dry-run' || /^-[^-]*n/.test(t));
killedBy: protect-files 功能等价迁移 (AC-2) detectBashWrite 含 "->" 但无写入操作时返回 allow
statusReason: Cannot read properties of null (reading '1')
