[Killed] ConditionalExpression
bin/src/hooks.ts:723:7
 
   const projectRoot = getProjectDir();
 
-  if (isPhaseNextCall(toolName)) {
+  if (false) {
     bindFromPhaseNextCall(projectRoot, sessionId, toolInput);
     return;
killedBy: record-files — phase_next 建绑 (AC-3) 全名 mcp__plugin_dev-team_dev-team__phase_next 事件（tool_input.change=change-a）→ bindSession 被调用且不写清单 (AC-3)
statusReason: expected "vi.fn()" to be called with arguments: [ …(3) ]

Number of calls: 0

[Killed] ConditionalExpression
bin/src/hooks.ts:728:7
     return;
   }
 
-  if (!sessionId) return;
+  if (true) return;
   const change = lookupChange(projectRoot, sessionId);
   if (!change) {
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [] to deeply equal [ 'src/b.ts' ]

[Killed] BooleanLiteral
bin/src/hooks.ts:728:7
     return;
   }
 
-  if (!sessionId) return;
+  if (sessionId) return;
   const change = lookupChange(projectRoot, sessionId);
   if (!change) {
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [] to deeply equal [ 'src/b.ts' ]

[Killed] ConditionalExpression
bin/src/hooks.ts:730:7
 
   if (!sessionId) return;
   const change = lookupChange(projectRoot, sessionId);
-  if (!change) {
+  if (false) {
     process.stderr.write(
       `record-files: session ${sessionId} 未绑定 change，丢弃 ${toolName} 事件\n`,
killedBy: 场景: 工作流事件序列回放净状态 注册表文件被外部删除后写事件静默丢弃：stderr 诊断、exit 0、workflow.json 逐字节不变
statusReason: expected 'record-files: The "paths[3]" argument…' to contain '未绑定'

[Killed] BooleanLiteral
bin/src/hooks.ts:730:7
 
   if (!sessionId) return;
   const change = lookupChange(projectRoot, sessionId);
-  if (!change) {
+  if (change) {
     process.stderr.write(
       `record-files: session ${sessionId} 未绑定 change，丢弃 ${toolName} 事件\n`,
killedBy: record-files — 归账写清单 (AC-2, AC-4, AC-13) 已绑定 session 的 Write 事件 file_path=src/foo.ts → 清单 written 含 src/foo.ts（相对项目根 POSIX 风格，AC-2）
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
bin/src/hooks.ts:739:7
 
   const ops = extractOpsFromToolInput(toolName, toolInput);
   const recorded = collectRecordedOps(ops, projectRoot, agentType);
-  if (recorded.length === 0) return;
+  if (true) return;
 
   const changeDir = getChangeDir(change, projectRoot);
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [] to deeply equal [ 'src/b.ts' ]

[Killed] EqualityOperator
bin/src/hooks.ts:739:7
 
   const ops = extractOpsFromToolInput(toolName, toolInput);
   const recorded = collectRecordedOps(ops, projectRoot, agentType);
-  if (recorded.length === 0) return;
+  if (recorded.length !== 0) return;
 
   const changeDir = getChangeDir(change, projectRoot);
killedBy: record-files — 归账写清单 (AC-2, AC-4, AC-13) 已绑定 session 的 Write 事件 file_path=src/foo.ts → 清单 written 含 src/foo.ts（相对项目根 POSIX 风格，AC-2）
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
bin/src/hooks.ts:755:40
  * `files` — is written to stderr only and the process exits 0: recording
  * MUST NOT block the observed tool call.
  */
-export function runRecordFiles(): void {
-  let stdinRaw: string;
-  try {
-    stdinRaw = readFileSync(0, 'utf-8');
-  } catch {
-    return;
-  }
-  try {
-    recordFilesEvent(stdinRaw);
-  } catch (e: unknown) {
-    const message = e instanceof Error ? e.message : String(e);
-    process.stderr.write(`record-files: ${message}\n`);
-  }
-}
+export function runRecordFiles(): void {}
 
 // ---------------------------------------------------------------------------
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [ Array(1) ] to have a length of +0 but got 1

[Killed] BlockStatement
bin/src/hooks.ts:757:7
  */
 export function runRecordFiles(): void {
   let stdinRaw: string;
-  try {
-    stdinRaw = readFileSync(0, 'utf-8');
-  } catch {
+  try {} catch {
     return;
   }
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [ Array(1) ] to have a length of +0 but got 1

[Killed] BlockStatement
bin/src/hooks.ts:762:7
   } catch {
     return;
   }
-  try {
-    recordFilesEvent(stdinRaw);
-  } catch (e: unknown) {
+  try {} catch (e: unknown) {
     const message = e instanceof Error ? e.message : String(e);
     process.stderr.write(`record-files: ${message}\n`);
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [] to deeply equal [ 'src/b.ts' ]

[Killed] BlockStatement
bin/src/hooks.ts:764:24
   }
   try {
     recordFilesEvent(stdinRaw);
-  } catch (e: unknown) {
-    const message = e instanceof Error ? e.message : String(e);
-    process.stderr.write(`record-files: ${message}\n`);
-  }
+  } catch (e: unknown) {}
 }
 
killedBy: record-files — 归账写清单 (AC-2, AC-4, AC-13) 目标 change 缺 workflow.json / 无 files → 静默（stderr 诊断、exit 0），不产生半写状态
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
bin/src/hooks.ts:784:83
  * Used by runStaticCheck to capture runStaticAnalysis output without
  * letting it leak to the real stderr.
  */
-export function captureStderr(): [getCaptured: () => string, restore: () => void] {
-  const chunks: string[] = [];
-  const origWrite = process.stderr.write.bind(process.stderr);
-
-  // The type assertion is necessary because the replacement function's
-  // simplified signature doesn't match the full overloaded Writable type.
-  process.stderr.write = ((chunk: string | Uint8Array): boolean => {
-    chunks.push(typeof chunk === 'string' ? chunk : Buffer.from(chunk).toString());
-    return true;
-  }) as typeof process.stderr.write;
-
-  function restore(): void {
-    process.stderr.write = origWrite;
-  }
-
-  return [() => chunks.join(''), restore];
-}
+export function captureStderr(): [getCaptured: () => string, restore: () => void] {}
 
 // ---------------------------------------------------------------------------
killedBy: hooks 子命令调度 (AC-1) process.argv[2] = "static-check" 时 main 调用 runStaticCheck 并输出 JSON
statusReason: captureStderr is not a function or its return value is not iterable

[Killed] BlockStatement
bin/src/hooks.ts:795:28
     return true;
   }) as typeof process.stderr.write;
 
-  function restore(): void {
-    process.stderr.write = origWrite;
-  }
+  function restore(): void {}
 
   return [() => chunks.join(''), restore];
killedBy: captureStderr 辅助函数 captureStderr restore 后写入不被收集
statusReason: expected 'beforeafter' to be 'before' // Object.is equality

[Killed] ArrowFunction
bin/src/hooks.ts:799:11
     process.stderr.write = origWrite;
   }
 
-  return [() => chunks.join(''), restore];
+  return [() => undefined, restore];
 }
 
killedBy: static-check 进程内调用 (AC-4) runStaticAnalysis 返回非零但无 stderr 时输出 { decision: "block" } 和默认 reason
statusReason: expected '静态检查未通过，请修复以下错误后重新提交：\n\nundefined' to be '静态检查未通过，请修复以下错误后重新提交：\n\n' // Object.is equality

[Killed] BlockStatement
bin/src/hooks.ts:815:62
  * then type-check) rather than a single compound condition, which makes
  * Stryker boundary/logical mutations individually killable.
  */
-function parseWorkspaceRoot(stdinRaw: string): string | null {
-  try {
-    const parsed: Record<string, unknown> = JSON.parse(stdinRaw);
-    const roots = parsed.workspace_roots;
-    const firstRoot: unknown = Array.isArray(roots) && roots.length > 0 ? roots[0] : undefined;
-    if (typeof firstRoot === 'string') {
-      return path.posix.join(...firstRoot.split(path.sep));
-    }
-  } catch {
-    // ignore JSON parse errors
-  }
-  return null;
-}
+function parseWorkspaceRoot(stdinRaw: string): string | null {}
 
 /**
killedBy: static-check 进程内调用 (AC-4) runStaticCheck 调用 runStaticAnalysis 时传递从 stdin 解析的 workspaceRoot
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
bin/src/hooks.ts:816:7
  * Stryker boundary/logical mutations individually killable.
  */
 function parseWorkspaceRoot(stdinRaw: string): string | null {
-  try {
-    const parsed: Record<string, unknown> = JSON.parse(stdinRaw);
-    const roots = parsed.workspace_roots;
-    const firstRoot: unknown = Array.isArray(roots) && roots.length > 0 ? roots[0] : undefined;
-    if (typeof firstRoot === 'string') {
-      return path.posix.join(...firstRoot.split(path.sep));
-    }
-  } catch {
+  try {} catch {
     // ignore JSON parse errors
   }
killedBy: static-check 进程内调用 (AC-4) runStaticCheck 调用 runStaticAnalysis 时传递从 stdin 解析的 workspaceRoot
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] EqualityOperator
bin/src/hooks.ts:819:56
   try {
     const parsed: Record<string, unknown> = JSON.parse(stdinRaw);
     const roots = parsed.workspace_roots;
-    const firstRoot: unknown = Array.isArray(roots) && roots.length > 0 ? roots[0] : undefined;
+    const firstRoot: unknown = Array.isArray(roots) && roots.length <= 0 ? roots[0] : undefined;
     if (typeof firstRoot === 'string') {
       return path.posix.join(...firstRoot.split(path.sep));
killedBy: static-check 进程内调用 (AC-4) runStaticCheck 调用 runStaticAnalysis 时传递从 stdin 解析的 workspaceRoot
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] LogicalOperator
bin/src/hooks.ts:819:32
   try {
     const parsed: Record<string, unknown> = JSON.parse(stdinRaw);
     const roots = parsed.workspace_roots;
-    const firstRoot: unknown = Array.isArray(roots) && roots.length > 0 ? roots[0] : undefined;
+    const firstRoot: unknown = Array.isArray(roots) || roots.length > 0 ? roots[0] : undefined;
     if (typeof firstRoot === 'string') {
       return path.posix.join(...firstRoot.split(path.sep));
killedBy: runStaticCheck / parseWorkspaceRoot 与 captureStderr（突变补强） workspace_roots 为 [] / 非数组 / [123] 时回退 getProjectDir
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
bin/src/hooks.ts:820:9
     const parsed: Record<string, unknown> = JSON.parse(stdinRaw);
     const roots = parsed.workspace_roots;
     const firstRoot: unknown = Array.isArray(roots) && roots.length > 0 ? roots[0] : undefined;
-    if (typeof firstRoot === 'string') {
+    if (false) {
       return path.posix.join(...firstRoot.split(path.sep));
     }
killedBy: static-check 进程内调用 (AC-4) runStaticCheck 调用 runStaticAnalysis 时传递从 stdin 解析的 workspaceRoot
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] EqualityOperator
bin/src/hooks.ts:820:9
     const parsed: Record<string, unknown> = JSON.parse(stdinRaw);
     const roots = parsed.workspace_roots;
     const firstRoot: unknown = Array.isArray(roots) && roots.length > 0 ? roots[0] : undefined;
-    if (typeof firstRoot === 'string') {
+    if (typeof firstRoot !== 'string') {
       return path.posix.join(...firstRoot.split(path.sep));
     }
killedBy: static-check 进程内调用 (AC-4) runStaticCheck 调用 runStaticAnalysis 时传递从 stdin 解析的 workspaceRoot
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
bin/src/hooks.ts:836:40
  * calls runStaticAnalysis in-process (no spawnSync), captures stderr
  * output, and formats the result.
  */
-export function runStaticCheck(): void {
-  const stdinRaw = readFileSync(0, 'utf-8');
-  const workspaceRoot = parseWorkspaceRoot(stdinRaw);
-  const projectRoot = workspaceRoot || getProjectDir();
-
-  const [getCaptured, restore] = captureStderr();
-  let exitCode: number;
-  try {
-    exitCode = runStaticAnalysis({ projectRoot });
-  } finally {
-    restore();
-  }
-
-  if (exitCode === 0) {
-    process.stdout.write('{}\n');
-    return;
-  }
-
-  const captured = getCaptured();
-  const reason = FOLLOWUP_PREFIX + captured;
-  process.stdout.write(
-    `${JSON.stringify({ decision: 'block', reason, followup_message: reason })}\n`,
-  );
-}
+export function runStaticCheck(): void {}
 
 // ---------------------------------------------------------------------------
killedBy: hooks 子命令调度 (AC-1) process.argv[2] = "static-check" 时 main 调用 runStaticCheck 并输出 JSON
statusReason: expected '' to contain '{}'

[Killed] ConditionalExpression
bin/src/hooks.ts:839:23
 export function runStaticCheck(): void {
   const stdinRaw = readFileSync(0, 'utf-8');
   const workspaceRoot = parseWorkspaceRoot(stdinRaw);
-  const projectRoot = workspaceRoot || getProjectDir();
+  const projectRoot = false;
 
   const [getCaptured, restore] = captureStderr();
killedBy: static-check 进程内调用 (AC-4) runStaticCheck 调用 runStaticAnalysis 时传递从 stdin 解析的 workspaceRoot
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
bin/src/hooks.ts:839:23
 export function runStaticCheck(): void {
   const stdinRaw = readFileSync(0, 'utf-8');
   const workspaceRoot = parseWorkspaceRoot(stdinRaw);
-  const projectRoot = workspaceRoot || getProjectDir();
+  const projectRoot = true;
 
   const [getCaptured, restore] = captureStderr();
killedBy: static-check 进程内调用 (AC-4) runStaticCheck 调用 runStaticAnalysis 时传递从 stdin 解析的 workspaceRoot
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
bin/src/hooks.ts:843:7
 
   const [getCaptured, restore] = captureStderr();
   let exitCode: number;
-  try {
-    exitCode = runStaticAnalysis({ projectRoot });
-  } finally {
+  try {} finally {
     restore();
   }
killedBy: hooks 子命令调度 (AC-1) process.argv[2] = "static-check" 时 main 调用 runStaticCheck 并输出 JSON
statusReason: expected '{"decision":"block","reason":"静态检查未通过…' to contain '{}'

[Killed] ObjectLiteral
bin/src/hooks.ts:844:34
   const [getCaptured, restore] = captureStderr();
   let exitCode: number;
   try {
-    exitCode = runStaticAnalysis({ projectRoot });
+    exitCode = runStaticAnalysis({});
   } finally {
     restore();
killedBy: static-check 进程内调用 (AC-4) runStaticCheck 调用 runStaticAnalysis 时传递从 stdin 解析的 workspaceRoot
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Survived] BlockStatement
bin/src/hooks.ts:845:13
   let exitCode: number;
   try {
     exitCode = runStaticAnalysis({ projectRoot });
-  } finally {
-    restore();
-  }
+  } finally {}
 
   if (exitCode === 0) {

[Killed] ConditionalExpression
bin/src/hooks.ts:849:7
     restore();
   }
 
-  if (exitCode === 0) {
+  if (true) {
     process.stdout.write('{}\n');
     return;
killedBy: static-check 进程内调用 (AC-4) runStaticAnalysis 返回非零但无 stderr 时输出 { decision: "block" } 和默认 reason
statusReason: expected undefined to be 'block' // Object.is equality

[Killed] EqualityOperator
bin/src/hooks.ts:849:7
     restore();
   }
 
-  if (exitCode === 0) {
+  if (exitCode !== 0) {
     process.stdout.write('{}\n');
     return;
killedBy: hooks 子命令调度 (AC-1) process.argv[2] = "static-check" 时 main 调用 runStaticCheck 并输出 JSON
statusReason: expected '{"decision":"block","reason":"静态检查未通过…' to contain '{}'

[Killed] ArithmeticOperator
bin/src/hooks.ts:855:18
   }
 
   const captured = getCaptured();
-  const reason = FOLLOWUP_PREFIX + captured;
+  const reason = FOLLOWUP_PREFIX - captured;
   process.stdout.write(
     `${JSON.stringify({ decision: 'block', reason, followup_message: reason })}\n`,
killedBy: static-check 进程内调用 (AC-4) runStaticAnalysis 返回非零但无 stderr 时输出 { decision: "block" } 和默认 reason
statusReason: expected null to be '静态检查未通过，请修复以下错误后重新提交：\n\n' // Object.is equality

[Killed] StringLiteral
bin/src/hooks.ts:857:35
   const captured = getCaptured();
   const reason = FOLLOWUP_PREFIX + captured;
   process.stdout.write(
-    `${JSON.stringify({ decision: 'block', reason, followup_message: reason })}\n`,
+    `${JSON.stringify({ decision: "", reason, followup_message: reason })}\n`,
   );
 }
killedBy: static-check 进程内调用 (AC-4) runStaticAnalysis 返回非零但无 stderr 时输出 { decision: "block" } 和默认 reason
statusReason: expected '' to be 'block' // Object.is equality

[Killed] ObjectLiteral
bin/src/hooks.ts:857:23
   const captured = getCaptured();
   const reason = FOLLOWUP_PREFIX + captured;
   process.stdout.write(
-    `${JSON.stringify({ decision: 'block', reason, followup_message: reason })}\n`,
+    `${JSON.stringify({})}\n`,
   );
 }
killedBy: static-check 进程内调用 (AC-4) runStaticAnalysis 返回非零但无 stderr 时输出 { decision: "block" } 和默认 reason
statusReason: expected undefined to be 'block' // Object.is equality

[Killed] BlockStatement
bin/src/hooks.ts:869:30
  * Top-level entry function.
  * Parses process.argv[2] as the subcommand name and dispatches.
  */
-export function main(): void {
-  const subcommand = process.argv[2];
-
-  switch (subcommand) {
-    case 'protect-files':
-      runProtectFiles();
-      break;
-    case 'record-files':
-      runRecordFiles();
-      break;
-    case 'static-check':
-      runStaticCheck();
-      break;
-    default: {
-      process.stderr.write(`Unknown subcommand: ${subcommand}\n`);
-      process.exit(1);
-    }
-  }
-}
+export function main(): void {}
 
 // Execute main with a catch-all for unexpected errors.
killedBy: hooks 子命令调度 (AC-1) process.argv[2] = "protect-files" 时 main 调用 runProtectFiles 并输出 allow JSON
statusReason: Unexpected end of JSON input

[Killed] ConditionalExpression
bin/src/hooks.ts:873:5
   const subcommand = process.argv[2];
 
   switch (subcommand) {
-    case 'protect-files':
-      runProtectFiles();
-      break;
+    case 'protect-files':
     case 'record-files':
       runRecordFiles();
killedBy: hooks 子命令调度 (AC-1) process.argv[2] = "protect-files" 时 main 调用 runProtectFiles 并输出 allow JSON
statusReason: Unexpected end of JSON input

[Killed] StringLiteral
bin/src/hooks.ts:873:10
   const subcommand = process.argv[2];
 
   switch (subcommand) {
-    case 'protect-files':
+    case "":
       runProtectFiles();
       break;
killedBy: hooks 子命令调度 (AC-1) process.argv[2] = "protect-files" 时 main 调用 runProtectFiles 并输出 allow JSON
statusReason: Unexpected end of JSON input

[Killed] ConditionalExpression
bin/src/hooks.ts:876:5
     case 'protect-files':
       runProtectFiles();
       break;
-    case 'record-files':
-      runRecordFiles();
-      break;
+    case 'record-files':
     case 'static-check':
       runStaticCheck();
killedBy: main — record-files 子命令分发 argv[2]='record-files' → 分发执行 runRecordFiles（phase_next 事件完成建绑）
statusReason: expected "vi.fn()" to be called with arguments: [ …(3) ]

Number of calls: 0

[Killed] ConditionalExpression
bin/src/hooks.ts:879:5
     case 'record-files':
       runRecordFiles();
       break;
-    case 'static-check':
-      runStaticCheck();
-      break;
+    case 'static-check':
     default: {
       process.stderr.write(`Unknown subcommand: ${subcommand}\n`);
killedBy: hooks 子命令调度 (AC-1) process.argv[2] = "static-check" 时 main 调用 runStaticCheck 并输出 JSON
statusReason: expected '' to contain '{}'

[Killed] BlockStatement
bin/src/hooks.ts:882:14
     case 'static-check':
       runStaticCheck();
       break;
-    default: {
-      process.stderr.write(`Unknown subcommand: ${subcommand}\n`);
-      process.exit(1);
-    }
+    default: {}
   }
 }
killedBy: hooks 子命令调度 (AC-1) 未知子命令 "unknown" 时 process.exit(1)，stderr 含子命令名
statusReason: expected "Mock" to be called with arguments: [ 1 ]

Number of calls: 0

[Killed] ConditionalExpression
bin/src/hooks.ts:882:5
     case 'static-check':
       runStaticCheck();
       break;
-    default: {
-      process.stderr.write(`Unknown subcommand: ${subcommand}\n`);
-      process.exit(1);
-    }
+    default:
   }
 }
killedBy: hooks 子命令调度 (AC-1) 未知子命令 "unknown" 时 process.exit(1)，stderr 含子命令名
statusReason: expected "Mock" to be called with arguments: [ 1 ]

Number of calls: 0

[Killed] StringLiteral
bin/src/hooks.ts:883:28
       runStaticCheck();
       break;
     default: {
-      process.stderr.write(`Unknown subcommand: ${subcommand}\n`);
+      process.stderr.write(``);
       process.exit(1);
     }
killedBy: hooks — 子命令调度（异常补强） argv[2] 为未知子命令（含 Protect-Files 大小写变体 / 随机串）：stderr 含 Unknown subcommand: + 原文，exit(1)
statusReason: expected '' to contain 'Unknown subcommand:'

[Killed] BlockStatement
bin/src/hooks.ts:891:5
 
 // Execute main with a catch-all for unexpected errors.
 // Outputs { decision: "block", reason: <error message> } on crash per design risk mitigation.
-try {
-  main();
-} catch (error: unknown) {
+try {} catch (error: unknown) {
   const message = error instanceof Error ? error.message : String(error);
   process.stdout.write(`${JSON.stringify({ decision: 'block', reason: message })}\n`);
killedBy: hooks 子命令调度 (AC-1) 顶层 try-catch 包裹整个处理流程，任何未捕获异常输出 { decision: "block", reason } (边界)
statusReason: Unexpected end of JSON input

[Killed] BlockStatement
bin/src/hooks.ts:893:26
 // Outputs { decision: "block", reason: <error message> } on crash per design risk mitigation.
 try {
   main();
-} catch (error: unknown) {
-  const message = error instanceof Error ? error.message : String(error);
-  process.stdout.write(`${JSON.stringify({ decision: 'block', reason: message })}\n`);
-  process.exit(1);
-}
+} catch (error: unknown) {}
 
killedBy: hooks 子命令调度 (AC-1) 顶层 try-catch 包裹整个处理流程，任何未捕获异常输出 { decision: "block", reason } (边界)
statusReason: Unexpected end of JSON input

[Killed] StringLiteral
bin/src/hooks.ts:895:54
   main();
 } catch (error: unknown) {
   const message = error instanceof Error ? error.message : String(error);
-  process.stdout.write(`${JSON.stringify({ decision: 'block', reason: message })}\n`);
+  process.stdout.write(`${JSON.stringify({ decision: "", reason: message })}\n`);
   process.exit(1);
 }
killedBy: hooks 子命令调度 (AC-1) 顶层 try-catch 包裹整个处理流程，任何未捕获异常输出 { decision: "block", reason } (边界)
statusReason: expected '' to be 'block' // Object.is equality
