[Survived] ConditionalExpression
bin/src/lib/c4-cross-ref.ts:241:7
   if (norm in pathToElement) return pathToElement[norm];
 
   // Try as directory (append /)
-  if (norm + '/' in pathToElement) return pathToElement[norm + '/'];
+  if (false) return pathToElement[norm + '/'];
 
   // Check if norm is under any registered path

[Killed] BlockStatement
bin/src/lib/c4-cross-ref.ts:244:69
   if (norm + '/' in pathToElement) return pathToElement[norm + '/'];
 
   // Check if norm is under any registered path
-  for (const [elemPath, elemName] of Object.entries(pathToElement)) {
-    if (norm.startsWith(elemPath + '/') || norm === elemPath) {
-      return elemName;
-    }
-  }
+  for (const [elemPath, elemName] of Object.entries(pathToElement)) {}
 
   // Try with common extensions
killedBy: runCrossRefCheck — unmodeled_dependency 模型未声明关系时应返回 violations_found
statusReason: expected 'clean' to be 'violations_found' // Object.is equality

[Killed] BlockStatement
bin/src/lib/c4-cross-ref.ts:245:63
 
   // Check if norm is under any registered path
   for (const [elemPath, elemName] of Object.entries(pathToElement)) {
-    if (norm.startsWith(elemPath + '/') || norm === elemPath) {
-      return elemName;
-    }
+    if (norm.startsWith(elemPath + '/') || norm === elemPath) {}
   }
 
killedBy: runCrossRefCheck — unmodeled_dependency 模型未声明关系时应返回 violations_found
statusReason: expected 'clean' to be 'violations_found' // Object.is equality

[Killed] ConditionalExpression
bin/src/lib/c4-cross-ref.ts:245:9
 
   // Check if norm is under any registered path
   for (const [elemPath, elemName] of Object.entries(pathToElement)) {
-    if (norm.startsWith(elemPath + '/') || norm === elemPath) {
+    if (false) {
       return elemName;
     }
killedBy: 场景: 清单直通检查（change 清单 → archi_check 被查文件集） 正向：change 清单模式 → files.written 全量参与被查（测试文件直通不过滤），matched / unmatched_files / violations 反映直通集合 (AC-9)
statusReason: expected [] to have a length of 1 but got +0

[Survived] BlockStatement
bin/src/lib/c4-cross-ref.ts:251:60
   }
 
   // Try with common extensions
-  for (const ext of ['.ts', '.tsx', '.js', '.jsx', '.py']) {
-    const candidate = norm + ext;
-    if (candidate in pathToElement) return pathToElement[candidate];
-  }
+  for (const ext of ['.ts', '.tsx', '.js', '.jsx', '.py']) {}
 
   return null;

[Survived] ArrayDeclaration
bin/src/lib/c4-cross-ref.ts:251:21
   }
 
   // Try with common extensions
-  for (const ext of ['.ts', '.tsx', '.js', '.jsx', '.py']) {
+  for (const ext of []) {
     const candidate = norm + ext;
     if (candidate in pathToElement) return pathToElement[candidate];

[Survived] ArithmeticOperator
bin/src/lib/c4-cross-ref.ts:252:23
 
   // Try with common extensions
   for (const ext of ['.ts', '.tsx', '.js', '.jsx', '.py']) {
-    const candidate = norm + ext;
+    const candidate = norm - ext;
     if (candidate in pathToElement) return pathToElement[candidate];
   }

[Killed] ConditionalExpression
bin/src/lib/c4-cross-ref.ts:253:9
   // Try with common extensions
   for (const ext of ['.ts', '.tsx', '.js', '.jsx', '.py']) {
     const candidate = norm + ext;
-    if (candidate in pathToElement) return pathToElement[candidate];
+    if (true) return pathToElement[candidate];
   }
 
killedBy: runCrossRefCheck — unmapped_import_target import 目标文件不在模型中时应产生 warning
statusReason: expected +0 to be 1 // Object.is equality

[Survived] ConditionalExpression
bin/src/lib/c4-cross-ref.ts:253:9
   // Try with common extensions
   for (const ext of ['.ts', '.tsx', '.js', '.jsx', '.py']) {
     const candidate = norm + ext;
-    if (candidate in pathToElement) return pathToElement[candidate];
+    if (false) return pathToElement[candidate];
   }
 

[Killed] BlockStatement
bin/src/lib/c4-cross-ref.ts:268:33
 ): Record<string, string | null> {
   const mapping: Record<string, string | null> = {};
 
-  for (const filepath of files) {
-    const normFile = normalizePath(filepath);
-    let matched: string | null = null;
-
-    for (const [elemPath, elemName] of Object.entries(pathToElement)) {
-      const normElem = normalizePath(elemPath);
-
-      // Check if file is under a directory path
-      if (normFile.startsWith(normElem + '/') || normFile.startsWith(normElem + '\\')) {
-        matched = elemName;
-        break;
-      }
-
-      // Exact file match
-      if (normFile === normElem) {
-        matched = elemName;
-        break;
-      }
-    }
-
-    mapping[filepath] = matched;
-  }
+  for (const filepath of files) {}
 
   return mapping;
killedBy: runCrossRefCheck — empty model 空模型无元素/关系时应返回 clean
statusReason: expected [] to include 'src/foo.ts'

[Killed] BlockStatement
bin/src/lib/c4-cross-ref.ts:272:71
     const normFile = normalizePath(filepath);
     let matched: string | null = null;
 
-    for (const [elemPath, elemName] of Object.entries(pathToElement)) {
-      const normElem = normalizePath(elemPath);
-
-      // Check if file is under a directory path
-      if (normFile.startsWith(normElem + '/') || normFile.startsWith(normElem + '\\')) {
-        matched = elemName;
-        break;
-      }
-
-      // Exact file match
-      if (normFile === normElem) {
-        matched = elemName;
-        break;
-      }
-    }
+    for (const [elemPath, elemName] of Object.entries(pathToElement)) {}
 
     mapping[filepath] = matched;
killedBy: 场景: 清单直通检查（change 清单 → archi_check 被查文件集） 正向：change 清单模式 → files.written 全量参与被查（测试文件直通不过滤），matched / unmatched_files / violations 反映直通集合 (AC-9)
statusReason: expected [] to deeply equal [ { element_id: 'Frontend', …(1) } ]

[Killed] ConditionalExpression
bin/src/lib/c4-cross-ref.ts:276:11
       const normElem = normalizePath(elemPath);
 
       // Check if file is under a directory path
-      if (normFile.startsWith(normElem + '/') || normFile.startsWith(normElem + '\\')) {
+      if (false) {
         matched = elemName;
         break;
killedBy: 场景: 清单直通检查（change 清单 → archi_check 被查文件集） 正向：change 清单模式 → files.written 全量参与被查（测试文件直通不过滤），matched / unmatched_files / violations 反映直通集合 (AC-9)
statusReason: expected [] to deeply equal [ { element_id: 'Frontend', …(1) } ]

[Killed] MethodExpression
bin/src/lib/c4-cross-ref.ts:276:11
       const normElem = normalizePath(elemPath);
 
       // Check if file is under a directory path
-      if (normFile.startsWith(normElem + '/') || normFile.startsWith(normElem + '\\')) {
+      if (normFile.endsWith(normElem + '/') || normFile.startsWith(normElem + '\\')) {
         matched = elemName;
         break;
killedBy: 场景: 清单直通检查（change 清单 → archi_check 被查文件集） 正向：change 清单模式 → files.written 全量参与被查（测试文件直通不过滤），matched / unmatched_files / violations 反映直通集合 (AC-9)
statusReason: expected [] to deeply equal [ { element_id: 'Frontend', …(1) } ]

[Killed] ConditionalExpression
bin/src/lib/c4-cross-ref.ts:282:11
       }
 
       // Exact file match
-      if (normFile === normElem) {
+      if (true) {
         matched = elemName;
         break;
killedBy: runCrossRefCheck — valid relationships import 关系与模型声明一致时应返回 clean
statusReason: expected 1 to be 2 // Object.is equality

[Killed] EqualityOperator
bin/src/lib/c4-cross-ref.ts:282:11
       }
 
       // Exact file match
-      if (normFile === normElem) {
+      if (normFile !== normElem) {
         matched = elemName;
         break;
killedBy: runCrossRefCheck — valid relationships import 关系与模型声明一致时应返回 clean
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
bin/src/lib/c4-cross-ref.ts:294:76
   return mapping;
 }
 
-function buildRelationshipLookup(relationships: C4Relation[]): Set<string> {
-  const relLookup = new Set<string>();
-  for (const rel of relationships) {
-    if (rel.source && rel.target) {
-      relLookup.add(`${rel.source}::${rel.target}`);
-    }
-  }
-  return relLookup;
-}
+function buildRelationshipLookup(relationships: C4Relation[]): Set<string> {}
 
 function checkImportsAgainstRelationships(
killedBy: 场景: 清单直通检查（change 清单 → archi_check 被查文件集） 正向：change 清单模式 → files.written 全量参与被查（测试文件直通不过滤），matched / unmatched_files / violations 反映直通集合 (AC-9)
statusReason: Cannot read properties of undefined (reading 'has')

[Killed] BlockStatement
bin/src/lib/c4-cross-ref.ts:296:36
 
 function buildRelationshipLookup(relationships: C4Relation[]): Set<string> {
   const relLookup = new Set<string>();
-  for (const rel of relationships) {
-    if (rel.source && rel.target) {
-      relLookup.add(`${rel.source}::${rel.target}`);
-    }
-  }
+  for (const rel of relationships) {}
   return relLookup;
 }
killedBy: runCrossRefCheck — valid relationships import 关系与模型声明一致时应返回 clean
statusReason: expected 'violations_found' to be 'clean' // Object.is equality

[Killed] ConditionalExpression
bin/src/lib/c4-cross-ref.ts:297:9
 function buildRelationshipLookup(relationships: C4Relation[]): Set<string> {
   const relLookup = new Set<string>();
   for (const rel of relationships) {
-    if (rel.source && rel.target) {
+    if (false) {
       relLookup.add(`${rel.source}::${rel.target}`);
     }
killedBy: 场景: 清单直通检查（change 清单 → archi_check 被查文件集） 正向：change 清单模式 → files.written 全量参与被查（测试文件直通不过滤），matched / unmatched_files / violations 反映直通集合 (AC-9)
statusReason: expected [ { …(5) }, { …(5) } ] to have a length of 1 but got 2

[Killed] BlockStatement
bin/src/lib/c4-cross-ref.ts:297:35
 function buildRelationshipLookup(relationships: C4Relation[]): Set<string> {
   const relLookup = new Set<string>();
   for (const rel of relationships) {
-    if (rel.source && rel.target) {
-      relLookup.add(`${rel.source}::${rel.target}`);
-    }
+    if (rel.source && rel.target) {}
   }
   return relLookup;
killedBy: 场景: 清单直通检查（change 清单 → archi_check 被查文件集） 正向：change 清单模式 → files.written 全量参与被查（测试文件直通不过滤），matched / unmatched_files / violations 反映直通集合 (AC-9)
statusReason: expected [ { …(5) }, { …(5) } ] to have a length of 1 but got 2

[Killed] ArrayDeclaration
bin/src/lib/c4-cross-ref.ts:311:41
   relLookup: Set<string>,
 ): { violations: CrossRefViolation[]; warnings: CrossRefViolation[] } {
   const violations: CrossRefViolation[] = [];
-  const warnings: CrossRefViolation[] = [];
+  const warnings: CrossRefViolation[] = ["Stryker was here"];
 
   for (const [filepath, importTargets] of Object.entries(importsByFile)) {
killedBy: runCrossRefCheck — unmapped_import_target import 目标文件不在模型中时应产生 warning
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] BooleanLiteral
bin/src/lib/c4-cross-ref.ts:315:9
 
   for (const [filepath, importTargets] of Object.entries(importsByFile)) {
     const sourceElem = fileElementMap[filepath];
-    if (!sourceElem) continue;
+    if (sourceElem) continue;
 
     for (const imp of importTargets) {
killedBy: 场景: 清单直通检查（change 清单 → archi_check 被查文件集） 正向：change 清单模式 → files.written 全量参与被查（测试文件直通不过滤），matched / unmatched_files / violations 反映直通集合 (AC-9)
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
bin/src/lib/c4-cross-ref.ts:315:9
 
   for (const [filepath, importTargets] of Object.entries(importsByFile)) {
     const sourceElem = fileElementMap[filepath];
-    if (!sourceElem) continue;
+    if (true) continue;
 
     for (const imp of importTargets) {
killedBy: 场景: 清单直通检查（change 清单 → archi_check 被查文件集） 正向：change 清单模式 → files.written 全量参与被查（测试文件直通不过滤），matched / unmatched_files / violations 反映直通集合 (AC-9)
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
bin/src/lib/c4-cross-ref.ts:319:11
 
     for (const imp of importTargets) {
       const resolved = resolveImportToPath(filepath, imp);
-      if (resolved === null) continue;
+      if (false) continue;
 
       const targetElem = matchPathToElement(resolved, pathToElement);
killedBy: runCrossRefCheck — Python imports 应正确解析 from .module import 相对导入
statusReason: Cannot read properties of null (reading 'trim')

[Killed] EqualityOperator
bin/src/lib/c4-cross-ref.ts:319:11
 
     for (const imp of importTargets) {
       const resolved = resolveImportToPath(filepath, imp);
-      if (resolved === null) continue;
+      if (resolved !== null) continue;
 
       const targetElem = matchPathToElement(resolved, pathToElement);
killedBy: 场景: 清单直通检查（change 清单 → archi_check 被查文件集） 正向：change 清单模式 → files.written 全量参与被查（测试文件直通不过滤），matched / unmatched_files / violations 反映直通集合 (AC-9)
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
bin/src/lib/c4-cross-ref.ts:324:11
       const targetElem = matchPathToElement(resolved, pathToElement);
 
       // Self-import within same element — ignore
-      if (targetElem === sourceElem) continue;
+      if (true) continue;
 
       if (targetElem === null) {
killedBy: runCrossRefCheck — unmodeled_dependency 模型未声明关系时应返回 violations_found
statusReason: expected 'clean' to be 'violations_found' // Object.is equality

[Killed] EqualityOperator
bin/src/lib/c4-cross-ref.ts:324:11
       const targetElem = matchPathToElement(resolved, pathToElement);
 
       // Self-import within same element — ignore
-      if (targetElem === sourceElem) continue;
+      if (targetElem !== sourceElem) continue;
 
       if (targetElem === null) {
killedBy: 场景: 清单直通检查（change 清单 → archi_check 被查文件集） 正向：change 清单模式 → files.written 全量参与被查（测试文件直通不过滤），matched / unmatched_files / violations 反映直通集合 (AC-9)
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
bin/src/lib/c4-cross-ref.ts:326:11
       // Self-import within same element — ignore
       if (targetElem === sourceElem) continue;
 
-      if (targetElem === null) {
+      if (targetElem !== null) {
         warnings.push({
           type: 'unmapped_import_target',
killedBy: 场景: 清单直通检查（change 清单 → archi_check 被查文件集） 正向：change 清单模式 → files.written 全量参与被查（测试文件直通不过滤），matched / unmatched_files / violations 反映直通集合 (AC-9)
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
bin/src/lib/c4-cross-ref.ts:326:11
       // Self-import within same element — ignore
       if (targetElem === sourceElem) continue;
 
-      if (targetElem === null) {
+      if (true) {
         warnings.push({
           type: 'unmapped_import_target',
killedBy: runCrossRefCheck — unmodeled_dependency 模型未声明关系时应返回 violations_found
statusReason: expected 'clean' to be 'violations_found' // Object.is equality

[Killed] ObjectLiteral
bin/src/lib/c4-cross-ref.ts:327:23
       if (targetElem === sourceElem) continue;
 
       if (targetElem === null) {
-        warnings.push({
-          type: 'unmapped_import_target',
-          source: sourceElem,
-          target: imp,
-          file: filepath,
-          description: `Import '${imp}' resolves to '${resolved}' which is not mapped to any model element`,
-        });
+        warnings.push({});
         continue;
       }
killedBy: runCrossRefCheck — unmapped_import_target import 目标文件不在模型中时应产生 warning
statusReason: Cannot read properties of undefined (reading 'includes')

[Survived] StringLiteral
bin/src/lib/c4-cross-ref.ts:328:17
 
       if (targetElem === null) {
         warnings.push({
-          type: 'unmapped_import_target',
+          type: "",
           source: sourceElem,
           target: imp,

[Killed] StringLiteral
bin/src/lib/c4-cross-ref.ts:332:24
           source: sourceElem,
           target: imp,
           file: filepath,
-          description: `Import '${imp}' resolves to '${resolved}' which is not mapped to any model element`,
+          description: ``,
         });
         continue;
killedBy: runCrossRefCheck — unmapped_import_target import 目标文件不在模型中时应产生 warning
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
bin/src/lib/c4-cross-ref.ts:338:59
       }
 
       // Check if relationship exists
-      if (!relLookup.has(`${sourceElem}::${targetElem}`)) {
-        violations.push({
-          type: 'unmodeled_dependency',
-          source: sourceElem,
-          target: targetElem,
-          file: filepath,
-          description: `Element '${sourceElem}' imports '${targetElem}' (via '${imp}') but model has no '${sourceElem} -> ${targetElem}' relationship`,
-        });
-      }
+      if (!relLookup.has(`${sourceElem}::${targetElem}`)) {}
     }
   }
killedBy: runCrossRefCheck — unmodeled_dependency 模型未声明关系时应返回 violations_found
statusReason: expected 'clean' to be 'violations_found' // Object.is equality

[Killed] ConditionalExpression
bin/src/lib/c4-cross-ref.ts:338:11
       }
 
       // Check if relationship exists
-      if (!relLookup.has(`${sourceElem}::${targetElem}`)) {
+      if (true) {
         violations.push({
           type: 'unmodeled_dependency',
killedBy: 场景: 清单直通检查（change 清单 → archi_check 被查文件集） 正向：change 清单模式 → files.written 全量参与被查（测试文件直通不过滤），matched / unmatched_files / violations 反映直通集合 (AC-9)
statusReason: expected [ { …(5) }, { …(5) } ] to have a length of 1 but got 2

[Killed] BlockStatement
bin/src/lib/c4-cross-ref.ts:360:74
   relationships: C4Relation[],
 ): CrossRefViolation[] {
   const importedPairs = new Set<string>();
-  for (const [filepath, importTargets] of Object.entries(importsByFile)) {
-    const sourceElem = fileElementMap[filepath];
-    if (!sourceElem) continue;
-    for (const imp of importTargets) {
-      const resolved = resolveImportToPath(filepath, imp);
-      if (resolved === null) continue;
-      const targetElem = matchPathToElement(resolved, pathToElement);
-      if (targetElem && targetElem !== sourceElem) {
-        importedPairs.add(`${sourceElem}::${targetElem}`);
-      }
-    }
-  }
+  for (const [filepath, importTargets] of Object.entries(importsByFile)) {}
 
   const warnings: CrossRefViolation[] = [];
killedBy: runCrossRefCheck — unused_relationship 关系被实际使用时不应产生 unused_relationship warning
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
bin/src/lib/c4-cross-ref.ts:363:38
   for (const [filepath, importTargets] of Object.entries(importsByFile)) {
     const sourceElem = fileElementMap[filepath];
     if (!sourceElem) continue;
-    for (const imp of importTargets) {
-      const resolved = resolveImportToPath(filepath, imp);
-      if (resolved === null) continue;
-      const targetElem = matchPathToElement(resolved, pathToElement);
-      if (targetElem && targetElem !== sourceElem) {
-        importedPairs.add(`${sourceElem}::${targetElem}`);
-      }
-    }
+    for (const imp of importTargets) {}
   }
 
killedBy: 场景: 清单直通检查（change 清单 → archi_check 被查文件集） 正向：change 清单模式 → files.written 全量参与被查（测试文件直通不过滤），matched / unmatched_files / violations 反映直通集合 (AC-9)
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] ConditionalExpression
bin/src/lib/c4-cross-ref.ts:365:11
     if (!sourceElem) continue;
     for (const imp of importTargets) {
       const resolved = resolveImportToPath(filepath, imp);
-      if (resolved === null) continue;
+      if (true) continue;
       const targetElem = matchPathToElement(resolved, pathToElement);
       if (targetElem && targetElem !== sourceElem) {
killedBy: runCrossRefCheck — unused_relationship 关系被实际使用时不应产生 unused_relationship warning
statusReason: expected 1 to be +0 // Object.is equality

[Killed] EqualityOperator
bin/src/lib/c4-cross-ref.ts:367:25
       const resolved = resolveImportToPath(filepath, imp);
       if (resolved === null) continue;
       const targetElem = matchPathToElement(resolved, pathToElement);
-      if (targetElem && targetElem !== sourceElem) {
+      if (targetElem && targetElem === sourceElem) {
         importedPairs.add(`${sourceElem}::${targetElem}`);
       }
killedBy: runCrossRefCheck — unused_relationship 关系被实际使用时不应产生 unused_relationship warning
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
bin/src/lib/c4-cross-ref.ts:367:11
       const resolved = resolveImportToPath(filepath, imp);
       if (resolved === null) continue;
       const targetElem = matchPathToElement(resolved, pathToElement);
-      if (targetElem && targetElem !== sourceElem) {
+      if (false) {
         importedPairs.add(`${sourceElem}::${targetElem}`);
       }
killedBy: 场景: 清单直通检查（change 清单 → archi_check 被查文件集） 正向：change 清单模式 → files.written 全量参与被查（测试文件直通不过滤），matched / unmatched_files / violations 反映直通集合 (AC-9)
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] ArrayDeclaration
bin/src/lib/c4-cross-ref.ts:373:41
     }
   }
 
-  const warnings: CrossRefViolation[] = [];
+  const warnings: CrossRefViolation[] = ["Stryker was here"];
   for (const rel of relationships) {
     if (rel.source && rel.target) {
killedBy: runCrossRefCheck — unmapped_import_target import 目标文件不在模型中时应产生 warning
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] BlockStatement
bin/src/lib/c4-cross-ref.ts:374:36
   }
 
   const warnings: CrossRefViolation[] = [];
-  for (const rel of relationships) {
-    if (rel.source && rel.target) {
-      if (!importedPairs.has(`${rel.source}::${rel.target}`)) {
-        warnings.push({
-          type: 'unused_relationship',
-          source: rel.source,
-          target: rel.target,
-          file: '',
-          description: `Model declares '${rel.source} -> ${rel.target}' but no import evidence found in changed files`,
-        });
-      }
-    }
-  }
+  for (const rel of relationships) {}
 
   return warnings;
killedBy: runCrossRefCheck — unused_relationship 模型声明了关系但变更文件中无对应 import 时应产生 warning
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
bin/src/lib/c4-cross-ref.ts:375:35
 
   const warnings: CrossRefViolation[] = [];
   for (const rel of relationships) {
-    if (rel.source && rel.target) {
-      if (!importedPairs.has(`${rel.source}::${rel.target}`)) {
-        warnings.push({
-          type: 'unused_relationship',
-          source: rel.source,
-          target: rel.target,
-          file: '',
-          description: `Model declares '${rel.source} -> ${rel.target}' but no import evidence found in changed files`,
-        });
-      }
-    }
+    if (rel.source && rel.target) {}
   }
 
killedBy: runCrossRefCheck — unused_relationship 模型声明了关系但变更文件中无对应 import 时应产生 warning
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
bin/src/lib/c4-cross-ref.ts:376:63
   const warnings: CrossRefViolation[] = [];
   for (const rel of relationships) {
     if (rel.source && rel.target) {
-      if (!importedPairs.has(`${rel.source}::${rel.target}`)) {
-        warnings.push({
-          type: 'unused_relationship',
-          source: rel.source,
-          target: rel.target,
-          file: '',
-          description: `Model declares '${rel.source} -> ${rel.target}' but no import evidence found in changed files`,
-        });
-      }
+      if (!importedPairs.has(`${rel.source}::${rel.target}`)) {}
     }
   }
killedBy: runCrossRefCheck — unused_relationship 模型声明了关系但变更文件中无对应 import 时应产生 warning
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
bin/src/lib/c4-cross-ref.ts:376:11
   const warnings: CrossRefViolation[] = [];
   for (const rel of relationships) {
     if (rel.source && rel.target) {
-      if (!importedPairs.has(`${rel.source}::${rel.target}`)) {
+      if (true) {
         warnings.push({
           type: 'unused_relationship',
killedBy: runCrossRefCheck — unused_relationship 关系被实际使用时不应产生 unused_relationship warning
statusReason: expected 1 to be +0 // Object.is equality

[Survived] StringLiteral
bin/src/lib/c4-cross-ref.ts:378:17
     if (rel.source && rel.target) {
       if (!importedPairs.has(`${rel.source}::${rel.target}`)) {
         warnings.push({
-          type: 'unused_relationship',
+          type: "",
           source: rel.source,
           target: rel.target,

[Survived] StringLiteral
bin/src/lib/c4-cross-ref.ts:381:17
           type: 'unused_relationship',
           source: rel.source,
           target: rel.target,
-          file: '',
+          file: "Stryker was here!",
           description: `Model declares '${rel.source} -> ${rel.target}' but no import evidence found in changed files`,
         });

[Killed] BlockStatement
bin/src/lib/c4-cross-ref.ts:394:24
 function checkPathNotFoundWarnings(
   elements: C4Element[],
   projectRoot: string,
-): CrossRefViolation[] {
-  const warnings: CrossRefViolation[] = [];
-
-  for (const elem of elements) {
-    for (const p of elem.paths) {
-      const absPath = path.resolve(projectRoot, p.replace(/^\.\//, ''));
-      if (!fs.existsSync(absPath)) {
-        warnings.push({
-          type: 'path_not_found',
-          source: elem.name,
-          target: p,
-          file: '',
-          description: `metadata.path '${p}' for element '${elem.name}' does not exist`,
-        });
-      }
-    }
-  }
-
-  return warnings;
-}
+): CrossRefViolation[] {}
 
 /**
killedBy: runCrossRefCheck — empty model 空模型无元素/关系时应返回 clean
statusReason: checkPathNotFoundWarnings(...) is not iterable (cannot read property undefined)

[Killed] BlockStatement
bin/src/lib/c4-cross-ref.ts:397:32
 ): CrossRefViolation[] {
   const warnings: CrossRefViolation[] = [];
 
-  for (const elem of elements) {
-    for (const p of elem.paths) {
-      const absPath = path.resolve(projectRoot, p.replace(/^\.\//, ''));
-      if (!fs.existsSync(absPath)) {
-        warnings.push({
-          type: 'path_not_found',
-          source: elem.name,
-          target: p,
-          file: '',
-          description: `metadata.path '${p}' for element '${elem.name}' does not exist`,
-        });
-      }
-    }
-  }
+  for (const elem of elements) {}
 
   return warnings;
killedBy: runCrossRefCheck — path_not_found 元素 metadata.path 指向不存在的目录时应产生 warning
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
bin/src/lib/c4-cross-ref.ts:398:33
   const warnings: CrossRefViolation[] = [];
 
   for (const elem of elements) {
-    for (const p of elem.paths) {
-      const absPath = path.resolve(projectRoot, p.replace(/^\.\//, ''));
-      if (!fs.existsSync(absPath)) {
-        warnings.push({
-          type: 'path_not_found',
-          source: elem.name,
-          target: p,
-          file: '',
-          description: `metadata.path '${p}' for element '${elem.name}' does not exist`,
-        });
-      }
-    }
+    for (const p of elem.paths) {}
   }
 
killedBy: runCrossRefCheck — path_not_found 元素 metadata.path 指向不存在的目录时应产生 warning
statusReason: expected +0 to be 1 // Object.is equality

[Survived] Regex
bin/src/lib/c4-cross-ref.ts:399:59
 
   for (const elem of elements) {
     for (const p of elem.paths) {
-      const absPath = path.resolve(projectRoot, p.replace(/^\.\//, ''));
+      const absPath = path.resolve(projectRoot, p.replace(/\.\//, ''));
       if (!fs.existsSync(absPath)) {
         warnings.push({

[Killed] BlockStatement
bin/src/lib/c4-cross-ref.ts:400:36
   for (const elem of elements) {
     for (const p of elem.paths) {
       const absPath = path.resolve(projectRoot, p.replace(/^\.\//, ''));
-      if (!fs.existsSync(absPath)) {
-        warnings.push({
-          type: 'path_not_found',
-          source: elem.name,
-          target: p,
-          file: '',
-          description: `metadata.path '${p}' for element '${elem.name}' does not exist`,
-        });
-      }
+      if (!fs.existsSync(absPath)) {}
     }
   }
killedBy: runCrossRefCheck — path_not_found 元素 metadata.path 指向不存在的目录时应产生 warning
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
bin/src/lib/c4-cross-ref.ts:400:11
   for (const elem of elements) {
     for (const p of elem.paths) {
       const absPath = path.resolve(projectRoot, p.replace(/^\.\//, ''));
-      if (!fs.existsSync(absPath)) {
+      if (false) {
         warnings.push({
           type: 'path_not_found',
killedBy: runCrossRefCheck — path_not_found 元素 metadata.path 指向不存在的目录时应产生 warning
statusReason: expected +0 to be 1 // Object.is equality

[Survived] StringLiteral
bin/src/lib/c4-cross-ref.ts:405:17
           type: 'path_not_found',
           source: elem.name,
           target: p,
-          file: '',
+          file: "Stryker was here!",
           description: `metadata.path '${p}' for element '${elem.name}' does not exist`,
         });

[Killed] BlockStatement
bin/src/lib/c4-cross-ref.ts:425:71
   relationships: C4Relation[],
   pathToElement: Record<string, string>,
   projectRoot: string,
-): { violations: CrossRefViolation[]; warnings: CrossRefViolation[] } {
-  const relLookup = buildRelationshipLookup(relationships);
-
-  const { violations, warnings: importWarnings } = checkImportsAgainstRelationships(
-    importsByFile,
-    fileElementMap,
-    pathToElement,
-    relLookup,
-  );
-
-  const warnings: CrossRefViolation[] = [...importWarnings];
-  warnings.push(
-    ...detectUnusedRelationships(importsByFile, fileElementMap, pathToElement, relationships),
-  );
-  warnings.push(...checkPathNotFoundWarnings(elements, projectRoot));
-
-  return { violations, warnings };
-}
+): { violations: CrossRefViolation[]; warnings: CrossRefViolation[] } {}
 
 function emptyCrossRefResult(status: 'skipped' | 'no_changes'): ArchiCheckResult {
killedBy: runCrossRefCheck — empty model 空模型无元素/关系时应返回 clean
statusReason: Cannot destructure property 'violations' of 'crossReference(...)' as it is undefined.

[Killed] ObjectLiteral
bin/src/lib/c4-cross-ref.ts:441:10
   );
   warnings.push(...checkPathNotFoundWarnings(elements, projectRoot));
 
-  return { violations, warnings };
+  return {};
 }
 
killedBy: runCrossRefCheck — empty model 空模型无元素/关系时应返回 clean
statusReason: Cannot read properties of undefined (reading 'map')
