[Killed] BlockStatement
bin/src/lib/c4-cross-ref.ts:444:82
   return { violations, warnings };
 }
 
-function emptyCrossRefResult(status: 'skipped' | 'no_changes'): ArchiCheckResult {
-  return {
-    violations: [],
-    warnings: [],
-    matched: [],
-    unmatched_files: [],
-    status,
-  };
-}
+function emptyCrossRefResult(status: 'skipped' | 'no_changes'): ArchiCheckResult {}
 
 function getEarlyCrossRefResult(
killedBy: 场景: 清单直通检查（change 清单 → archi_check 被查文件集） 边界：written 为空数组 → status no_changes（不报错、不产出违规）
statusReason: expected 'clean' to be 'no_changes' // Object.is equality

[Killed] BlockStatement
bin/src/lib/c4-cross-ref.ts:457:28
 function getEarlyCrossRefResult(
   model: C4ParseResult,
   changedFiles?: string[],
-): ArchiCheckResult | null {
-  const hasError = model.errors.some(
-    (e) => e.toLowerCase().includes('not found') || e.toLowerCase().includes('not exist'),
-  );
-  if (hasError) {
-    return emptyCrossRefResult('skipped');
-  }
-
-  if (changedFiles !== undefined && changedFiles.length === 0) {
-    return emptyCrossRefResult('no_changes');
-  }
-
-  return null;
-}
+): ArchiCheckResult | null {}
 
 function buildMatchedList(
killedBy: runCrossRefCheck — early exit 模型目录不存在时应返回 skipped
statusReason: expected 'clean' to be 'skipped' // Object.is equality

[Killed] MethodExpression
bin/src/lib/c4-cross-ref.ts:458:20
   model: C4ParseResult,
   changedFiles?: string[],
 ): ArchiCheckResult | null {
-  const hasError = model.errors.some(
-    (e) => e.toLowerCase().includes('not found') || e.toLowerCase().includes('not exist'),
-  );
+  const hasError = model.errors.every(e => e.toLowerCase().includes('not found') || e.toLowerCase().includes('not exist'));
   if (hasError) {
     return emptyCrossRefResult('skipped');
killedBy: 场景: 清单直通检查（change 清单 → archi_check 被查文件集） 正向：change 清单模式 → files.written 全量参与被查（测试文件直通不过滤），matched / unmatched_files / violations 反映直通集合 (AC-9)
statusReason: expected [] to deeply equal [ { element_id: 'Frontend', …(1) } ]

[Killed] ArrowFunction
bin/src/lib/c4-cross-ref.ts:459:5
   changedFiles?: string[],
 ): ArchiCheckResult | null {
   const hasError = model.errors.some(
-    (e) => e.toLowerCase().includes('not found') || e.toLowerCase().includes('not exist'),
+    () => undefined,
   );
   if (hasError) {
killedBy: runCrossRefCheck — early exit 模型目录不存在时应返回 skipped
statusReason: expected 'clean' to be 'skipped' // Object.is equality

[Killed] ConditionalExpression
bin/src/lib/c4-cross-ref.ts:459:12
   changedFiles?: string[],
 ): ArchiCheckResult | null {
   const hasError = model.errors.some(
-    (e) => e.toLowerCase().includes('not found') || e.toLowerCase().includes('not exist'),
+    (e) => false,
   );
   if (hasError) {
killedBy: runCrossRefCheck — early exit 模型目录不存在时应返回 skipped
statusReason: expected 'clean' to be 'skipped' // Object.is equality

[Killed] BlockStatement
bin/src/lib/c4-cross-ref.ts:461:17
   const hasError = model.errors.some(
     (e) => e.toLowerCase().includes('not found') || e.toLowerCase().includes('not exist'),
   );
-  if (hasError) {
-    return emptyCrossRefResult('skipped');
-  }
+  if (hasError) {}
 
   if (changedFiles !== undefined && changedFiles.length === 0) {
killedBy: runCrossRefCheck — early exit 模型目录不存在时应返回 skipped
statusReason: expected 'clean' to be 'skipped' // Object.is equality

[Killed] ConditionalExpression
bin/src/lib/c4-cross-ref.ts:461:7
   const hasError = model.errors.some(
     (e) => e.toLowerCase().includes('not found') || e.toLowerCase().includes('not exist'),
   );
-  if (hasError) {
+  if (false) {
     return emptyCrossRefResult('skipped');
   }
killedBy: runCrossRefCheck — early exit 模型目录不存在时应返回 skipped
statusReason: expected 'clean' to be 'skipped' // Object.is equality

[Killed] ConditionalExpression
bin/src/lib/c4-cross-ref.ts:465:7
     return emptyCrossRefResult('skipped');
   }
 
-  if (changedFiles !== undefined && changedFiles.length === 0) {
+  if (false) {
     return emptyCrossRefResult('no_changes');
   }
killedBy: 场景: 清单直通检查（change 清单 → archi_check 被查文件集） 边界：written 为空数组 → status no_changes（不报错、不产出违规）
statusReason: expected 'clean' to be 'no_changes' // Object.is equality

[Killed] LogicalOperator
bin/src/lib/c4-cross-ref.ts:465:7
     return emptyCrossRefResult('skipped');
   }
 
-  if (changedFiles !== undefined && changedFiles.length === 0) {
+  if (changedFiles !== undefined || changedFiles.length === 0) {
     return emptyCrossRefResult('no_changes');
   }
killedBy: 场景: 清单直通检查（change 清单 → archi_check 被查文件集） 正向：change 清单模式 → files.written 全量参与被查（测试文件直通不过滤），matched / unmatched_files / violations 反映直通集合 (AC-9)
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
bin/src/lib/c4-cross-ref.ts:474:51
 
 function buildMatchedList(
   fileElementMap: Record<string, string | null>,
-): Array<{ element_id: string; files: string[] }> {
-  const seenElements = new Map<string, string[]>();
-  for (const [filepath, elemName] of Object.entries(fileElementMap)) {
-    if (elemName) {
-      let files = seenElements.get(elemName);
-      if (!files) {
-        files = [];
-        seenElements.set(elemName, files);
-      }
-      files.push(filepath);
-    }
-  }
-
-  return Array.from(seenElements.entries()).map(([elementId, files]) => ({
-    element_id: elementId,
-    files,
-  }));
-}
+): Array<{ element_id: string; files: string[] }> {}
 
 /**
killedBy: 场景: 清单直通检查（change 清单 → archi_check 被查文件集） 正向：change 清单模式 → files.written 全量参与被查（测试文件直通不过滤），matched / unmatched_files / violations 反映直通集合 (AC-9)
statusReason: expected undefined to deeply equal [ { element_id: 'Frontend', …(1) } ]

[Killed] BlockStatement
bin/src/lib/c4-cross-ref.ts:476:70
   fileElementMap: Record<string, string | null>,
 ): Array<{ element_id: string; files: string[] }> {
   const seenElements = new Map<string, string[]>();
-  for (const [filepath, elemName] of Object.entries(fileElementMap)) {
-    if (elemName) {
-      let files = seenElements.get(elemName);
-      if (!files) {
-        files = [];
-        seenElements.set(elemName, files);
-      }
-      files.push(filepath);
-    }
-  }
+  for (const [filepath, elemName] of Object.entries(fileElementMap)) {}
 
   return Array.from(seenElements.entries()).map(([elementId, files]) => ({
killedBy: runCrossRefCheck — valid relationships import 关系与模型声明一致时应返回 clean
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
bin/src/lib/c4-cross-ref.ts:477:9
 ): Array<{ element_id: string; files: string[] }> {
   const seenElements = new Map<string, string[]>();
   for (const [filepath, elemName] of Object.entries(fileElementMap)) {
-    if (elemName) {
+    if (false) {
       let files = seenElements.get(elemName);
       if (!files) {
killedBy: 场景: 清单直通检查（change 清单 → archi_check 被查文件集） 正向：change 清单模式 → files.written 全量参与被查（测试文件直通不过滤），matched / unmatched_files / violations 反映直通集合 (AC-9)
statusReason: expected [] to deeply equal [ { element_id: 'Frontend', …(1) } ]

[Killed] BlockStatement
bin/src/lib/c4-cross-ref.ts:477:19
 ): Array<{ element_id: string; files: string[] }> {
   const seenElements = new Map<string, string[]>();
   for (const [filepath, elemName] of Object.entries(fileElementMap)) {
-    if (elemName) {
-      let files = seenElements.get(elemName);
-      if (!files) {
-        files = [];
-        seenElements.set(elemName, files);
-      }
-      files.push(filepath);
-    }
+    if (elemName) {}
   }
 
killedBy: runCrossRefCheck — valid relationships import 关系与模型声明一致时应返回 clean
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
bin/src/lib/c4-cross-ref.ts:479:19
   for (const [filepath, elemName] of Object.entries(fileElementMap)) {
     if (elemName) {
       let files = seenElements.get(elemName);
-      if (!files) {
-        files = [];
-        seenElements.set(elemName, files);
-      }
+      if (!files) {}
       files.push(filepath);
     }
killedBy: 场景: 清单直通检查（change 清单 → archi_check 被查文件集） 正向：change 清单模式 → files.written 全量参与被查（测试文件直通不过滤），matched / unmatched_files / violations 反映直通集合 (AC-9)
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] BooleanLiteral
bin/src/lib/c4-cross-ref.ts:479:11
   for (const [filepath, elemName] of Object.entries(fileElementMap)) {
     if (elemName) {
       let files = seenElements.get(elemName);
-      if (!files) {
+      if (files) {
         files = [];
         seenElements.set(elemName, files);
killedBy: runCrossRefCheck — valid relationships import 关系与模型声明一致时应返回 clean
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] ArrowFunction
bin/src/lib/c4-cross-ref.ts:487:49
     }
   }
 
-  return Array.from(seenElements.entries()).map(([elementId, files]) => ({
-    element_id: elementId,
-    files,
-  }));
+  return Array.from(seenElements.entries()).map(() => undefined);
 }
 
killedBy: 场景: 清单直通检查（change 清单 → archi_check 被查文件集） 正向：change 清单模式 → files.written 全量参与被查（测试文件直通不过滤），matched / unmatched_files / violations 反映直通集合 (AC-9)
statusReason: expected [ undefined ] to deeply equal [ { element_id: 'Frontend', …(1) } ]

[Killed] ConditionalExpression
bin/src/lib/c4-cross-ref.ts:504:7
   const model = await loadModel(projectRoot);
 
   const skippedResult = getEarlyCrossRefResult(model);
-  if (skippedResult) {
+  if (true) {
     return skippedResult;
   }
killedBy: 场景: 清单直通检查（change 清单 → archi_check 被查文件集） 正向：change 清单模式 → files.written 全量参与被查（测试文件直通不过滤），matched / unmatched_files / violations 反映直通集合 (AC-9)
statusReason: Cannot read properties of null (reading 'matched')

[Survived] ConditionalExpression
bin/src/lib/c4-cross-ref.ts:504:7
   const model = await loadModel(projectRoot);
 
   const skippedResult = getEarlyCrossRefResult(model);
-  if (skippedResult) {
+  if (false) {
     return skippedResult;
   }

[Killed] BlockStatement
bin/src/lib/c4-cross-ref.ts:511:24
   const changedFiles = getChangedFiles(projectRoot, options);
 
   const noChangesResult = getEarlyCrossRefResult(model, changedFiles);
-  if (noChangesResult) {
-    return noChangesResult;
-  }
+  if (noChangesResult) {}
 
   const fileElementMap = mapFilesToElements(changedFiles, model.path_to_element);
killedBy: runCrossRefCheck — early exit changedFiles 为空数组时应返回 no_changes
statusReason: expected 'clean' to be 'no_changes' // Object.is equality

[Killed] ConditionalExpression
bin/src/lib/c4-cross-ref.ts:511:7
   const changedFiles = getChangedFiles(projectRoot, options);
 
   const noChangesResult = getEarlyCrossRefResult(model, changedFiles);
-  if (noChangesResult) {
+  if (true) {
     return noChangesResult;
   }
killedBy: 场景: 清单直通检查（change 清单 → archi_check 被查文件集） 正向：change 清单模式 → files.written 全量参与被查（测试文件直通不过滤），matched / unmatched_files / violations 反映直通集合 (AC-9)
statusReason: Cannot read properties of null (reading 'matched')

[Killed] BlockStatement
bin/src/lib/c4-cross-ref.ts:518:40
   const fileElementMap = mapFilesToElements(changedFiles, model.path_to_element);
 
   const importsByFile: Record<string, string[]> = {};
-  for (const filepath of changedFiles) {
-    importsByFile[filepath] = parseImports(filepath, projectRoot);
-  }
+  for (const filepath of changedFiles) {}
 
   const { violations, warnings } = crossReference(
killedBy: 场景: 清单直通检查（change 清单 → archi_check 被查文件集） 正向：change 清单模式 → files.written 全量参与被查（测试文件直通不过滤），matched / unmatched_files / violations 反映直通集合 (AC-9)
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
bin/src/lib/c4-cross-ref.ts:532:53
   );
 
   const matched = buildMatchedList(fileElementMap);
-  const unmatchedFiles = changedFiles.filter((f) => fileElementMap[f] === null);
+  const unmatchedFiles = changedFiles.filter((f) => fileElementMap[f] !== null);
 
   return {
killedBy: runCrossRefCheck — empty model 空模型无元素/关系时应返回 clean
statusReason: expected [] to include 'src/foo.ts'

[Killed] MethodExpression
bin/src/lib/c4-cross-ref.ts:532:26
   );
 
   const matched = buildMatchedList(fileElementMap);
-  const unmatchedFiles = changedFiles.filter((f) => fileElementMap[f] === null);
+  const unmatchedFiles = changedFiles;
 
   return {
killedBy: runCrossRefCheck — matched & unmatched_files 未映射到模型的文件应出现在 unmatched_files 中
statusReason: expected [ 'src/core/a.ts', …(1) ] to not include 'src/core/a.ts'

[Killed] ArrowFunction
bin/src/lib/c4-cross-ref.ts:536:28
 
   return {
     violations,
-    warnings: warnings.map((w) => w.description),
+    warnings: warnings.map(() => undefined),
     matched,
     unmatched_files: unmatchedFiles,
killedBy: runCrossRefCheck — unmapped_import_target import 目标文件不在模型中时应产生 warning
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] ConditionalExpression
bin/src/lib/c4-cross-ref.ts:539:13
     warnings: warnings.map((w) => w.description),
     matched,
     unmatched_files: unmatchedFiles,
-    status: violations.length > 0 ? 'violations_found' : 'clean',
+    status: false ? 'violations_found' : 'clean',
   };
 }
killedBy: 场景: 清单直通检查（change 清单 → archi_check 被查文件集） 正向：change 清单模式 → files.written 全量参与被查（测试文件直通不过滤），matched / unmatched_files / violations 反映直通集合 (AC-9)
statusReason: expected 'clean' to be 'violations_found' // Object.is equality

[Killed] ConditionalExpression
bin/src/lib/c4-cross-ref.ts:539:13
     warnings: warnings.map((w) => w.description),
     matched,
     unmatched_files: unmatchedFiles,
-    status: violations.length > 0 ? 'violations_found' : 'clean',
+    status: true ? 'violations_found' : 'clean',
   };
 }
killedBy: runCrossRefCheck — empty model 空模型无元素/关系时应返回 clean
statusReason: expected 'violations_found' to be 'clean' // Object.is equality
