[Killed] BlockStatement
bin/src/lib/session-registry.ts:40:52
  * Registry file path for a project root:
  * `<tmpdir>/dev-team-hooks/<sha256(resolvedProjectRoot) first 16 hex>.json`.
  */
-function registryPath(projectRoot: string): string {
-  const hash = createHash('sha256').update(path.resolve(projectRoot)).digest('hex').slice(0, 16);
-  return path.join(os.tmpdir(), REGISTRY_DIR_NAME, `${hash}.json`);
-}
+function registryPath(projectRoot: string): string {}
 
 /**
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [] to deeply equal [ 'src/b.ts' ]

[Killed] MethodExpression
bin/src/lib/session-registry.ts:41:16
  * `<tmpdir>/dev-team-hooks/<sha256(resolvedProjectRoot) first 16 hex>.json`.
  */
 function registryPath(projectRoot: string): string {
-  const hash = createHash('sha256').update(path.resolve(projectRoot)).digest('hex').slice(0, 16);
+  const hash = createHash('sha256').update(path.resolve(projectRoot)).digest('hex');
   return path.join(os.tmpdir(), REGISTRY_DIR_NAME, `${hash}.json`);
 }
killedBy: 场景: 工作流事件序列回放净状态 注册表文件被外部删除后写事件静默丢弃：stderr 诊断、exit 0、workflow.json 逐字节不变
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
bin/src/lib/session-registry.ts:41:27
  * `<tmpdir>/dev-team-hooks/<sha256(resolvedProjectRoot) first 16 hex>.json`.
  */
 function registryPath(projectRoot: string): string {
-  const hash = createHash('sha256').update(path.resolve(projectRoot)).digest('hex').slice(0, 16);
+  const hash = createHash("").update(path.resolve(projectRoot)).digest('hex').slice(0, 16);
   return path.join(os.tmpdir(), REGISTRY_DIR_NAME, `${hash}.json`);
 }
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [] to deeply equal [ 'src/b.ts' ]

[Killed] BlockStatement
bin/src/lib/session-registry.ts:49:58
  * Read the registry file. A missing, malformed or non-object file is treated
  * as an empty registry (fail-open); malformed entries are ignored.
  */
-function readRegistry(filePath: string): SessionRegistry {
-  try {
-    const parsed: unknown = JSON.parse(fs.readFileSync(filePath, 'utf-8'));
-    if (!isPlainObject(parsed)) {
-      return {};
-    }
-    const registry: SessionRegistry = {};
-    for (const [sessionId, entry] of Object.entries(parsed)) {
-      if (isPlainObject(entry) && typeof entry.change === 'string') {
-        registry[sessionId] = { change: entry.change, updatedAt: String(entry.updatedAt) };
-      }
-    }
-    return registry;
-  } catch {
-    return {};
-  }
-}
+function readRegistry(filePath: string): SessionRegistry {}
 
 function writeRegistry(filePath: string, registry: SessionRegistry): void {
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [] to deeply equal [ 'src/b.ts' ]

[Killed] BlockStatement
bin/src/lib/session-registry.ts:50:7
  * as an empty registry (fail-open); malformed entries are ignored.
  */
 function readRegistry(filePath: string): SessionRegistry {
-  try {
-    const parsed: unknown = JSON.parse(fs.readFileSync(filePath, 'utf-8'));
-    if (!isPlainObject(parsed)) {
-      return {};
-    }
-    const registry: SessionRegistry = {};
-    for (const [sessionId, entry] of Object.entries(parsed)) {
-      if (isPlainObject(entry) && typeof entry.change === 'string') {
-        registry[sessionId] = { change: entry.change, updatedAt: String(entry.updatedAt) };
-      }
-    }
-    return registry;
-  } catch {
+  try {} catch {
     return {};
   }
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [] to deeply equal [ 'src/b.ts' ]

[Survived] StringLiteral
bin/src/lib/session-registry.ts:51:66
  */
 function readRegistry(filePath: string): SessionRegistry {
   try {
-    const parsed: unknown = JSON.parse(fs.readFileSync(filePath, 'utf-8'));
+    const parsed: unknown = JSON.parse(fs.readFileSync(filePath, ""));
     if (!isPlainObject(parsed)) {
       return {};

[Killed] BooleanLiteral
bin/src/lib/session-registry.ts:52:9
 function readRegistry(filePath: string): SessionRegistry {
   try {
     const parsed: unknown = JSON.parse(fs.readFileSync(filePath, 'utf-8'));
-    if (!isPlainObject(parsed)) {
+    if (isPlainObject(parsed)) {
       return {};
     }
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [] to deeply equal [ 'src/b.ts' ]

[Killed] ConditionalExpression
bin/src/lib/session-registry.ts:52:9
 function readRegistry(filePath: string): SessionRegistry {
   try {
     const parsed: unknown = JSON.parse(fs.readFileSync(filePath, 'utf-8'));
-    if (!isPlainObject(parsed)) {
+    if (true) {
       return {};
     }
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [] to deeply equal [ 'src/b.ts' ]

[Killed] BlockStatement
bin/src/lib/session-registry.ts:56:62
       return {};
     }
     const registry: SessionRegistry = {};
-    for (const [sessionId, entry] of Object.entries(parsed)) {
-      if (isPlainObject(entry) && typeof entry.change === 'string') {
-        registry[sessionId] = { change: entry.change, updatedAt: String(entry.updatedAt) };
-      }
-    }
+    for (const [sessionId, entry] of Object.entries(parsed)) {}
     return registry;
   } catch {
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [] to deeply equal [ 'src/b.ts' ]

[Killed] ConditionalExpression
bin/src/lib/session-registry.ts:57:11
     }
     const registry: SessionRegistry = {};
     for (const [sessionId, entry] of Object.entries(parsed)) {
-      if (isPlainObject(entry) && typeof entry.change === 'string') {
+      if (false) {
         registry[sessionId] = { change: entry.change, updatedAt: String(entry.updatedAt) };
       }
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [] to deeply equal [ 'src/b.ts' ]

[Killed] ConditionalExpression
bin/src/lib/session-registry.ts:57:11
     }
     const registry: SessionRegistry = {};
     for (const [sessionId, entry] of Object.entries(parsed)) {
-      if (isPlainObject(entry) && typeof entry.change === 'string') {
+      if (true) {
         registry[sessionId] = { change: entry.change, updatedAt: String(entry.updatedAt) };
       }
killedBy: lookupChange — 异常与边界 注册表条目缺 change 字段（结构损坏）时该条目被忽略 → 返回 null
statusReason: expected undefined to be null

[Killed] BlockStatement
bin/src/lib/session-registry.ts:62:11
       }
     }
     return registry;
-  } catch {
-    return {};
-  }
+  } catch {}
 }
 
killedBy: bindSession + lookupChange — 正向 bind(s1, change-a) 后 lookup(s1) 返回 change-a (AC-3)
statusReason: expected null to be 'change-a' // Object.is equality

[Killed] BlockStatement
bin/src/lib/session-registry.ts:67:75
   }
 }
 
-function writeRegistry(filePath: string, registry: SessionRegistry): void {
-  fs.mkdirSync(path.dirname(filePath), { recursive: true });
-  fs.writeFileSync(filePath, `${JSON.stringify(registry)}\n`, 'utf-8');
-}
+function writeRegistry(filePath: string, registry: SessionRegistry): void {}
 
 /** True when an entry's `updatedAt` parses and is within the TTL. */
killedBy: bindSession + lookupChange — 正向 bind(s1, change-a) 后 lookup(s1) 返回 change-a (AC-3)
statusReason: expected null to be 'change-a' // Object.is equality

[Killed] BooleanLiteral
bin/src/lib/session-registry.ts:68:53
 }
 
 function writeRegistry(filePath: string, registry: SessionRegistry): void {
-  fs.mkdirSync(path.dirname(filePath), { recursive: true });
+  fs.mkdirSync(path.dirname(filePath), { recursive: false });
   fs.writeFileSync(filePath, `${JSON.stringify(registry)}\n`, 'utf-8');
 }
killedBy: 场景: session 隔离与换绑 S1 与 S2 事件交错注入，两 change 清单各自只含自家路径，互不串账（AC-3）
statusReason: expected [] to deeply equal [ 'src/b1.ts' ]

[Killed] StringLiteral
bin/src/lib/session-registry.ts:69:30
 
 function writeRegistry(filePath: string, registry: SessionRegistry): void {
   fs.mkdirSync(path.dirname(filePath), { recursive: true });
-  fs.writeFileSync(filePath, `${JSON.stringify(registry)}\n`, 'utf-8');
+  fs.writeFileSync(filePath, ``, 'utf-8');
 }
 
killedBy: bindSession + lookupChange — 正向 bind(s1, change-a) 后 lookup(s1) 返回 change-a (AC-3)
statusReason: expected null to be 'change-a' // Object.is equality

[Killed] BlockStatement
bin/src/lib/session-registry.ts:73:62
 }
 
 /** True when an entry's `updatedAt` parses and is within the TTL. */
-function isFresh(entry: RegistryEntry, now: number): boolean {
-  const updated = Date.parse(entry.updatedAt);
-  return !Number.isNaN(updated) && now - updated < TTL_MS;
-}
+function isFresh(entry: RegistryEntry, now: number): boolean {}
 
 /**
killedBy: bindSession + lookupChange — 正向 s1→change-a、s2→change-b 并存，各自命中互不串账 (AC-3)
statusReason: expected null to be 'change-a' // Object.is equality

[Killed] ArithmeticOperator
bin/src/lib/session-registry.ts:75:36
 /** True when an entry's `updatedAt` parses and is within the TTL. */
 function isFresh(entry: RegistryEntry, now: number): boolean {
   const updated = Date.parse(entry.updatedAt);
-  return !Number.isNaN(updated) && now - updated < TTL_MS;
+  return !Number.isNaN(updated) && now + updated < TTL_MS;
 }
 
killedBy: bindSession + lookupChange — 正向 s1→change-a、s2→change-b 并存，各自命中互不串账 (AC-3)
statusReason: expected null to be 'change-a' // Object.is equality

[Killed] BooleanLiteral
bin/src/lib/session-registry.ts:75:10
 /** True when an entry's `updatedAt` parses and is within the TTL. */
 function isFresh(entry: RegistryEntry, now: number): boolean {
   const updated = Date.parse(entry.updatedAt);
-  return !Number.isNaN(updated) && now - updated < TTL_MS;
+  return Number.isNaN(updated) && now - updated < TTL_MS;
 }
 
killedBy: 场景: session 隔离与换绑 S1 与 S2 事件交错注入，两 change 清单各自只含自家路径，互不串账（AC-3）
statusReason: expected [] to deeply equal [ 'src/a1.ts', 'src/a2.ts' ]

[Killed] BlockStatement
bin/src/lib/session-registry.ts:82:91
  * Establish or refresh the `session_id → change` binding, then lazily drop
  * entries whose `updatedAt` exceeds the 24h TTL. Never throws.
  */
-export function bindSession(projectRoot: string, sessionId: string, change: string): void {
-  try {
-    const filePath = registryPath(projectRoot);
-    const registry = readRegistry(filePath);
-    const now = Date.now();
-
-    const next: SessionRegistry = {};
-    for (const [id, entry] of Object.entries(registry)) {
-      if (isFresh(entry, now)) {
-        next[id] = entry;
-      }
-    }
-    next[sessionId] = { change, updatedAt: new Date(now).toISOString() };
-
-    writeRegistry(filePath, next);
-  } catch {
-    // Fail-open: a failed bind only costs recorder attribution for this session.
-  }
-}
+export function bindSession(projectRoot: string, sessionId: string, change: string): void {}
 
 /**
killedBy: bindSession + lookupChange — 正向 bind(s1, change-a) 后 lookup(s1) 返回 change-a (AC-3)
statusReason: expected null to be 'change-a' // Object.is equality

[Killed] BlockStatement
bin/src/lib/session-registry.ts:83:7
  * entries whose `updatedAt` exceeds the 24h TTL. Never throws.
  */
 export function bindSession(projectRoot: string, sessionId: string, change: string): void {
-  try {
-    const filePath = registryPath(projectRoot);
-    const registry = readRegistry(filePath);
-    const now = Date.now();
-
-    const next: SessionRegistry = {};
-    for (const [id, entry] of Object.entries(registry)) {
-      if (isFresh(entry, now)) {
-        next[id] = entry;
-      }
-    }
-    next[sessionId] = { change, updatedAt: new Date(now).toISOString() };
-
-    writeRegistry(filePath, next);
-  } catch {
+  try {} catch {
     // Fail-open: a failed bind only costs recorder attribution for this session.
   }
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [] to deeply equal [ 'src/b.ts' ]

[Killed] BlockStatement
bin/src/lib/session-registry.ts:89:57
     const now = Date.now();
 
     const next: SessionRegistry = {};
-    for (const [id, entry] of Object.entries(registry)) {
-      if (isFresh(entry, now)) {
-        next[id] = entry;
-      }
-    }
+    for (const [id, entry] of Object.entries(registry)) {}
     next[sessionId] = { change, updatedAt: new Date(now).toISOString() };
 
killedBy: bindSession + lookupChange — 正向 s1→change-a、s2→change-b 并存，各自命中互不串账 (AC-3)
statusReason: expected null to be 'change-a' // Object.is equality

[Killed] ConditionalExpression
bin/src/lib/session-registry.ts:90:11
 
     const next: SessionRegistry = {};
     for (const [id, entry] of Object.entries(registry)) {
-      if (isFresh(entry, now)) {
+      if (false) {
         next[id] = entry;
       }
killedBy: bindSession + lookupChange — 正向 s1→change-a、s2→change-b 并存，各自命中互不串账 (AC-3)
statusReason: expected null to be 'change-a' // Object.is equality

[Killed] BlockStatement
bin/src/lib/session-registry.ts:90:32
 
     const next: SessionRegistry = {};
     for (const [id, entry] of Object.entries(registry)) {
-      if (isFresh(entry, now)) {
-        next[id] = entry;
-      }
+      if (isFresh(entry, now)) {}
     }
     next[sessionId] = { change, updatedAt: new Date(now).toISOString() };
killedBy: 场景: session 隔离与换绑 S1 与 S2 事件交错注入，两 change 清单各自只含自家路径，互不串账（AC-3）
statusReason: expected [] to deeply equal [ 'src/a1.ts', 'src/a2.ts' ]

[Killed] BlockStatement
bin/src/lib/session-registry.ts:106:85
  * Look up the change bound to a session. Returns `null` on miss (caller
  * silently drops the event) or on any read failure. Never throws.
  */
-export function lookupChange(projectRoot: string, sessionId: string): string | null {
-  try {
-    const entry = readRegistry(registryPath(projectRoot))[sessionId];
-    return entry ? entry.change : null;
-  } catch {
-    return null;
-  }
-}
+export function lookupChange(projectRoot: string, sessionId: string): string | null {}
 
killedBy: 场景: 工作流事件序列回放净状态 事件序列回放后 files 净状态正确，且 workflow_type/created/未知键保留（AC-2、AC-4）
statusReason: expected [] to deeply equal [ 'src/b.ts' ]

[Killed] BlockStatement
bin/src/lib/session-registry.ts:107:7
  * silently drops the event) or on any read failure. Never throws.
  */
 export function lookupChange(projectRoot: string, sessionId: string): string | null {
-  try {
-    const entry = readRegistry(registryPath(projectRoot))[sessionId];
-    return entry ? entry.change : null;
-  } catch {
+  try {} catch {
     return null;
   }
killedBy: bindSession + lookupChange — 正向 bind(s1, change-a) 后 lookup(s1) 返回 change-a (AC-3)
statusReason: expected undefined to be 'change-a' // Object.is equality

[NoCoverage] BlockStatement
bin/src/lib/session-registry.ts:110:11
   try {
     const entry = readRegistry(registryPath(projectRoot))[sessionId];
     return entry ? entry.change : null;
-  } catch {
-    return null;
-  }
+  } catch {}
 }
 
