[Killed] BlockStatement
build/hooks-profile.ts:37:86
 type HooksCanonical = z.infer<typeof hooksCanonicalSchema>;
 
 /** Expand name/path tokens in canonical JSON before platform wrapping. */
-function expandCanonical(canonical: HooksCanonical, env: ProductEnv): HooksCanonical {
-  const expanded = applyEnvTokens(JSON.stringify(canonical), env);
-  return JSON.parse(expanded);
-}
+function expandCanonical(canonical: HooksCanonical, env: ProductEnv): HooksCanonical {}
 
 /** Wrap already-expanded canonical into Claude Code plugin hooks.json shape. */
killedBy: assembleAll 三平台 outDir 均生成且无残留 __INCLUDE:
statusReason: Cannot read properties of undefined (reading 'preToolUse')

[Killed] ObjectLiteral
build/hooks-profile.ts:44:42
 
 /** Wrap already-expanded canonical into Claude Code plugin hooks.json shape. */
 function buildClaudeNested(canonical: HooksCanonical): unknown {
-  const hooks: Record<string, unknown> = {
-    PreToolUse: canonical.preToolUse
-      .filter((entry) => entry.matchers.claude)
-      .map((entry) => ({
-        matcher: entry.matchers.claude,
-        hooks: [{ type: 'command', command: entry.commandTemplate }],
-      })),
-  };
+  const hooks: Record<string, unknown> = {};
 
   const postToolUse = canonical.postToolUse
killedBy: buildHooksFile claude PreToolUse / SubagentStop command 非空且展开 hooks 路径
statusReason: parsed.hooks.PreToolUse is not iterable

[Survived] MethodExpression
build/hooks-profile.ts:45:17
 /** Wrap already-expanded canonical into Claude Code plugin hooks.json shape. */
 function buildClaudeNested(canonical: HooksCanonical): unknown {
   const hooks: Record<string, unknown> = {
-    PreToolUse: canonical.preToolUse
-      .filter((entry) => entry.matchers.claude)
+    PreToolUse: canonical.preToolUse
       .map((entry) => ({
         matcher: entry.matchers.claude,

[Killed] ArrowFunction
build/hooks-profile.ts:46:15
 function buildClaudeNested(canonical: HooksCanonical): unknown {
   const hooks: Record<string, unknown> = {
     PreToolUse: canonical.preToolUse
-      .filter((entry) => entry.matchers.claude)
+      .filter(() => undefined)
       .map((entry) => ({
         matcher: entry.matchers.claude,
killedBy: buildHooksFile claude 输出可 JSON.parse，含嵌套 hooks.PreToolUse / SubagentStop
statusReason: expected undefined to match object { matcher: 'Write|Edit', …(1) }

[Killed] ArrowFunction
build/hooks-profile.ts:47:12
   const hooks: Record<string, unknown> = {
     PreToolUse: canonical.preToolUse
       .filter((entry) => entry.matchers.claude)
-      .map((entry) => ({
-        matcher: entry.matchers.claude,
-        hooks: [{ type: 'command', command: entry.commandTemplate }],
-      })),
+      .map(() => undefined),
   };
 
killedBy: buildHooksFile claude PreToolUse / SubagentStop command 非空且展开 hooks 路径
statusReason: Cannot read properties of null (reading 'hooks')

[Killed] StringLiteral
build/hooks-profile.ts:49:25
       .filter((entry) => entry.matchers.claude)
       .map((entry) => ({
         matcher: entry.matchers.claude,
-        hooks: [{ type: 'command', command: entry.commandTemplate }],
+        hooks: [{ type: "", command: entry.commandTemplate }],
       })),
   };
killedBy: buildHooksFile claude 输出可 JSON.parse，含嵌套 hooks.PreToolUse / SubagentStop
statusReason: expected { matcher: 'Write|Edit', …(1) } to match object { matcher: 'Write|Edit', …(1) }
(1 matching property omitted from actual)

[Survived] MethodExpression
build/hooks-profile.ts:53:23
       })),
   };
 
-  const postToolUse = canonical.postToolUse
-    .filter((entry) => entry.matchers.claude)
+  const postToolUse = canonical.postToolUse
     .map((entry) => ({
       matcher: entry.matchers.claude,

[Killed] ArrowFunction
build/hooks-profile.ts:54:13
   };
 
   const postToolUse = canonical.postToolUse
-    .filter((entry) => entry.matchers.claude)
+    .filter(() => undefined)
     .map((entry) => ({
       matcher: entry.matchers.claude,
killedBy: 真实 canonical 组装 PostToolUse 注册 claude：PostToolUse 唯一条目 matcher 为工具集加 phase_next MCP 全名，command 含 record-files 与已展开 token
statusReason: Target cannot be null or undefined.

[Killed] ArrowFunction
build/hooks-profile.ts:55:10
 
   const postToolUse = canonical.postToolUse
     .filter((entry) => entry.matchers.claude)
-    .map((entry) => ({
-      matcher: entry.matchers.claude,
-      hooks: [{ type: 'command', command: entry.commandTemplate }],
-    }));
+    .map(() => undefined);
   if (postToolUse.length > 0) {
     hooks.PostToolUse = postToolUse;
killedBy: 真实 canonical 组装 PostToolUse 注册 claude：PostToolUse 唯一条目 matcher 为工具集加 phase_next MCP 全名，command 含 record-files 与已展开 token
statusReason: Cannot read properties of null (reading 'matcher')

[Killed] BlockStatement
build/hooks-profile.ts:59:31
       matcher: entry.matchers.claude,
       hooks: [{ type: 'command', command: entry.commandTemplate }],
     }));
-  if (postToolUse.length > 0) {
-    hooks.PostToolUse = postToolUse;
-  }
+  if (postToolUse.length > 0) {}
 
   const subagentStop = canonical.subagentStop
killedBy: 真实 canonical 组装 PostToolUse 注册 claude：PostToolUse 唯一条目 matcher 为工具集加 phase_next MCP 全名，command 含 record-files 与已展开 token
statusReason: Target cannot be null or undefined.

[Killed] ConditionalExpression
build/hooks-profile.ts:59:7
       matcher: entry.matchers.claude,
       hooks: [{ type: 'command', command: entry.commandTemplate }],
     }));
-  if (postToolUse.length > 0) {
+  if (false) {
     hooks.PostToolUse = postToolUse;
   }
killedBy: 真实 canonical 组装 PostToolUse 注册 claude：PostToolUse 唯一条目 matcher 为工具集加 phase_next MCP 全名，command 含 record-files 与已展开 token
statusReason: Target cannot be null or undefined.

[Survived] MethodExpression
build/hooks-profile.ts:63:24
     hooks.PostToolUse = postToolUse;
   }
 
-  const subagentStop = canonical.subagentStop
-    .filter((entry) => entry.matchers.claude)
+  const subagentStop = canonical.subagentStop
     .map((entry) => ({
       matcher: entry.matchers.claude,

[Killed] ArrowFunction
build/hooks-profile.ts:64:13
   }
 
   const subagentStop = canonical.subagentStop
-    .filter((entry) => entry.matchers.claude)
+    .filter(() => undefined)
     .map((entry) => ({
       matcher: entry.matchers.claude,
killedBy: 真实 canonical 组装 PostToolUse 注册 claude：既有 PreToolUse 三条目与 SubagentStop 两条目的包装形态不变（回归）
statusReason: Target cannot be null or undefined.

[Killed] ObjectLiteral
build/hooks-profile.ts:65:22
 
   const subagentStop = canonical.subagentStop
     .filter((entry) => entry.matchers.claude)
-    .map((entry) => ({
-      matcher: entry.matchers.claude,
-      hooks: [{ type: 'command', command: entry.commandTemplate }],
-    }));
+    .map((entry) => ({}));
   if (subagentStop.length > 0) {
     hooks.SubagentStop = subagentStop;
killedBy: 真实 canonical 组装 PostToolUse 注册 claude：既有 PreToolUse 三条目与 SubagentStop 两条目的包装形态不变（回归）
statusReason: expected undefined to deeply equal [ { type: 'command', …(1) } ]

[Killed] EqualityOperator
build/hooks-profile.ts:69:7
       matcher: entry.matchers.claude,
       hooks: [{ type: 'command', command: entry.commandTemplate }],
     }));
-  if (subagentStop.length > 0) {
+  if (subagentStop.length >= 0) {
     hooks.SubagentStop = subagentStop;
   }
killedBy: buildHooksFile subagentStop=[] 时 Cursor 省略键；Claude 不写出 SubagentStop
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
build/hooks-profile.ts:69:7
       matcher: entry.matchers.claude,
       hooks: [{ type: 'command', command: entry.commandTemplate }],
     }));
-  if (subagentStop.length > 0) {
+  if (subagentStop.length <= 0) {
     hooks.SubagentStop = subagentStop;
   }
killedBy: assembleAll Claude outDir hooks 含 SubagentStop 且 command 含 static-check
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] MethodExpression
build/hooks-profile.ts:83:22
 function buildCursorNative(canonical: HooksCanonical): unknown {
   const hooks: Record<string, unknown> = {};
 
-  const preToolUse = canonical.preToolUse
-    .filter((entry) => entry.matchers.cursor)
+  const preToolUse = canonical.preToolUse
     .map((entry) => ({
       matcher: entry.matchers.cursor,
killedBy: buildHooksFile preToolUse 全 null cursor matcher 时 Cursor 亦省略 preToolUse 键
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
build/hooks-profile.ts:84:13
   const hooks: Record<string, unknown> = {};
 
   const preToolUse = canonical.preToolUse
-    .filter((entry) => entry.matchers.cursor)
+    .filter(() => undefined)
     .map((entry) => ({
       matcher: entry.matchers.cursor,
killedBy: 真实 canonical 组装 PostToolUse 注册 cursor：preToolUse 两条目 matchers 为 Write|StrReplace 与 Shell 且 command 含 protect-files；subagentStop 整段省略
statusReason: Target cannot be null or undefined.

[Killed] ArrowFunction
build/hooks-profile.ts:85:10
 
   const preToolUse = canonical.preToolUse
     .filter((entry) => entry.matchers.cursor)
-    .map((entry) => ({
-      matcher: entry.matchers.cursor,
-      command: entry.commandTemplate,
-    }));
+    .map(() => undefined);
   if (preToolUse.length > 0) {
     hooks.preToolUse = preToolUse;
killedBy: buildHooksFile claude matcher 覆盖 Claude 工具名族
statusReason: Cannot read properties of null (reading 'matcher')

[Killed] ObjectLiteral
build/hooks-profile.ts:85:22
 
   const preToolUse = canonical.preToolUse
     .filter((entry) => entry.matchers.cursor)
-    .map((entry) => ({
-      matcher: entry.matchers.cursor,
-      command: entry.commandTemplate,
-    }));
+    .map((entry) => ({}));
   if (preToolUse.length > 0) {
     hooks.preToolUse = preToolUse;
killedBy: buildHooksFile claude matcher 覆盖 Claude 工具名族
statusReason: expected '|' to contain 'Write'

[Killed] ConditionalExpression
build/hooks-profile.ts:89:7
       matcher: entry.matchers.cursor,
       command: entry.commandTemplate,
     }));
-  if (preToolUse.length > 0) {
+  if (false) {
     hooks.preToolUse = preToolUse;
   }
killedBy: buildHooksFile preToolUse 仍按非 null cursor matcher 发射；仅 subagentStop 因全 null 被省略
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
build/hooks-profile.ts:89:7
       matcher: entry.matchers.cursor,
       command: entry.commandTemplate,
     }));
-  if (preToolUse.length > 0) {
+  if (true) {
     hooks.preToolUse = preToolUse;
   }
killedBy: buildHooksFile preToolUse 全 null cursor matcher 时 Cursor 亦省略 preToolUse 键
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
build/hooks-profile.ts:93:23
     hooks.preToolUse = preToolUse;
   }
 
-  const postToolUse = canonical.postToolUse
-    .filter((entry) => entry.matchers.cursor)
+  const postToolUse = canonical.postToolUse
     .map((entry) => ({
       matcher: entry.matchers.cursor,
killedBy: 真实 canonical 组装 PostToolUse 注册 cursor / cursorHome：hooks 无 postToolUse 键（整段省略而非空数组），原始 JSON 不得出现空 postToolUse 数组
statusReason: expected true to be false // Object.is equality

[Survived] ArrowFunction
build/hooks-profile.ts:94:13
   }
 
   const postToolUse = canonical.postToolUse
-    .filter((entry) => entry.matchers.cursor)
+    .filter(() => undefined)
     .map((entry) => ({
       matcher: entry.matchers.cursor,

[Killed] EqualityOperator
build/hooks-profile.ts:99:7
       matcher: entry.matchers.cursor,
       command: entry.commandTemplate,
     }));
-  if (postToolUse.length > 0) {
+  if (postToolUse.length >= 0) {
     hooks.postToolUse = postToolUse;
   }
killedBy: buildHooksFile canonical 事件数组为空时产出合法最小 JSON 且不崩溃
statusReason: expected [ 'postToolUse' ] to have a length of +0 but got 1

[Killed] ConditionalExpression
build/hooks-profile.ts:99:7
       matcher: entry.matchers.cursor,
       command: entry.commandTemplate,
     }));
-  if (postToolUse.length > 0) {
+  if (true) {
     hooks.postToolUse = postToolUse;
   }
killedBy: buildHooksFile canonical 事件数组为空时产出合法最小 JSON 且不崩溃
statusReason: expected [ 'postToolUse' ] to have a length of +0 but got 1

[Killed] MethodExpression
build/hooks-profile.ts:103:24
     hooks.postToolUse = postToolUse;
   }
 
-  const subagentStop = canonical.subagentStop
-    .filter((entry) => entry.matchers.cursor)
+  const subagentStop = canonical.subagentStop
     .map((entry) => ({
       matcher: entry.matchers.cursor,
killedBy: buildHooksFile fixture 两条 subagentStop.matchers.cursor=null 时 cursor 产物 hooks 无 subagentStop 键
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
build/hooks-profile.ts:104:13
   }
 
   const subagentStop = canonical.subagentStop
-    .filter((entry) => entry.matchers.cursor)
+    .filter(() => undefined)
     .map((entry) => ({
       matcher: entry.matchers.cursor,
killedBy: buildHooksFile 非 null cursor subagentStop matcher 按平台展开 AGENT token
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ArrowFunction
build/hooks-profile.ts:105:10
 
   const subagentStop = canonical.subagentStop
     .filter((entry) => entry.matchers.cursor)
-    .map((entry) => ({
-      matcher: entry.matchers.cursor,
-      loop_limit: entry.loop_limit,
-      command: entry.commandTemplate,
-    }));
+    .map(() => undefined);
   if (subagentStop.length > 0) {
     hooks.subagentStop = subagentStop;
killedBy: buildHooksFile 非 null cursor subagentStop matcher 按平台展开 AGENT token
statusReason: expected undefined to be 'implementation-generator' // Object.is equality

[Killed] BlockStatement
build/hooks-profile.ts:110:32
       loop_limit: entry.loop_limit,
       command: entry.commandTemplate,
     }));
-  if (subagentStop.length > 0) {
-    hooks.subagentStop = subagentStop;
-  }
+  if (subagentStop.length > 0) {}
 
   return {
killedBy: buildHooksFile 非 null cursor subagentStop matcher 按平台展开 AGENT token
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
build/hooks-profile.ts:120:76
   };
 }
 
-export function buildHooksFile(canonical: object, env: ProductEnv): string {
-  requireProductEnv(env);
-  const parsed = hooksCanonicalSchema.parse(canonical);
-  const expanded = expandCanonical(parsed, env);
-  const doc = env.agent === 'claude' ? buildClaudeNested(expanded) : buildCursorNative(expanded);
-  return `${JSON.stringify(doc, null, 2)}\n`;
-}
+export function buildHooksFile(canonical: object, env: ProductEnv): string {}
 
killedBy: buildHooksFile claude PreToolUse / SubagentStop command 非空且展开 hooks 路径
statusReason: "undefined" is not valid JSON

[Killed] ConditionalExpression
build/hooks-profile.ts:124:15
   requireProductEnv(env);
   const parsed = hooksCanonicalSchema.parse(canonical);
   const expanded = expandCanonical(parsed, env);
-  const doc = env.agent === 'claude' ? buildClaudeNested(expanded) : buildCursorNative(expanded);
+  const doc = false ? buildClaudeNested(expanded) : buildCursorNative(expanded);
   return `${JSON.stringify(doc, null, 2)}\n`;
 }
killedBy: buildHooksFile claude PreToolUse / SubagentStop command 非空且展开 hooks 路径
statusReason: parsed.hooks.PreToolUse is not iterable

[Killed] ConditionalExpression
build/hooks-profile.ts:124:15
   requireProductEnv(env);
   const parsed = hooksCanonicalSchema.parse(canonical);
   const expanded = expandCanonical(parsed, env);
-  const doc = env.agent === 'claude' ? buildClaudeNested(expanded) : buildCursorNative(expanded);
+  const doc = true ? buildClaudeNested(expanded) : buildCursorNative(expanded);
   return `${JSON.stringify(doc, null, 2)}\n`;
 }
killedBy: buildHooksFile preToolUse 仍按非 null cursor matcher 发射；仅 subagentStop 因全 null 被省略
statusReason: Cannot read properties of undefined (reading 'length')
