[Killed] BlockStatement
build/env.ts:124:56
   },
 };
 
-export function getEnv(key: ProductEnvKey): ProductEnv {
-  const env = ENV_TABLE[key];
-  if (!env) {
-    throw new Error(`Unknown product env key: ${String(key)}`);
-  }
-  return env;
-}
+export function getEnv(key: ProductEnvKey): ProductEnv {}
 
 /** Reject null/undefined/empty env objects missing required ProductEnv fields. */
killedBy: assembleAll 三平台 outDir 均生成且无残留 __INCLUDE:
statusReason: env is required

[Killed] ConditionalExpression
build/env.ts:126:7
 
 export function getEnv(key: ProductEnvKey): ProductEnv {
   const env = ENV_TABLE[key];
-  if (!env) {
+  if (false) {
     throw new Error(`Unknown product env key: ${String(key)}`);
   }
killedBy: getEnv 非法 key 运行时抛错
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
build/env.ts:126:7
 
 export function getEnv(key: ProductEnvKey): ProductEnv {
   const env = ENV_TABLE[key];
-  if (!env) {
+  if (env) {
     throw new Error(`Unknown product env key: ${String(key)}`);
   }
killedBy: applyEnvTokens claude/cursor env 将 __MCP:phase_log__ 展开为插件 MCP 前缀
statusReason: Unknown product env key: claude

[Killed] BlockStatement
build/env.ts:133:58
 }
 
 /** Reject null/undefined/empty env objects missing required ProductEnv fields. */
-export function requireProductEnv(env: ProductEnv): void {
-  if (env == null || typeof env !== 'object' || !('agent' in env) || env.agent == null) {
-    throw new Error('env is required');
-  }
-}
+export function requireProductEnv(env: ProductEnv): void {}
 
killedBy: buildHooksFile env={} 缺失 agent 等必填字段时抛错
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
build/env.ts:134:89
 
 /** Reject null/undefined/empty env objects missing required ProductEnv fields. */
 export function requireProductEnv(env: ProductEnv): void {
-  if (env == null || typeof env !== 'object' || !('agent' in env) || env.agent == null) {
-    throw new Error('env is required');
-  }
+  if (env == null || typeof env !== 'object' || !('agent' in env) || env.agent == null) {}
 }
 
killedBy: assertNoNameTokens rootDir / env 为 null / undefined 时抛错
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
build/env.ts:134:49
 
 /** Reject null/undefined/empty env objects missing required ProductEnv fields. */
 export function requireProductEnv(env: ProductEnv): void {
-  if (env == null || typeof env !== 'object' || !('agent' in env) || env.agent == null) {
+  if (env == null || typeof env !== 'object' || 'agent' in env || env.agent == null) {
     throw new Error('env is required');
   }
killedBy: assembleAll 三平台 outDir 均生成且无残留 __INCLUDE:
statusReason: env is required

[Survived] StringLiteral
build/env.ts:135:21
 /** Reject null/undefined/empty env objects missing required ProductEnv fields. */
 export function requireProductEnv(env: ProductEnv): void {
   if (env == null || typeof env !== 'object' || !('agent' in env) || env.agent == null) {
-    throw new Error('env is required');
+    throw new Error("");
   }
 }
