[Killed] BlockStatement
bin/src/commands/change-create.ts:21:3
 ): {
   name: string;
   path: string;
-} {
-  if (!kebabCasePattern.test(name)) {
-    throw new Error(
-      `name 必须为 kebab-case（小写字母/数字，可用 \`-\` 连接，最长 128 字符），收到: ${JSON.stringify(name)}`,
-    );
-  }
-  if (name.length > MAX_NAME_LENGTH) {
-    throw new Error(`name 长度超过 ${MAX_NAME_LENGTH} 字符限制（当前 ${name.length} 字符）`);
-  }
-
-  const changeDir = getChangeDir(name, projectRoot);
-  if (fs.existsSync(changeDir)) {
-    throw new Error(`change "${name}" 已存在: ${changeDir}`);
-  }
-
-  fs.mkdirSync(changeDir, { recursive: true });
-  const created = new Date().toISOString().slice(0, 10);
-  // Key order contract: workflow_type → created → files; `eval` is NOT written here.
-  const workflow = { workflow_type: workflowType, created, files: { written: [], deleted: [] } };
-  fs.writeFileSync(path.join(changeDir, 'workflow.json'), `${JSON.stringify(workflow)}\n`, 'utf-8');
-
-  return { name, path: changeDir };
-}
+} {}
 
killedBy: 场景: 清单直通检查（change 清单 → archi_check 被查文件集） 正向：change 清单模式 → files.written 全量参与被查（测试文件直通不过滤），matched / unmatched_files / violations 反映直通集合 (AC-9)
statusReason: Cannot read properties of undefined (reading 'path')

[Killed] ConditionalExpression
bin/src/commands/change-create.ts:22:7
   name: string;
   path: string;
 } {
-  if (!kebabCasePattern.test(name)) {
+  if (true) {
     throw new Error(
       `name 必须为 kebab-case（小写字母/数字，可用 \`-\` 连接，最长 128 字符），收到: ${JSON.stringify(name)}`,
killedBy: 场景: 清单直通检查（change 清单 → archi_check 被查文件集） 正向：change 清单模式 → files.written 全量参与被查（测试文件直通不过滤），matched / unmatched_files / violations 反映直通集合 (AC-9)
statusReason: name 必须为 kebab-case（小写字母/数字，可用 `-` 连接，最长 128 字符），收到: "inv-change"

[Killed] BooleanLiteral
bin/src/commands/change-create.ts:22:7
   name: string;
   path: string;
 } {
-  if (!kebabCasePattern.test(name)) {
+  if (kebabCasePattern.test(name)) {
     throw new Error(
       `name 必须为 kebab-case（小写字母/数字，可用 \`-\` 连接，最长 128 字符），收到: ${JSON.stringify(name)}`,
killedBy: 场景: 清单直通检查（change 清单 → archi_check 被查文件集） 正向：change 清单模式 → files.written 全量参与被查（测试文件直通不过滤），matched / unmatched_files / violations 反映直通集合 (AC-9)
statusReason: name 必须为 kebab-case（小写字母/数字，可用 `-` 连接，最长 128 字符），收到: "inv-change"

[Killed] BlockStatement
bin/src/commands/change-create.ts:27:38
       `name 必须为 kebab-case（小写字母/数字，可用 \`-\` 连接，最长 128 字符），收到: ${JSON.stringify(name)}`,
     );
   }
-  if (name.length > MAX_NAME_LENGTH) {
-    throw new Error(`name 长度超过 ${MAX_NAME_LENGTH} 字符限制（当前 ${name.length} 字符）`);
-  }
+  if (name.length > MAX_NAME_LENGTH) {}
 
   const changeDir = getChangeDir(name, projectRoot);
killedBy: runChangeCreate — kebab-case 名称校验 (AC-3) 名称超长（>128 字符）时应被拒绝
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
bin/src/commands/change-create.ts:27:7
       `name 必须为 kebab-case（小写字母/数字，可用 \`-\` 连接，最长 128 字符），收到: ${JSON.stringify(name)}`,
     );
   }
-  if (name.length > MAX_NAME_LENGTH) {
+  if (false) {
     throw new Error(`name 长度超过 ${MAX_NAME_LENGTH} 字符限制（当前 ${name.length} 字符）`);
   }
killedBy: runChangeCreate — kebab-case 名称校验 (AC-3) 名称超长（>128 字符）时应被拒绝
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
bin/src/commands/change-create.ts:32:33
   }
 
   const changeDir = getChangeDir(name, projectRoot);
-  if (fs.existsSync(changeDir)) {
-    throw new Error(`change "${name}" 已存在: ${changeDir}`);
-  }
+  if (fs.existsSync(changeDir)) {}
 
   fs.mkdirSync(changeDir, { recursive: true });
killedBy: runChangeCreate — 拒绝已存在 change (AC-4) 已存在的 change 目录名称抛出错误，且不覆盖已有目录内容 (AC-4)
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
bin/src/commands/change-create.ts:32:7
   }
 
   const changeDir = getChangeDir(name, projectRoot);
-  if (fs.existsSync(changeDir)) {
+  if (false) {
     throw new Error(`change "${name}" 已存在: ${changeDir}`);
   }
killedBy: runChangeCreate — 拒绝已存在 change (AC-4) 已存在的 change 目录名称抛出错误，且不覆盖已有目录内容 (AC-4)
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
bin/src/commands/change-create.ts:36:40
     throw new Error(`change "${name}" 已存在: ${changeDir}`);
   }
 
-  fs.mkdirSync(changeDir, { recursive: true });
+  fs.mkdirSync(changeDir, { recursive: false });
   const created = new Date().toISOString().slice(0, 10);
   // Key order contract: workflow_type → created → files; `eval` is NOT written here.
killedBy: runChangeCreate — kebab-case 名称校验 (AC-3) 合法 kebab-case 名称（如 my-change）创建目录并写入 workflow.json，包含 workflow_type: "requirement" 和 ISO 日期 created (AC-2)
statusReason: ENOENT: no such file or directory, mkdir 'C:\Users\wps\AppData\Local\Temp\change-create-test-uyXadd\openspec\changes\my-change'

[Killed] MethodExpression
bin/src/commands/change-create.ts:37:19
   }
 
   fs.mkdirSync(changeDir, { recursive: true });
-  const created = new Date().toISOString().slice(0, 10);
+  const created = new Date().toISOString();
   // Key order contract: workflow_type → created → files; `eval` is NOT written here.
   const workflow = { workflow_type: workflowType, created, files: { written: [], deleted: [] } };
killedBy: runChangeCreate — kebab-case 名称校验 (AC-3) 合法 kebab-case 名称（如 my-change）创建目录并写入 workflow.json，包含 workflow_type: "requirement" 和 ISO 日期 created (AC-2)
statusReason: expected '2026-09-17T06:52:24.008Z' to match /^\d{4}-\d{2}-\d{2}$/

[Killed] ArrayDeclaration
bin/src/commands/change-create.ts:39:91
   fs.mkdirSync(changeDir, { recursive: true });
   const created = new Date().toISOString().slice(0, 10);
   // Key order contract: workflow_type → created → files; `eval` is NOT written here.
-  const workflow = { workflow_type: workflowType, created, files: { written: [], deleted: [] } };
+  const workflow = { workflow_type: workflowType, created, files: { written: [], deleted: ["Stryker was here"] } };
   fs.writeFileSync(path.join(changeDir, 'workflow.json'), `${JSON.stringify(workflow)}\n`, 'utf-8');
 
killedBy: runChangeCreate — files 初始化 (AC-1) 新建 workflow.json 含 files: { written: [], deleted: [] } 初始空净状态 (AC-1)
statusReason: expected { written: [], …(1) } to deeply equal { written: [], deleted: [] }

[Killed] ObjectLiteral
bin/src/commands/change-create.ts:39:67
   fs.mkdirSync(changeDir, { recursive: true });
   const created = new Date().toISOString().slice(0, 10);
   // Key order contract: workflow_type → created → files; `eval` is NOT written here.
-  const workflow = { workflow_type: workflowType, created, files: { written: [], deleted: [] } };
+  const workflow = { workflow_type: workflowType, created, files: {} };
   fs.writeFileSync(path.join(changeDir, 'workflow.json'), `${JSON.stringify(workflow)}\n`, 'utf-8');
 
killedBy: 场景: 清单直通检查（change 清单 → archi_check 被查文件集） 正向：change 清单模式 → files.written 全量参与被查（测试文件直通不过滤），matched / unmatched_files / violations 反映直通集合 (AC-9)
statusReason: workflow.json 格式非法 (C:\Users\wps\AppData\Local\Temp\archi-check-inv-q2DECV\openspec\changes\inv-change\workflow.json): files.written: Invalid input: expected array, received undefined; files.deleted: Invalid input: expected array, received undefined

[Killed] StringLiteral
bin/src/commands/change-create.ts:40:41
   const created = new Date().toISOString().slice(0, 10);
   // Key order contract: workflow_type → created → files; `eval` is NOT written here.
   const workflow = { workflow_type: workflowType, created, files: { written: [], deleted: [] } };
-  fs.writeFileSync(path.join(changeDir, 'workflow.json'), `${JSON.stringify(workflow)}\n`, 'utf-8');
+  fs.writeFileSync(path.join(changeDir, ""), `${JSON.stringify(workflow)}\n`, 'utf-8');
 
   return { name, path: changeDir };
killedBy: runChangeCreate — kebab-case 名称校验 (AC-3) 合法 kebab-case 名称（如 my-change）创建目录并写入 workflow.json，包含 workflow_type: "requirement" 和 ISO 日期 created (AC-2)
statusReason: EISDIR: illegal operation on a directory, open 'C:\Users\wps\AppData\Local\Temp\change-create-test-PamxLV\openspec\changes\my-change'

[Killed] StringLiteral
bin/src/commands/change-create.ts:40:59
   const created = new Date().toISOString().slice(0, 10);
   // Key order contract: workflow_type → created → files; `eval` is NOT written here.
   const workflow = { workflow_type: workflowType, created, files: { written: [], deleted: [] } };
-  fs.writeFileSync(path.join(changeDir, 'workflow.json'), `${JSON.stringify(workflow)}\n`, 'utf-8');
+  fs.writeFileSync(path.join(changeDir, 'workflow.json'), ``, 'utf-8');
 
   return { name, path: changeDir };
killedBy: runChangeCreate — kebab-case 名称校验 (AC-3) 合法 kebab-case 名称（如 my-change）创建目录并写入 workflow.json，包含 workflow_type: "requirement" 和 ISO 日期 created (AC-2)
statusReason: Unexpected end of JSON input
