[Killed] BlockStatement
bin/src/commands/test-execution.ts:48:74
 // Reports directory resolution
 // ---------------------------------------------------------------------------
 
-function resolveReportsDir(projectRoot: string, change?: string): string {
-  if (change) {
-    return path.resolve(projectRoot, 'openspec', 'changes', change, 'reports', 'test');
-  }
-  return path.resolve(projectRoot, 'reports', 'test');
-}
+function resolveReportsDir(projectRoot: string, change?: string): string {}
 
 // ---------------------------------------------------------------------------
killedBy: runTestExecution -- 正向 (AC-1) 应在每个 framework 执行后调用 generateSubReport 写入子报告
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] ConditionalExpression
bin/src/commands/test-execution.ts:49:7
 // ---------------------------------------------------------------------------
 
 function resolveReportsDir(projectRoot: string, change?: string): string {
-  if (change) {
+  if (false) {
     return path.resolve(projectRoot, 'openspec', 'changes', change, 'reports', 'test');
   }
killedBy: runTestExecution — 清单突变 scope (AC-7) --skip-mutation（noMutation）跳过突变阶段既有语义保留；报告目录仍指向 change 专属 reports/test (AC-7)
statusReason: expected 'C:/Users/wps/AppData/Local/Temp/test-…' to be 'C:/Users/wps/AppData/Local/Temp/test-…' // Object.is equality

[Killed] BlockStatement
bin/src/commands/test-execution.ts:49:15
 // ---------------------------------------------------------------------------
 
 function resolveReportsDir(projectRoot: string, change?: string): string {
-  if (change) {
-    return path.resolve(projectRoot, 'openspec', 'changes', change, 'reports', 'test');
-  }
+  if (change) {}
   return path.resolve(projectRoot, 'reports', 'test');
 }
killedBy: runTestExecution — 清单突变 scope (AC-7) --skip-mutation（noMutation）跳过突变阶段既有语义保留；报告目录仍指向 change 专属 reports/test (AC-7)
statusReason: expected 'C:/Users/wps/AppData/Local/Temp/test-…' to be 'C:/Users/wps/AppData/Local/Temp/test-…' // Object.is equality

[Killed] StringLiteral
bin/src/commands/test-execution.ts:50:38
 
 function resolveReportsDir(projectRoot: string, change?: string): string {
   if (change) {
-    return path.resolve(projectRoot, 'openspec', 'changes', change, 'reports', 'test');
+    return path.resolve(projectRoot, "", 'changes', change, 'reports', 'test');
   }
   return path.resolve(projectRoot, 'reports', 'test');
killedBy: runTestExecution — 清单突变 scope (AC-7) --skip-mutation（noMutation）跳过突变阶段既有语义保留；报告目录仍指向 change 专属 reports/test (AC-7)
statusReason: expected 'C:/Users/wps/AppData/Local/Temp/test-…' to be 'C:/Users/wps/AppData/Local/Temp/test-…' // Object.is equality

[Killed] BlockStatement
bin/src/commands/test-execution.ts:63:75
  * Expand inventory paths so test-file entries also contribute their
  * colocated sources (via test-path-naming reverse mapping).
  */
-function expandMutationDiffWithInferredSources(files: string[]): string[] {
-  const result = new Set<string>();
-  for (const file of files) {
-    const posix = file.replace(/\\/g, '/');
-    result.add(posix);
-    const source = deriveSourcePathFromTestFile(posix);
-    if (source) {
-      result.add(source);
-    }
-  }
-  return Array.from(result);
-}
+function expandMutationDiffWithInferredSources(files: string[]): string[] {}
 
 /**
killedBy: runTestExecution — 清单突变 scope (AC-7) 传 change → readFileInventory(changeDir).written 经反推后作为 mutationDiffFiles 传入 executePlanEntry (AC-7)
statusReason: files is not iterable

[Killed] BlockStatement
bin/src/commands/test-execution.ts:65:29
  */
 function expandMutationDiffWithInferredSources(files: string[]): string[] {
   const result = new Set<string>();
-  for (const file of files) {
-    const posix = file.replace(/\\/g, '/');
-    result.add(posix);
-    const source = deriveSourcePathFromTestFile(posix);
-    if (source) {
-      result.add(source);
-    }
-  }
+  for (const file of files) {}
   return Array.from(result);
 }
killedBy: runTestExecution — 清单突变 scope (AC-7) 传 change → readFileInventory(changeDir).written 经反推后作为 mutationDiffFiles 传入 executePlanEntry (AC-7)
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Object>, …(2) ]

Received:

  1st vi.fn() call:

  [
-   Any<Object>,

[Killed] StringLiteral
bin/src/commands/test-execution.ts:66:39
 function expandMutationDiffWithInferredSources(files: string[]): string[] {
   const result = new Set<string>();
   for (const file of files) {
-    const posix = file.replace(/\\/g, '/');
+    const posix = file.replace(/\\/g, "");
     result.add(posix);
     const source = deriveSourcePathFromTestFile(posix);
killedBy: 场景: 真实仓库去噪漏斗 边界: CRLF 行尾与反斜杠路径形态归一化后参与去噪漏斗 (AC-7)
statusReason: expected [ Array(1) ] to include 'C:/Users/wps/AppData/Local/Temp/mutat…'

[Killed] ConditionalExpression
bin/src/commands/test-execution.ts:69:9
     const posix = file.replace(/\\/g, '/');
     result.add(posix);
     const source = deriveSourcePathFromTestFile(posix);
-    if (source) {
+    if (false) {
       result.add(source);
     }
killedBy: runTestExecution — 清单突变 scope (AC-7) 边界：written 含测试文件路径 → 反推同位源文件并入 scope（expandMutationDiffWithInferredSources 保留语义）
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Object>, …(2) ]

Received:

  1st vi.fn() call:

  [
-   Any<Object>,

[Killed] BlockStatement
bin/src/commands/test-execution.ts:69:17
     const posix = file.replace(/\\/g, '/');
     result.add(posix);
     const source = deriveSourcePathFromTestFile(posix);
-    if (source) {
-      result.add(source);
-    }
+    if (source) {}
   }
   return Array.from(result);
killedBy: runTestExecution — 清单突变 scope (AC-7) 边界：written 含测试文件路径 → 反推同位源文件并入 scope（expandMutationDiffWithInferredSources 保留语义）
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Object>, …(2) ]

Received:

  1st vi.fn() call:

  [
-   Any<Object>,

[Killed] BlockStatement
bin/src/commands/test-execution.ts:80:76
  * Return the `HEAD` version of a file, or null when HEAD has no such file or
  * the read fails — the caller then keeps the file (overstate direction only).
  */
-function headFileContent(projectRoot: string, file: string): string | null {
-  try {
-    return execFileSync('git', ['show', `HEAD:${file}`], {
-      cwd: projectRoot,
-      encoding: 'utf-8',
-      timeout: 10000,
-      stdio: ['ignore', 'pipe', 'ignore'],
-    });
-  } catch {
-    return null;
-  }
-}
+function headFileContent(projectRoot: string, file: string): string | null {}
 
 /**
killedBy: runTestExecution — 清单突变 scope (AC-7) 去噪：written 文件工作区内容 == HEAD 内容 → 从 scope 剔除（净归零去噪，AC-7）
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Object>, …(2) ]

Received:

  1st vi.fn() call:

  [
-   Any<Object>,

[Killed] BlockStatement
bin/src/commands/test-execution.ts:81:7
  * the read fails — the caller then keeps the file (overstate direction only).
  */
 function headFileContent(projectRoot: string, file: string): string | null {
-  try {
-    return execFileSync('git', ['show', `HEAD:${file}`], {
-      cwd: projectRoot,
-      encoding: 'utf-8',
-      timeout: 10000,
-      stdio: ['ignore', 'pipe', 'ignore'],
-    });
-  } catch {
+  try {} catch {
     return null;
   }
killedBy: runTestExecution — 清单突变 scope (AC-7) 去噪：written 文件工作区内容 == HEAD 内容 → 从 scope 剔除（净归零去噪，AC-7）
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Object>, …(2) ]

Received:

  1st vi.fn() call:

  [
-   Any<Object>,

[Killed] StringLiteral
bin/src/commands/test-execution.ts:82:41
  */
 function headFileContent(projectRoot: string, file: string): string | null {
   try {
-    return execFileSync('git', ['show', `HEAD:${file}`], {
+    return execFileSync('git', ['show', ``], {
       cwd: projectRoot,
       encoding: 'utf-8',
killedBy: 场景: 真实仓库去噪漏斗 正向: scope 恰为改写文件与 HEAD 缺席的新文件,net-zero 文件被剔除 (AC-7)
statusReason: expected [ …(3) ] to have a length of 2 but got 3

[Survived] ArrayDeclaration
bin/src/commands/test-execution.ts:86:14
       cwd: projectRoot,
       encoding: 'utf-8',
       timeout: 10000,
-      stdio: ['ignore', 'pipe', 'ignore'],
+      stdio: [],
     });
   } catch {

[Survived] StringLiteral
bin/src/commands/test-execution.ts:86:33
       cwd: projectRoot,
       encoding: 'utf-8',
       timeout: 10000,
-      stdio: ['ignore', 'pipe', 'ignore'],
+      stdio: ['ignore', 'pipe', ""],
     });
   } catch {

[Survived] BlockStatement
bin/src/commands/test-execution.ts:88:11
       timeout: 10000,
       stdio: ['ignore', 'pipe', 'ignore'],
     });
-  } catch {
-    return null;
-  }
+  } catch {}
 }
 

[Killed] BlockStatement
bin/src/commands/test-execution.ts:100:77
  * correctness of filtered files stays with the evaluator content check.
  * Unreadable working-tree files and HEAD-less (new) files are kept.
  */
-function filterNetZeroFiles(files: string[], projectRoot: string): string[] {
-  const kept: string[] = [];
-  let excluded = 0;
-  for (const file of files) {
-    let working: string | null = null;
-    try {
-      working = fs.readFileSync(path.resolve(projectRoot, file), 'utf-8');
-    } catch {
-      kept.push(file);
-      continue;
-    }
-    const head = headFileContent(projectRoot, file);
-    if (head !== null && head === working) {
-      excluded += 1;
-      continue;
-    }
-    kept.push(file);
-  }
-  if (excluded > 0) {
-    console.log(
-      `mutation denoise: ${excluded} net-zero files excluded (content identical to HEAD)`,
-    );
-  }
-  return kept;
-}
+function filterNetZeroFiles(files: string[], projectRoot: string): string[] {}
 
 /**
killedBy: 场景: 真实仓库去噪漏斗 正向: scope 恰为改写文件与 HEAD 缺席的新文件,net-zero 文件被剔除 (AC-7)
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
bin/src/commands/test-execution.ts:103:29
 function filterNetZeroFiles(files: string[], projectRoot: string): string[] {
   const kept: string[] = [];
   let excluded = 0;
-  for (const file of files) {
-    let working: string | null = null;
-    try {
-      working = fs.readFileSync(path.resolve(projectRoot, file), 'utf-8');
-    } catch {
-      kept.push(file);
-      continue;
-    }
-    const head = headFileContent(projectRoot, file);
-    if (head !== null && head === working) {
-      excluded += 1;
-      continue;
-    }
-    kept.push(file);
-  }
+  for (const file of files) {}
   if (excluded > 0) {
     console.log(
killedBy: 场景: 真实仓库去噪漏斗 正向: scope 恰为改写文件与 HEAD 缺席的新文件,net-zero 文件被剔除 (AC-7)
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
bin/src/commands/test-execution.ts:105:9
   let excluded = 0;
   for (const file of files) {
     let working: string | null = null;
-    try {
-      working = fs.readFileSync(path.resolve(projectRoot, file), 'utf-8');
-    } catch {
+    try {} catch {
       kept.push(file);
       continue;
killedBy: 场景: 真实仓库去噪漏斗 正向: scope 恰为改写文件与 HEAD 缺席的新文件,net-zero 文件被剔除 (AC-7)
statusReason: expected [ …(3) ] to have a length of 2 but got 3

[Killed] StringLiteral
bin/src/commands/test-execution.ts:106:66
   for (const file of files) {
     let working: string | null = null;
     try {
-      working = fs.readFileSync(path.resolve(projectRoot, file), 'utf-8');
+      working = fs.readFileSync(path.resolve(projectRoot, file), "");
     } catch {
       kept.push(file);
killedBy: 场景: 真实仓库去噪漏斗 正向: scope 恰为改写文件与 HEAD 缺席的新文件,net-zero 文件被剔除 (AC-7)
statusReason: expected [ …(3) ] to have a length of 2 but got 3

[Survived] BlockStatement
bin/src/commands/test-execution.ts:107:13
     let working: string | null = null;
     try {
       working = fs.readFileSync(path.resolve(projectRoot, file), 'utf-8');
-    } catch {
-      kept.push(file);
-      continue;
-    }
+    } catch {}
     const head = headFileContent(projectRoot, file);
     if (head !== null && head === working) {

[Killed] ConditionalExpression
bin/src/commands/test-execution.ts:112:9
       continue;
     }
     const head = headFileContent(projectRoot, file);
-    if (head !== null && head === working) {
+    if (true) {
       excluded += 1;
       continue;
killedBy: 场景: 真实仓库去噪漏斗 正向: scope 恰为改写文件与 HEAD 缺席的新文件,net-zero 文件被剔除 (AC-7)
statusReason: expected [ Array(1) ] to have a length of 2 but got 1

[Killed] EqualityOperator
bin/src/commands/test-execution.ts:112:9
       continue;
     }
     const head = headFileContent(projectRoot, file);
-    if (head !== null && head === working) {
+    if (head === null && head === working) {
       excluded += 1;
       continue;
killedBy: 场景: 真实仓库去噪漏斗 正向: scope 恰为改写文件与 HEAD 缺席的新文件,net-zero 文件被剔除 (AC-7)
statusReason: expected [ …(3) ] to have a length of 2 but got 3

[Killed] AssignmentOperator
bin/src/commands/test-execution.ts:113:7
     }
     const head = headFileContent(projectRoot, file);
     if (head !== null && head === working) {
-      excluded += 1;
+      excluded -= 1;
       continue;
     }
killedBy: 场景: 真实仓库去噪漏斗 正向: scope 恰为改写文件与 HEAD 缺席的新文件,net-zero 文件被剔除 (AC-7)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
bin/src/commands/test-execution.ts:118:21
     }
     kept.push(file);
   }
-  if (excluded > 0) {
-    console.log(
-      `mutation denoise: ${excluded} net-zero files excluded (content identical to HEAD)`,
-    );
-  }
+  if (excluded > 0) {}
   return kept;
 }
killedBy: 场景: 真实仓库去噪漏斗 正向: scope 恰为改写文件与 HEAD 缺席的新文件,net-zero 文件被剔除 (AC-7)
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
bin/src/commands/test-execution.ts:118:7
     }
     kept.push(file);
   }
-  if (excluded > 0) {
+  if (excluded <= 0) {
     console.log(
       `mutation denoise: ${excluded} net-zero files excluded (content identical to HEAD)`,
killedBy: 场景: 真实仓库去噪漏斗 正向: scope 恰为改写文件与 HEAD 缺席的新文件,net-zero 文件被剔除 (AC-7)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
bin/src/commands/test-execution.ts:140:25
   change: string | undefined,
   noMutation: boolean | undefined,
   projectRoot: string,
-): string[] | undefined {
-  if (!change || noMutation) return undefined;
-
-  const changeDir = getChangeDir(change, projectRoot);
-  const written = readFileInventory(changeDir).written;
-  const expanded = expandMutationDiffWithInferredSources(written);
-  const scoped = filterNetZeroFiles(expanded, projectRoot);
-  console.log(
-    `mutation scope (change inventory): ${scoped.length} files (${scoped.slice(0, 5).join(', ')})`,
-  );
-  return scoped.map((file) => path.resolve(projectRoot, file).replace(/\\/g, '/'));
-}
+): string[] | undefined {}
 
 // ---------------------------------------------------------------------------
killedBy: 场景: 真实仓库去噪漏斗 正向: scope 恰为改写文件与 HEAD 缺席的新文件,net-zero 文件被剔除 (AC-7)
statusReason: Target cannot be null or undefined.

[Killed] LogicalOperator
bin/src/commands/test-execution.ts:141:7
   noMutation: boolean | undefined,
   projectRoot: string,
 ): string[] | undefined {
-  if (!change || noMutation) return undefined;
+  if (!change && noMutation) return undefined;
 
   const changeDir = getChangeDir(change, projectRoot);
killedBy: 场景: 入口与守卫 正向: noMutation 与 change 同传 → 惰性解析,旧 change 不误报且不限圈 (AC-7)
statusReason: workflow.json 缺少 files 字段 (C:\Users\wps\AppData\Local\Temp\mutation-scope-inventory-0xOjmx\openspec\changes\legacy\workflow.json)：该 change 创建于文件清单机制之前，请重建该 change（change_create）。

[Killed] ConditionalExpression
bin/src/commands/test-execution.ts:141:7
   noMutation: boolean | undefined,
   projectRoot: string,
 ): string[] | undefined {
-  if (!change || noMutation) return undefined;
+  if (true) return undefined;
 
   const changeDir = getChangeDir(change, projectRoot);
killedBy: 场景: 真实仓库去噪漏斗 正向: scope 恰为改写文件与 HEAD 缺席的新文件,net-zero 文件被剔除 (AC-7)
statusReason: Target cannot be null or undefined.

[Survived] MethodExpression
bin/src/commands/test-execution.ts:148:67
   const expanded = expandMutationDiffWithInferredSources(written);
   const scoped = filterNetZeroFiles(expanded, projectRoot);
   console.log(
-    `mutation scope (change inventory): ${scoped.length} files (${scoped.slice(0, 5).join(', ')})`,
+    `mutation scope (change inventory): ${scoped.length} files (${scoped.join(', ')})`,
   );
   return scoped.map((file) => path.resolve(projectRoot, file).replace(/\\/g, '/'));

[Survived] StringLiteral
bin/src/commands/test-execution.ts:148:91
   const expanded = expandMutationDiffWithInferredSources(written);
   const scoped = filterNetZeroFiles(expanded, projectRoot);
   console.log(
-    `mutation scope (change inventory): ${scoped.length} files (${scoped.slice(0, 5).join(', ')})`,
+    `mutation scope (change inventory): ${scoped.length} files (${scoped.slice(0, 5).join("")})`,
   );
   return scoped.map((file) => path.resolve(projectRoot, file).replace(/\\/g, '/'));

[Killed] ArrowFunction
bin/src/commands/test-execution.ts:150:21
   console.log(
     `mutation scope (change inventory): ${scoped.length} files (${scoped.slice(0, 5).join(', ')})`,
   );
-  return scoped.map((file) => path.resolve(projectRoot, file).replace(/\\/g, '/'));
+  return scoped.map(() => undefined);
 }
 
killedBy: 场景: 真实仓库去噪漏斗 正向: scope 恰为改写文件与 HEAD 缺席的新文件,net-zero 文件被剔除 (AC-7)
statusReason: expected [ undefined, undefined ] to deeply equal [ …(2) ]

[Killed] StringLiteral
bin/src/commands/test-execution.ts:150:78
   console.log(
     `mutation scope (change inventory): ${scoped.length} files (${scoped.slice(0, 5).join(', ')})`,
   );
-  return scoped.map((file) => path.resolve(projectRoot, file).replace(/\\/g, '/'));
+  return scoped.map((file) => path.resolve(projectRoot, file).replace(/\\/g, ""));
 }
 
killedBy: 场景: 真实仓库去噪漏斗 正向: scope 恰为改写文件与 HEAD 缺席的新文件,net-zero 文件被剔除 (AC-7)
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] BlockStatement
bin/src/commands/test-execution.ts:157:100
 // Logging helpers
 // ---------------------------------------------------------------------------
 
-function logResult(entryFramework: string, result: { testCases: Array<{ status: string }> }): void {
-  const testCases = result.testCases;
-  console.log(
-    `  ${entryFramework}: ${testCases.length} tests, ` +
-      `${testCases.filter((t) => t.status === 'passed').length} passed, ` +
-      `${testCases.filter((t) => t.status === 'failed').length} failed, ` +
-      `${testCases.filter((t) => t.status === 'skipped').length} skipped`,
-  );
-}
+function logResult(entryFramework: string, result: { testCases: Array<{ status: string }> }): void {}
 
 function logSummary(report: {
killedBy: runTestExecution — logResult 状态计数文案 testCases：passed×2 + failed×1 + skipped×1 时 stdout 精确匹配 n tests / 2 passed / 1 failed / 1 skipped
statusReason: expected undefined to be defined

[Killed] StringLiteral
bin/src/commands/test-execution.ts:160:5
 function logResult(entryFramework: string, result: { testCases: Array<{ status: string }> }): void {
   const testCases = result.testCases;
   console.log(
-    `  ${entryFramework}: ${testCases.length} tests, ` +
+    `` +
       `${testCases.filter((t) => t.status === 'passed').length} passed, ` +
       `${testCases.filter((t) => t.status === 'failed').length} failed, ` +
killedBy: runTestExecution — logResult 状态计数文案 testCases：passed×2 + failed×1 + skipped×1 时 stdout 精确匹配 n tests / 2 passed / 1 failed / 1 skipped
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
bin/src/commands/test-execution.ts:161:34
   const testCases = result.testCases;
   console.log(
     `  ${entryFramework}: ${testCases.length} tests, ` +
-      `${testCases.filter((t) => t.status === 'passed').length} passed, ` +
+      `${testCases.filter((t) => true).length} passed, ` +
       `${testCases.filter((t) => t.status === 'failed').length} failed, ` +
       `${testCases.filter((t) => t.status === 'skipped').length} skipped`,
killedBy: runTestExecution — logResult 状态计数文案 testCases：passed×2 + failed×1 + skipped×1 时 stdout 精确匹配 n tests / 2 passed / 1 failed / 1 skipped
statusReason: expected '  vitest: 4 tests, 4 passed, 1 failed…' to contain '2 passed'

[Killed] ConditionalExpression
bin/src/commands/test-execution.ts:161:34
   const testCases = result.testCases;
   console.log(
     `  ${entryFramework}: ${testCases.length} tests, ` +
-      `${testCases.filter((t) => t.status === 'passed').length} passed, ` +
+      `${testCases.filter((t) => false).length} passed, ` +
       `${testCases.filter((t) => t.status === 'failed').length} failed, ` +
       `${testCases.filter((t) => t.status === 'skipped').length} skipped`,
killedBy: runTestExecution — logResult 状态计数文案 testCases：passed×2 + failed×1 + skipped×1 时 stdout 精确匹配 n tests / 2 passed / 1 failed / 1 skipped
statusReason: expected '  vitest: 4 tests, 0 passed, 1 failed…' to contain '2 passed'

[Killed] ConditionalExpression
bin/src/commands/test-execution.ts:162:34
   console.log(
     `  ${entryFramework}: ${testCases.length} tests, ` +
       `${testCases.filter((t) => t.status === 'passed').length} passed, ` +
-      `${testCases.filter((t) => t.status === 'failed').length} failed, ` +
+      `${testCases.filter((t) => false).length} failed, ` +
       `${testCases.filter((t) => t.status === 'skipped').length} skipped`,
   );
killedBy: runTestExecution — logResult 状态计数文案 testCases：passed×2 + failed×1 + skipped×1 时 stdout 精确匹配 n tests / 2 passed / 1 failed / 1 skipped
statusReason: expected '  vitest: 4 tests, 2 passed, 0 failed…' to contain '1 failed'

[Killed] ConditionalExpression
bin/src/commands/test-execution.ts:162:34
   console.log(
     `  ${entryFramework}: ${testCases.length} tests, ` +
       `${testCases.filter((t) => t.status === 'passed').length} passed, ` +
-      `${testCases.filter((t) => t.status === 'failed').length} failed, ` +
+      `${testCases.filter((t) => true).length} failed, ` +
       `${testCases.filter((t) => t.status === 'skipped').length} skipped`,
   );
killedBy: runTestExecution — logResult 状态计数文案 testCases：passed×2 + failed×1 + skipped×1 时 stdout 精确匹配 n tests / 2 passed / 1 failed / 1 skipped
statusReason: expected '  vitest: 4 tests, 2 passed, 4 failed…' to contain '1 failed'

[Killed] EqualityOperator
bin/src/commands/test-execution.ts:163:34
     `  ${entryFramework}: ${testCases.length} tests, ` +
       `${testCases.filter((t) => t.status === 'passed').length} passed, ` +
       `${testCases.filter((t) => t.status === 'failed').length} failed, ` +
-      `${testCases.filter((t) => t.status === 'skipped').length} skipped`,
+      `${testCases.filter((t) => t.status !== 'skipped').length} skipped`,
   );
 }
killedBy: runTestExecution — logResult 状态计数文案 testCases：passed×2 + failed×1 + skipped×1 时 stdout 精确匹配 n tests / 2 passed / 1 failed / 1 skipped
statusReason: expected '  vitest: 4 tests, 2 passed, 1 failed…' to contain '1 skipped'

[Killed] ArrowFunction
bin/src/commands/test-execution.ts:163:27
     `  ${entryFramework}: ${testCases.length} tests, ` +
       `${testCases.filter((t) => t.status === 'passed').length} passed, ` +
       `${testCases.filter((t) => t.status === 'failed').length} failed, ` +
-      `${testCases.filter((t) => t.status === 'skipped').length} skipped`,
+      `${testCases.filter(() => undefined).length} skipped`,
   );
 }
killedBy: runTestExecution — logResult 状态计数文案 testCases：passed×2 + failed×1 + skipped×1 时 stdout 精确匹配 n tests / 2 passed / 1 failed / 1 skipped
statusReason: expected '  vitest: 4 tests, 2 passed, 1 failed…' to contain '1 skipped'

[Killed] BlockStatement
bin/src/commands/test-execution.ts:175:10
   skipped: number;
   duration_seconds: number;
   problems: Array<{ type: string; framework: string; message: string }>;
-}): void {
-  console.log(`\nSummary: ${report.conclusion.toUpperCase()}`);
-  console.log(`  Total: ${report.total}`);
-  console.log(`  Passed: ${report.passed}`);
-  console.log(`  Failed: ${report.failed}`);
-  console.log(`  Skipped: ${report.skipped}`);
-  console.log(`  Duration: ${report.duration_seconds}s`);
-
-  if (report.problems.length > 0) {
-    console.log(`\nProblems (${report.problems.length}):`);
-    for (const problem of report.problems) {
-      console.log(`  [${problem.type}] ${problem.framework}: ${problem.message}`);
-    }
-  }
-}
+}): void {}
 
 // ---------------------------------------------------------------------------
killedBy: runTestExecution — logSummary 文案 conclusion: 'pass' 时 stdout 含 Summary: PASS 与 Total/Passed/Failed/Skipped/Duration 精确标签
statusReason: expected 'Running vitest tests in . (root: .)..…' to contain 'Summary: PASS'

[Killed] MethodExpression
bin/src/commands/test-execution.ts:176:29
   duration_seconds: number;
   problems: Array<{ type: string; framework: string; message: string }>;
 }): void {
-  console.log(`\nSummary: ${report.conclusion.toUpperCase()}`);
+  console.log(`\nSummary: ${report.conclusion.toLowerCase()}`);
   console.log(`  Total: ${report.total}`);
   console.log(`  Passed: ${report.passed}`);
killedBy: runTestExecution — logSummary 文案 conclusion: 'pass' 时 stdout 含 Summary: PASS 与 Total/Passed/Failed/Skipped/Duration 精确标签
statusReason: expected 'Running vitest tests in . (root: .)..…' to contain 'Summary: PASS'

[Killed] StringLiteral
bin/src/commands/test-execution.ts:176:15
   duration_seconds: number;
   problems: Array<{ type: string; framework: string; message: string }>;
 }): void {
-  console.log(`\nSummary: ${report.conclusion.toUpperCase()}`);
+  console.log(``);
   console.log(`  Total: ${report.total}`);
   console.log(`  Passed: ${report.passed}`);
killedBy: runTestExecution — logSummary 文案 conclusion: 'pass' 时 stdout 含 Summary: PASS 与 Total/Passed/Failed/Skipped/Duration 精确标签
statusReason: expected 'Running vitest tests in . (root: .)..…' to contain 'Summary: PASS'

[Killed] StringLiteral
bin/src/commands/test-execution.ts:181:15
   console.log(`  Passed: ${report.passed}`);
   console.log(`  Failed: ${report.failed}`);
   console.log(`  Skipped: ${report.skipped}`);
-  console.log(`  Duration: ${report.duration_seconds}s`);
+  console.log(``);
 
   if (report.problems.length > 0) {
killedBy: runTestExecution — logSummary 文案 conclusion: 'pass' 时 stdout 含 Summary: PASS 与 Total/Passed/Failed/Skipped/Duration 精确标签
statusReason: expected 'Running vitest tests in . (root: .)..…' to contain 'Duration:'

[Killed] EqualityOperator
bin/src/commands/test-execution.ts:183:7
   console.log(`  Skipped: ${report.skipped}`);
   console.log(`  Duration: ${report.duration_seconds}s`);
 
-  if (report.problems.length > 0) {
+  if (report.problems.length <= 0) {
     console.log(`\nProblems (${report.problems.length}):`);
     for (const problem of report.problems) {
killedBy: runTestExecution — logSummary 文案 conclusion: 'pass' 时 stdout 含 Summary: PASS 与 Total/Passed/Failed/Skipped/Duration 精确标签
statusReason: expected 'Running vitest tests in . (root: .)..…' not to contain 'Problems ('

[Killed] BlockStatement
bin/src/commands/test-execution.ts:183:35
   console.log(`  Skipped: ${report.skipped}`);
   console.log(`  Duration: ${report.duration_seconds}s`);
 
-  if (report.problems.length > 0) {
-    console.log(`\nProblems (${report.problems.length}):`);
-    for (const problem of report.problems) {
-      console.log(`  [${problem.type}] ${problem.framework}: ${problem.message}`);
-    }
-  }
+  if (report.problems.length > 0) {}
 }
 
killedBy: runTestExecution — logSummary 文案 problems.length > 0 时打印 Problems (N):；problems: [] 时不得打印 Problems 块
statusReason: expected 'Running vitest tests in . (root: .)..…' to contain 'Problems (1):'

[Killed] StringLiteral
bin/src/commands/test-execution.ts:184:17
   console.log(`  Duration: ${report.duration_seconds}s`);
 
   if (report.problems.length > 0) {
-    console.log(`\nProblems (${report.problems.length}):`);
+    console.log(``);
     for (const problem of report.problems) {
       console.log(`  [${problem.type}] ${problem.framework}: ${problem.message}`);
killedBy: runTestExecution — logSummary 文案 problems.length > 0 时打印 Problems (N):；problems: [] 时不得打印 Problems 块
statusReason: expected 'Running vitest tests in . (root: .)..…' to contain 'Problems (1):'

[Killed] BlockStatement
bin/src/commands/test-execution.ts:185:44
 
   if (report.problems.length > 0) {
     console.log(`\nProblems (${report.problems.length}):`);
-    for (const problem of report.problems) {
-      console.log(`  [${problem.type}] ${problem.framework}: ${problem.message}`);
-    }
+    for (const problem of report.problems) {}
   }
 }
killedBy: runTestExecution — logSummary 文案 problems.length > 0 时打印 Problems (N):；problems: [] 时不得打印 Problems 块
statusReason: expected 'Running vitest tests in . (root: .)..…' to contain '[error] vitest: boom'

[Killed] BlockStatement
bin/src/commands/test-execution.ts:205:34
   options: TestExecutionOptions,
   mutationDiffFiles: string[] | undefined,
   reportsDir: string,
-): TestExecutionSubReport | null {
-  const planFiles = resolvePlanFiles(options.files, entry);
-  if (options.files !== undefined && (planFiles?.length ?? 0) === 0) {
-    console.log(`Skipping ${entry.framework} in ${entry.root}: no files under suite root`);
-    return null;
-  }
-
-  console.log(`Running ${entry.framework} tests in ${entry.cwd} (root: ${entry.root})...`);
-  const result = executePlanEntry(entry, projectRoot, {
-    files: planFiles,
-    noMutation: options.noMutation,
-    mutationDiffFiles,
-    reportsDir,
-  });
-  const subReport = generateSubReport(entry.framework, result, projectRoot, reportsDir, entry.root);
-  logResult(entry.framework, result);
-  return subReport;
-}
+): TestExecutionSubReport | null {}
 
 // ---------------------------------------------------------------------------
killedBy: runTestExecution -- 正向 (AC-1) 应对 plan 中每个 framework 调用 executePlanEntry
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times
