[Killed] BlockStatement
bin/src/commands/test-execution.ts:207:70
   reportsDir: string,
 ): TestExecutionSubReport | null {
   const planFiles = resolvePlanFiles(options.files, entry);
-  if (options.files !== undefined && (planFiles?.length ?? 0) === 0) {
-    console.log(`Skipping ${entry.framework} in ${entry.root}: no files under suite root`);
-    return null;
-  }
+  if (options.files !== undefined && (planFiles?.length ?? 0) === 0) {}
 
   console.log(`Running ${entry.framework} tests in ${entry.cwd} (root: ${entry.root})...`);
killedBy: runTestExecution — reportsDir 新布局 (AC-1) 显式 files 未命中某 suite root 时 skip，不回落全量执行
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] LogicalOperator
bin/src/commands/test-execution.ts:207:7
   reportsDir: string,
 ): TestExecutionSubReport | null {
   const planFiles = resolvePlanFiles(options.files, entry);
-  if (options.files !== undefined && (planFiles?.length ?? 0) === 0) {
+  if (options.files !== undefined || (planFiles?.length ?? 0) === 0) {
     console.log(`Skipping ${entry.framework} in ${entry.root}: no files under suite root`);
     return null;
killedBy: runTestExecution -- 正向 (AC-1) 应对 plan 中每个 framework 调用 executePlanEntry
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] ConditionalExpression
bin/src/commands/test-execution.ts:229:23
 // ---------------------------------------------------------------------------
 
 export async function runTestExecution(options: TestExecutionOptions): Promise<number> {
-  const projectRoot = options.projectRoot || getProjectDir();
+  const projectRoot = true;
   const detectResult = runTestDetectFrameworks({ files: options.files, projectRoot });
 
killedBy: runTestExecution -- 正向 (AC-1) 应调用 runTestDetectFrameworks 获取 plan
statusReason: The "paths[0]" argument must be of type string. Received type boolean (true)

[Killed] ConditionalExpression
bin/src/commands/test-execution.ts:229:23
 // ---------------------------------------------------------------------------
 
 export async function runTestExecution(options: TestExecutionOptions): Promise<number> {
-  const projectRoot = options.projectRoot || getProjectDir();
+  const projectRoot = false;
   const detectResult = runTestDetectFrameworks({ files: options.files, projectRoot });
 
killedBy: 场景: 真实仓库去噪漏斗 正向: scope 恰为改写文件与 HEAD 缺席的新文件,net-zero 文件被剔除 (AC-7)
statusReason: The "paths[0]" argument must be of type string. Received type boolean (false)

[Killed] ObjectLiteral
bin/src/commands/test-execution.ts:230:48
 
 export async function runTestExecution(options: TestExecutionOptions): Promise<number> {
   const projectRoot = options.projectRoot || getProjectDir();
-  const detectResult = runTestDetectFrameworks({ files: options.files, projectRoot });
+  const detectResult = runTestDetectFrameworks({});
 
   if (detectResult.plan.length === 0) {
killedBy: runTestExecution -- 正向 (AC-1) 应调用 runTestDetectFrameworks 获取 plan
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
bin/src/commands/test-execution.ts:232:39
   const projectRoot = options.projectRoot || getProjectDir();
   const detectResult = runTestDetectFrameworks({ files: options.files, projectRoot });
 
-  if (detectResult.plan.length === 0) {
-    console.log('No test configuration found. Configure tests in openspec/config.json');
-    return 0;
-  }
+  if (detectResult.plan.length === 0) {}
 
   const planEntries = options.framework
killedBy: runTestExecution — 无配置提示引导 tests (AC-6) plan.length === 0 时日志包含配置 tests 的引导文案，返回 0
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
bin/src/commands/test-execution.ts:232:7
   const projectRoot = options.projectRoot || getProjectDir();
   const detectResult = runTestDetectFrameworks({ files: options.files, projectRoot });
 
-  if (detectResult.plan.length === 0) {
+  if (false) {
     console.log('No test configuration found. Configure tests in openspec/config.json');
     return 0;
killedBy: runTestExecution — 无配置提示引导 tests (AC-6) plan.length === 0 时日志包含配置 tests 的引导文案，返回 0
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
bin/src/commands/test-execution.ts:233:17
   const detectResult = runTestDetectFrameworks({ files: options.files, projectRoot });
 
   if (detectResult.plan.length === 0) {
-    console.log('No test configuration found. Configure tests in openspec/config.json');
+    console.log("");
     return 0;
   }
killedBy: runTestExecution — 无配置提示引导 tests (AC-6) plan.length === 0 时日志包含配置 tests 的引导文案，返回 0
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
bin/src/commands/test-execution.ts:238:43
   }
 
   const planEntries = options.framework
-    ? detectResult.plan.filter((entry) => entry.framework === options.framework)
+    ? detectResult.plan.filter((entry) => true)
     : detectResult.plan;
 
killedBy: runTestExecution — 清单突变 scope (AC-7) --framework 过滤时仅匹配的 framework 执行，且仍收到清单来源 mutationDiffFiles
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] MethodExpression
bin/src/commands/test-execution.ts:238:7
   }
 
   const planEntries = options.framework
-    ? detectResult.plan.filter((entry) => entry.framework === options.framework)
+    ? detectResult.plan
     : detectResult.plan;
 
killedBy: runTestExecution — 清单突变 scope (AC-7) --framework 过滤时仅匹配的 framework 执行，且仍收到清单来源 mutationDiffFiles
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] ConditionalExpression
bin/src/commands/test-execution.ts:241:7
     ? detectResult.plan.filter((entry) => entry.framework === options.framework)
     : detectResult.plan;
 
-  if (planEntries.length === 0) {
+  if (true) {
     console.log(`No plan entries found for framework "${options.framework}"`);
     return 0;
killedBy: runTestExecution -- 正向 (AC-1) 应对 plan 中每个 framework 调用 executePlanEntry
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] BlockStatement
bin/src/commands/test-execution.ts:241:33
     ? detectResult.plan.filter((entry) => entry.framework === options.framework)
     : detectResult.plan;
 
-  if (planEntries.length === 0) {
-    console.log(`No plan entries found for framework "${options.framework}"`);
-    return 0;
-  }
+  if (planEntries.length === 0) {}
 
   const mutationDiffFiles = resolveMutationDiffFiles(
killedBy: runTestExecution — 无配置 / framework 过滤 --framework 无匹配：日志含 No plan entries found for framework "…"；返回 0
statusReason: Cannot read properties of undefined (reading 'conclusion')

[Killed] ArrayDeclaration
bin/src/commands/test-execution.ts:252:22
     projectRoot,
   );
   const reportsDir = resolveReportsDir(projectRoot, options.change);
-  const subReports = [];
+  const subReports = ["Stryker was here"];
 
   for (const entry of planEntries) {
killedBy: CLI 新报告布局 — 无 change 无 change：写入 reports/test/summary.json 与 reports/test/vitest/report.json
statusReason: Cannot read properties of undefined (reading 'total')

[Killed] BlockStatement
bin/src/commands/test-execution.ts:254:36
   const reportsDir = resolveReportsDir(projectRoot, options.change);
   const subReports = [];
 
-  for (const entry of planEntries) {
-    const subReport = runPlanEntry(entry, projectRoot, options, mutationDiffFiles, reportsDir);
-    if (subReport) {
-      subReports.push(subReport);
-    }
-  }
+  for (const entry of planEntries) {}
 
   const summaryReport = generateSummaryReport(subReports, projectRoot, reportsDir);
killedBy: runTestExecution -- 正向 (AC-1) 应对 plan 中每个 framework 调用 executePlanEntry
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] ConditionalExpression
bin/src/commands/test-execution.ts:256:9
 
   for (const entry of planEntries) {
     const subReport = runPlanEntry(entry, projectRoot, options, mutationDiffFiles, reportsDir);
-    if (subReport) {
+    if (false) {
       subReports.push(subReport);
     }
killedBy: CLI 新报告布局 — 无 change 无 change：写入 reports/test/summary.json 与 reports/test/vitest/report.json
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
bin/src/commands/test-execution.ts:256:20
 
   for (const entry of planEntries) {
     const subReport = runPlanEntry(entry, projectRoot, options, mutationDiffFiles, reportsDir);
-    if (subReport) {
-      subReports.push(subReport);
-    }
+    if (subReport) {}
   }
 
killedBy: CLI 新报告布局 — 无 change 无 change：写入 reports/test/summary.json 与 reports/test/vitest/report.json
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
bin/src/commands/test-execution.ts:264:10
   const summaryReport = generateSummaryReport(subReports, projectRoot, reportsDir);
   logSummary(summaryReport);
 
-  return summaryReport.conclusion === 'pass' ? 0 : 1;
+  return true ? 0 : 1;
 }
 
killedBy: runTestExecution -- 异常 某个 framework 执行失败不阻塞后续 framework
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
bin/src/commands/test-execution.ts:264:10
   const summaryReport = generateSummaryReport(subReports, projectRoot, reportsDir);
   logSummary(summaryReport);
 
-  return summaryReport.conclusion === 'pass' ? 0 : 1;
+  return false ? 0 : 1;
 }
 
killedBy: runTestExecution -- 正向 (AC-1) 应调用 runTestDetectFrameworks 获取 plan
statusReason: expected 1 to be +0 // Object.is equality
