[Killed] BlockStatement
bin/src/commands/sweep-phase.ts:22:50
  * then archive the bound change's leftover `active_phase` when present. An
  * unbound session (or a missing binding) is a no-op.
  */
-function sweepPhaseEvent(stdinRaw: string): void {
-  if (!stdinRaw || !stdinRaw.trim()) return;
-
-  let parsed: unknown;
-  try {
-    parsed = JSON.parse(stdinRaw);
-  } catch {
-    return;
-  }
-  if (!isPlainObject(parsed)) return;
-
-  const sessionId = typeof parsed.session_id === 'string' ? parsed.session_id : undefined;
-  if (!sessionId) return;
-
-  const projectRoot = getProjectDir();
-  const change = lookupChange(projectRoot, sessionId);
-  if (!change) return;
-
-  const changeDir = resolveChangeDir(change, projectRoot);
-  if (interruptActivePhase(changeDir)) {
-    process.stderr.write(
-      `sweep-phase: change "${change}" 的遗留 active_phase 已归档至 interrupted\n`,
-    );
-  }
-}
+function sweepPhaseEvent(stdinRaw: string): void {}
 
 /**
killedBy: 场景: sweep 中断归档与竞争防护 正向: 遗留 active_phase → interrupted[] 追加一条 {phase, attempt, start_at, end_at}、active_phase 清空、eval 不变
statusReason: expected { Object (phase, attempt, ...) } to be null

[Killed] BooleanLiteral
bin/src/commands/sweep-phase.ts:23:7
  * unbound session (or a missing binding) is a no-op.
  */
 function sweepPhaseEvent(stdinRaw: string): void {
-  if (!stdinRaw || !stdinRaw.trim()) return;
+  if (stdinRaw || !stdinRaw.trim()) return;
 
   let parsed: unknown;
killedBy: 场景: sweep 中断归档与竞争防护 正向: 遗留 active_phase → interrupted[] 追加一条 {phase, attempt, start_at, end_at}、active_phase 清空、eval 不变
statusReason: expected { Object (phase, attempt, ...) } to be null

[Killed] BooleanLiteral
bin/src/commands/sweep-phase.ts:23:20
  * unbound session (or a missing binding) is a no-op.
  */
 function sweepPhaseEvent(stdinRaw: string): void {
-  if (!stdinRaw || !stdinRaw.trim()) return;
+  if (!stdinRaw || stdinRaw.trim()) return;
 
   let parsed: unknown;
killedBy: 场景: sweep 中断归档与竞争防护 正向: 遗留 active_phase → interrupted[] 追加一条 {phase, attempt, start_at, end_at}、active_phase 清空、eval 不变
statusReason: expected { Object (phase, attempt, ...) } to be null

[Killed] BooleanLiteral
bin/src/commands/sweep-phase.ts:31:7
   } catch {
     return;
   }
-  if (!isPlainObject(parsed)) return;
+  if (isPlainObject(parsed)) return;
 
   const sessionId = typeof parsed.session_id === 'string' ? parsed.session_id : undefined;
killedBy: 场景: sweep 中断归档与竞争防护 正向: 遗留 active_phase → interrupted[] 追加一条 {phase, attempt, start_at, end_at}、active_phase 清空、eval 不变
statusReason: expected { Object (phase, attempt, ...) } to be null

[Killed] ConditionalExpression
bin/src/commands/sweep-phase.ts:31:7
   } catch {
     return;
   }
-  if (!isPlainObject(parsed)) return;
+  if (true) return;
 
   const sessionId = typeof parsed.session_id === 'string' ? parsed.session_id : undefined;
killedBy: 场景: sweep 中断归档与竞争防护 正向: 遗留 active_phase → interrupted[] 追加一条 {phase, attempt, start_at, end_at}、active_phase 清空、eval 不变
statusReason: expected { Object (phase, attempt, ...) } to be null

[Killed] ConditionalExpression
bin/src/commands/sweep-phase.ts:33:21
   }
   if (!isPlainObject(parsed)) return;
 
-  const sessionId = typeof parsed.session_id === 'string' ? parsed.session_id : undefined;
+  const sessionId = false ? parsed.session_id : undefined;
   if (!sessionId) return;
 
killedBy: 场景: sweep 中断归档与竞争防护 正向: 遗留 active_phase → interrupted[] 追加一条 {phase, attempt, start_at, end_at}、active_phase 清空、eval 不变
statusReason: expected { Object (phase, attempt, ...) } to be null

[Killed] EqualityOperator
bin/src/commands/sweep-phase.ts:33:21
   }
   if (!isPlainObject(parsed)) return;
 
-  const sessionId = typeof parsed.session_id === 'string' ? parsed.session_id : undefined;
+  const sessionId = typeof parsed.session_id !== 'string' ? parsed.session_id : undefined;
   if (!sessionId) return;
 
killedBy: runSweepPhase — 正向 (AC-10) 绑定 change 有遗留 active_phase → 移入 interrupted[]（end_at 为当次时刻）并清空；eval 数组不变
statusReason: expected { Object (phase, attempt, ...) } to be null

[Killed] BooleanLiteral
bin/src/commands/sweep-phase.ts:34:7
   if (!isPlainObject(parsed)) return;
 
   const sessionId = typeof parsed.session_id === 'string' ? parsed.session_id : undefined;
-  if (!sessionId) return;
+  if (sessionId) return;
 
   const projectRoot = getProjectDir();
killedBy: runSweepPhase — 正向 (AC-10) 绑定 change 有遗留 active_phase → 移入 interrupted[]（end_at 为当次时刻）并清空；eval 数组不变
statusReason: expected { Object (phase, attempt, ...) } to be null

[Killed] ConditionalExpression
bin/src/commands/sweep-phase.ts:34:7
   if (!isPlainObject(parsed)) return;
 
   const sessionId = typeof parsed.session_id === 'string' ? parsed.session_id : undefined;
-  if (!sessionId) return;
+  if (true) return;
 
   const projectRoot = getProjectDir();
killedBy: 场景: sweep 中断归档与竞争防护 正向: 遗留 active_phase → interrupted[] 追加一条 {phase, attempt, start_at, end_at}、active_phase 清空、eval 不变
statusReason: expected { Object (phase, attempt, ...) } to be null

[Killed] ConditionalExpression
bin/src/commands/sweep-phase.ts:38:7
 
   const projectRoot = getProjectDir();
   const change = lookupChange(projectRoot, sessionId);
-  if (!change) return;
+  if (false) return;
 
   const changeDir = resolveChangeDir(change, projectRoot);
killedBy: runSweepPhase — 边界 session 未绑定 → 静默 no-op（stderr 无诊断），exit 0
statusReason: expected 'sweep-phase: The "paths[3]" argument …' to be '' // Object.is equality

[Killed] BooleanLiteral
bin/src/commands/sweep-phase.ts:38:7
 
   const projectRoot = getProjectDir();
   const change = lookupChange(projectRoot, sessionId);
-  if (!change) return;
+  if (change) return;
 
   const changeDir = resolveChangeDir(change, projectRoot);
killedBy: 场景: sweep 中断归档与竞争防护 正向: 遗留 active_phase → interrupted[] 追加一条 {phase, attempt, start_at, end_at}、active_phase 清空、eval 不变
statusReason: expected { Object (phase, attempt, ...) } to be null

[Killed] BlockStatement
bin/src/commands/sweep-phase.ts:41:40
   if (!change) return;
 
   const changeDir = resolveChangeDir(change, projectRoot);
-  if (interruptActivePhase(changeDir)) {
-    process.stderr.write(
-      `sweep-phase: change "${change}" 的遗留 active_phase 已归档至 interrupted\n`,
-    );
-  }
+  if (interruptActivePhase(changeDir)) {}
 }
 
killedBy: runSweepPhase — 正向 (AC-10) 绑定 change 有遗留 active_phase → 移入 interrupted[]（end_at 为当次时刻）并清空；eval 数组不变
statusReason: expected '' to contain 'sweep-phase'

[Killed] ConditionalExpression
bin/src/commands/sweep-phase.ts:41:7
   if (!change) return;
 
   const changeDir = resolveChangeDir(change, projectRoot);
-  if (interruptActivePhase(changeDir)) {
+  if (false) {
     process.stderr.write(
       `sweep-phase: change "${change}" 的遗留 active_phase 已归档至 interrupted\n`,
killedBy: 场景: sweep 中断归档与竞争防护 正向: 遗留 active_phase → interrupted[] 追加一条 {phase, attempt, start_at, end_at}、active_phase 清空、eval 不变
statusReason: expected { Object (phase, attempt, ...) } to be null

[Killed] BlockStatement
bin/src/commands/sweep-phase.ts:55:39
  * failure — is written to stderr only and the process exits 0: the sweep
  * MUST NOT block the user message.
  */
-export function runSweepPhase(): void {
-  let stdinRaw: string;
-  try {
-    stdinRaw = readFileSync(0, 'utf-8');
-  } catch {
-    return;
-  }
-  try {
-    sweepPhaseEvent(stdinRaw);
-  } catch (e: unknown) {
-    const message = e instanceof Error ? e.message : String(e);
-    process.stderr.write(`sweep-phase: ${message}\n`);
-  }
-}
+export function runSweepPhase(): void {}
 
killedBy: runSweepPhase — 正向 (AC-10) 绑定 change 有遗留 active_phase → 移入 interrupted[]（end_at 为当次时刻）并清空；eval 数组不变
statusReason: expected { Object (phase, attempt, ...) } to be null

[NoCoverage] BlockStatement
bin/src/commands/sweep-phase.ts:59:11
   let stdinRaw: string;
   try {
     stdinRaw = readFileSync(0, 'utf-8');
-  } catch {
-    return;
-  }
+  } catch {}
   try {
     sweepPhaseEvent(stdinRaw);

[Killed] BlockStatement
bin/src/commands/sweep-phase.ts:62:7
   } catch {
     return;
   }
-  try {
-    sweepPhaseEvent(stdinRaw);
-  } catch (e: unknown) {
+  try {} catch (e: unknown) {
     const message = e instanceof Error ? e.message : String(e);
     process.stderr.write(`sweep-phase: ${message}\n`);
killedBy: 场景: sweep 中断归档与竞争防护 正向: 遗留 active_phase → interrupted[] 追加一条 {phase, attempt, start_at, end_at}、active_phase 清空、eval 不变
statusReason: expected { Object (phase, attempt, ...) } to be null

[Killed] BlockStatement
bin/src/commands/sweep-phase.ts:64:24
   }
   try {
     sweepPhaseEvent(stdinRaw);
-  } catch (e: unknown) {
-    const message = e instanceof Error ? e.message : String(e);
-    process.stderr.write(`sweep-phase: ${message}\n`);
-  }
+  } catch (e: unknown) {}
 }
 
killedBy: runSweepPhase — 边界 绑定指向不存在的 change 目录 → 归档抛错被吞，stderr 诊断 + exit 0
statusReason: expected '' to contain 'sweep-phase'

[Killed] StringLiteral
bin/src/commands/sweep-phase.ts:66:26
     sweepPhaseEvent(stdinRaw);
   } catch (e: unknown) {
     const message = e instanceof Error ? e.message : String(e);
-    process.stderr.write(`sweep-phase: ${message}\n`);
+    process.stderr.write(``);
   }
 }
killedBy: runSweepPhase — 边界 绑定指向不存在的 change 目录 → 归档抛错被吞，stderr 诊断 + exit 0
statusReason: expected '' to contain 'sweep-phase'
