[Killed] BlockStatement
bin/src/lib/c4-cross-ref.ts:116:13
 function getChangedFiles(
   projectRoot: string,
   options: { staged?: boolean; files?: string[]; change?: string } = {},
-): string[] {
-  if (options.staged) {
-    throw new Error(
-      'staged 模式已由清单模式替代：请传 change（读取文件清单）或 files（显式文件列表）。',
-    );
-  }
-
-  if (options.files && options.files.length > 0) {
-    return options.files;
-  }
-
-  if (options.change) {
-    return deriveNetState(readFileLog(resolveChangeDir(options.change, projectRoot))).written;
-  }
-
-  return [];
-}
+): string[] {}
 
 /**
killedBy: runCrossRefCheck — early exit changedFiles 为空数组时应返回 no_changes
statusReason: files is not iterable

[Killed] BlockStatement
bin/src/lib/c4-cross-ref.ts:127:23
     return options.files;
   }
 
-  if (options.change) {
-    return deriveNetState(readFileLog(resolveChangeDir(options.change, projectRoot))).written;
-  }
+  if (options.change) {}
 
   return [];
killedBy: runCrossRefCheck — 清单模式与 staged 废弃 (AC-9) 传 change → 被查文件集 = files.written 直通（不做 test config 过滤），matched / unmatched_files 按模型映射产出 (AC-9)
statusReason: expected [] to deeply equal [ { element_id: 'Core', …(1) } ]
