[Survived] StringLiteral
bin/src/lib/workflow.ts:40:3
 /** Shared explore→proposal handoff lines (file-based; no inline EXPLORE_CONTEXT_SUMMARY). */
 const PROPOSAL_EXPLORE_HANDOFF =
   'If openspec/changes/<change>/explore.md exists, Read it as free-form explore context. ' +
-  'If proposal.md already exists, Read it and merge new explore insights (do not rewrite from scratch). ' +
+  "" +
   'Do not expect inline EXPLORE_CONTEXT_SUMMARY.';
 

[Killed] BlockStatement
bin/src/lib/workflow.ts:359:80
  * Return the prerequisite table for the given workflow_type.
  * Defaults to "requirement" if unknown.
  */
-function getPrerequisiteTable(workflowType?: string): Record<string, string[]> {
-  const key = (workflowType || DEFAULT_WORKFLOW).toLowerCase();
-  return PHASE_PREREQUISITES_TABLES[key] || PHASE_PREREQUISITES_TABLES[DEFAULT_WORKFLOW];
-}
+function getPrerequisiteTable(workflowType?: string): Record<string, string[]> {}
 
 /**
killedBy: markPhaseStale should mark latest pass entry stale and propagate downstream (AC-8)
statusReason: Cannot read properties of undefined (reading 'proposal')

[Killed] MethodExpression
bin/src/lib/workflow.ts:360:15
  * Defaults to "requirement" if unknown.
  */
 function getPrerequisiteTable(workflowType?: string): Record<string, string[]> {
-  const key = (workflowType || DEFAULT_WORKFLOW).toLowerCase();
+  const key = (workflowType || DEFAULT_WORKFLOW).toUpperCase();
   return PHASE_PREREQUISITES_TABLES[key] || PHASE_PREREQUISITES_TABLES[DEFAULT_WORKFLOW];
 }
killedBy: getDependents should return [code-analyze, test-design] for proposal in test-only (AC-5)
statusReason: expected [ 'test-design' ] to deeply equal [ 'code-analyze', 'test-design' ]

[Killed] ConditionalExpression
bin/src/lib/workflow.ts:360:16
  * Defaults to "requirement" if unknown.
  */
 function getPrerequisiteTable(workflowType?: string): Record<string, string[]> {
-  const key = (workflowType || DEFAULT_WORKFLOW).toLowerCase();
+  const key = (true).toLowerCase();
   return PHASE_PREREQUISITES_TABLES[key] || PHASE_PREREQUISITES_TABLES[DEFAULT_WORKFLOW];
 }
killedBy: markPhaseStale should mark latest pass entry stale and propagate downstream (AC-8)
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).toLowerCase is not a function

[Killed] LogicalOperator
bin/src/lib/workflow.ts:361:10
  */
 function getPrerequisiteTable(workflowType?: string): Record<string, string[]> {
   const key = (workflowType || DEFAULT_WORKFLOW).toLowerCase();
-  return PHASE_PREREQUISITES_TABLES[key] || PHASE_PREREQUISITES_TABLES[DEFAULT_WORKFLOW];
+  return PHASE_PREREQUISITES_TABLES[key] && PHASE_PREREQUISITES_TABLES[DEFAULT_WORKFLOW];
 }
 
killedBy: getDependents should fallback to requirement table for unknown workflowType (case-insensitive tolerant)
statusReason: Cannot read properties of undefined (reading 'proposal')

[Killed] ConditionalExpression
bin/src/lib/workflow.ts:361:10
  */
 function getPrerequisiteTable(workflowType?: string): Record<string, string[]> {
   const key = (workflowType || DEFAULT_WORKFLOW).toLowerCase();
-  return PHASE_PREREQUISITES_TABLES[key] || PHASE_PREREQUISITES_TABLES[DEFAULT_WORKFLOW];
+  return false;
 }
 
killedBy: getDependents should return [dev-design, test-design, acceptance] for proposal (AC-4)
statusReason: expected [] to deeply equal [ 'dev-design', 'test-design', …(1) ]

[Killed] BlockStatement
bin/src/lib/workflow.ts:371:77
  * - Returns an empty array for unknown phase IDs (fault-tolerant).
  * - Defaults to "requirement" workflow_type.
  */
-function getPrerequisites(phaseId: string, workflowType?: string): string[] {
-  const table = getPrerequisiteTable(workflowType);
-  return table[phaseId] || [];
-}
+function getPrerequisites(phaseId: string, workflowType?: string): string[] {}
 
 /**
killedBy: markPhaseStale should mark latest pass entry stale and propagate downstream (AC-8)
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] ConditionalExpression
bin/src/lib/workflow.ts:373:10
  */
 function getPrerequisites(phaseId: string, workflowType?: string): string[] {
   const table = getPrerequisiteTable(workflowType);
-  return table[phaseId] || [];
+  return true;
 }
 
killedBy: getDependents should return [dev-design, test-design, acceptance] for proposal (AC-4)
statusReason: prereqs.includes is not a function

[Killed] ConditionalExpression
bin/src/lib/workflow.ts:373:10
  */
 function getPrerequisites(phaseId: string, workflowType?: string): string[] {
   const table = getPrerequisiteTable(workflowType);
-  return table[phaseId] || [];
+  return false;
 }
 
killedBy: getDependents should return [dev-design, test-design, acceptance] for proposal (AC-4)
statusReason: prereqs.includes is not a function

[Killed] BlockStatement
bin/src/lib/workflow.ts:387:80
  * - Returns an empty array for unknown phase IDs (fault-tolerant).
  * - Defaults to "requirement" workflow_type.
  */
-export function getDependents(phaseId: string, workflowType: string): string[] {
-  const table = getPhaseTable(workflowType);
-  return table
-    .filter((p) => {
-      const prereqs = getPrerequisites(p.id, workflowType);
-      return prereqs.includes(phaseId);
-    })
-    .map((p) => p.id);
-}
+export function getDependents(phaseId: string, workflowType: string): string[] {}
 
 // ---------------------------------------------------------------------------
killedBy: getDependents should return [dev-design, test-design, acceptance] for proposal (AC-4)
statusReason: expected undefined to deeply equal [ 'dev-design', 'test-design', …(1) ]

[Killed] MethodExpression
bin/src/lib/workflow.ts:389:10
  */
 export function getDependents(phaseId: string, workflowType: string): string[] {
   const table = getPhaseTable(workflowType);
-  return table
-    .filter((p) => {
-      const prereqs = getPrerequisites(p.id, workflowType);
-      return prereqs.includes(phaseId);
-    })
+  return table
     .map((p) => p.id);
 }
killedBy: markPhaseStale should mark latest pass entry stale and propagate downstream (AC-8)
statusReason: expected true to be undefined

[Killed] BlockStatement
bin/src/lib/workflow.ts:390:20
 export function getDependents(phaseId: string, workflowType: string): string[] {
   const table = getPhaseTable(workflowType);
   return table
-    .filter((p) => {
-      const prereqs = getPrerequisites(p.id, workflowType);
-      return prereqs.includes(phaseId);
-    })
+    .filter((p) => {})
     .map((p) => p.id);
 }
killedBy: markPhaseStale should mark latest pass entry stale and propagate downstream (AC-8)
statusReason: expected undefined to be true // Object.is equality

[Killed] ArrowFunction
bin/src/lib/workflow.ts:394:10
       const prereqs = getPrerequisites(p.id, workflowType);
       return prereqs.includes(phaseId);
     })
-    .map((p) => p.id);
+    .map(() => undefined);
 }
 
killedBy: markPhaseStale should mark latest pass entry stale and propagate downstream (AC-8)
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
bin/src/lib/workflow.ts:404:72
 /**
  * Return the phase table for the given workflow_type.
  */
-export function getPhaseTable(workflowType: string): PhaseDefinition[] {
-  const key = workflowType.toLowerCase();
-  return PHASE_TABLES[key] || PHASE_TABLES[DEFAULT_WORKFLOW];
-}
+export function getPhaseTable(workflowType: string): PhaseDefinition[] {}
 
 // ---------------------------------------------------------------------------
killedBy: record-files — 归账写清单（持久化观察点改造）(AC-2, AC-4, AC-13) 已绑定 session 的 Write 事件 file_path=src/foo.ts → 清单 written 含 src/foo.ts（相对项目根 POSIX 风格，读回真盘 workflow.json，AC-2）
statusReason: expected [] to deeply equal [ 'src/foo.ts' ]

[Killed] MethodExpression
bin/src/lib/workflow.ts:405:15
  * Return the phase table for the given workflow_type.
  */
 export function getPhaseTable(workflowType: string): PhaseDefinition[] {
-  const key = workflowType.toLowerCase();
+  const key = workflowType.toUpperCase();
   return PHASE_TABLES[key] || PHASE_TABLES[DEFAULT_WORKFLOW];
 }
killedBy: runPhaseNext — workflow_type should follow bug-fix phase table when workflow_type is bug-fix
statusReason: expected 8 to be 6 // Object.is equality

[Killed] LogicalOperator
bin/src/lib/workflow.ts:406:10
  */
 export function getPhaseTable(workflowType: string): PhaseDefinition[] {
   const key = workflowType.toLowerCase();
-  return PHASE_TABLES[key] || PHASE_TABLES[DEFAULT_WORKFLOW];
+  return PHASE_TABLES[key] && PHASE_TABLES[DEFAULT_WORKFLOW];
 }
 
killedBy: runChangeList — workflow_done (AC-6) workflow_type 为 bug-fix 时按 bug-fix phase table（6 阶段）计算 workflow_done
statusReason: expected [ 'proposal', 'dev-design', …(6) ] to deeply equal [ 'proposal', 'dev-design', …(4) ]

[Killed] ConditionalExpression
bin/src/lib/workflow.ts:406:10
  */
 export function getPhaseTable(workflowType: string): PhaseDefinition[] {
   const key = workflowType.toLowerCase();
-  return PHASE_TABLES[key] || PHASE_TABLES[DEFAULT_WORKFLOW];
+  return false;
 }
 
killedBy: markPhaseStale should mark latest pass entry stale and propagate downstream (AC-8)
statusReason: table.filter is not a function

[Killed] BlockStatement
bin/src/lib/workflow.ts:427:12
 export function hasPhasePassed(
   entries: ReadonlyArray<{ phase: string; verdict: string; skipped?: boolean; stale?: boolean }>,
   phaseId: string,
-): boolean {
-  return entries.some(
-    (e) => e.phase === phaseId && (e.verdict === 'pass' || e.skipped === true) && !e.stale,
-  );
-}
+): boolean {}
 
 const CALL_AGENT_TOKEN_PATTERN = /^__CALL_AGENT:([a-z0-9-]+)__$/;
killedBy: runPhaseNext — 评估存储来源 (AC-3, AC-5, AC-12) 仅有遗留 eval.json（proposal 非 stale pass）且 workflow.json 无 eval 键时返回 dev-design（与合并前一致，AC-3）
statusReason: expected 'proposal' to be 'dev-design' // Object.is equality

[Killed] MethodExpression
bin/src/lib/workflow.ts:428:10
   entries: ReadonlyArray<{ phase: string; verdict: string; skipped?: boolean; stale?: boolean }>,
   phaseId: string,
 ): boolean {
-  return entries.some(
-    (e) => e.phase === phaseId && (e.verdict === 'pass' || e.skipped === true) && !e.stale,
-  );
+  return entries.every(e => e.phase === phaseId && (e.verdict === 'pass' || e.skipped === true) && !e.stale);
 }
 
killedBy: runPhaseNext — 评估存储来源 (AC-3, AC-5, AC-12) workflow.json.eval 为 [] 且无遗留文件时按 requirement 返回 first run proposal（AC-3）
statusReason: expected null to be 'proposal' // Object.is equality

[Killed] ConditionalExpression
bin/src/lib/workflow.ts:429:36
   phaseId: string,
 ): boolean {
   return entries.some(
-    (e) => e.phase === phaseId && (e.verdict === 'pass' || e.skipped === true) && !e.stale,
+    (e) => e.phase === phaseId && (false || e.skipped === true) && !e.stale,
   );
 }
killedBy: runPhaseNext — 评估存储来源 (AC-3, AC-5, AC-12) 仅有遗留 eval.json（proposal 非 stale pass）且 workflow.json 无 eval 键时返回 dev-design（与合并前一致，AC-3）
statusReason: expected 'proposal' to be 'dev-design' // Object.is equality

[Killed] ConditionalExpression
bin/src/lib/workflow.ts:429:12
   phaseId: string,
 ): boolean {
   return entries.some(
-    (e) => e.phase === phaseId && (e.verdict === 'pass' || e.skipped === true) && !e.stale,
+    (e) => false,
   );
 }
killedBy: runPhaseNext — 评估存储来源 (AC-3, AC-5, AC-12) 仅有遗留 eval.json（proposal 非 stale pass）且 workflow.json 无 eval 键时返回 dev-design（与合并前一致，AC-3）
statusReason: expected 'proposal' to be 'dev-design' // Object.is equality

[Survived] Regex
bin/src/lib/workflow.ts:433:34
   );
 }
 
-const CALL_AGENT_TOKEN_PATTERN = /^__CALL_AGENT:([a-z0-9-]+)__$/;
+const CALL_AGENT_TOKEN_PATTERN = /^__CALL_AGENT:([a-z0-9-]+)__/;
 
 /**

[Survived] ArrayDeclaration
bin/src/lib/workflow.ts:440:29
  * (`build/env.ts`): plugin products use `dev-team:<id>`, the
  * cursor-home-image product uses `dev-team_<id>`.
  */
-const AGENT_NAME_PREFIXES = ['dev-team:', 'dev-team_'];
+const AGENT_NAME_PREFIXES = [];
 
 /**

[Killed] BlockStatement
bin/src/lib/workflow.ts:451:60
  *  Public gate-3 helper (design 公共函数表); consumed alongside
  * `matchesExecutorAgent`.
  */
-export function extractAgentName(agentRef: string): string {
-  const token = CALL_AGENT_TOKEN_PATTERN.exec(agentRef);
-  if (token) {
-    return token[1];
-  }
-  for (const prefix of AGENT_NAME_PREFIXES) {
-    if (agentRef.startsWith(prefix)) {
-      return agentRef.slice(prefix.length);
-    }
-  }
-  return agentRef;
-}
+export function extractAgentName(agentRef: string): string {}
 
 /**
killedBy: extractAgentName — 门③归一 正向：__CALL_AGENT:<id>__ token → <id>；dev-team:<id> / dev-team_<id> 前缀剥离 (AC-4)
statusReason: expected undefined to be 'proposal-planner' // Object.is equality

[Killed] ConditionalExpression
bin/src/lib/workflow.ts:453:7
  */
 export function extractAgentName(agentRef: string): string {
   const token = CALL_AGENT_TOKEN_PATTERN.exec(agentRef);
-  if (token) {
+  if (false) {
     return token[1];
   }
killedBy: record-files — 归账写清单（持久化观察点改造）(AC-2, AC-4, AC-13) 事件携带匹配 executor 的 agent_type → phase scope 记录（scope=phase、attempt=active_phase.attempt）；随后无 agent_type 的主会话事件 → workflow scope（AC-4 门③）
statusReason: expected { Object (op, scope, ...) } to match object { op: 'write', …(3) }
(1 matching property omitted from actual)

[Killed] BlockStatement
bin/src/lib/workflow.ts:453:14
  */
 export function extractAgentName(agentRef: string): string {
   const token = CALL_AGENT_TOKEN_PATTERN.exec(agentRef);
-  if (token) {
-    return token[1];
-  }
+  if (token) {}
   for (const prefix of AGENT_NAME_PREFIXES) {
     if (agentRef.startsWith(prefix)) {
killedBy: record-files — 归账写清单（持久化观察点改造）(AC-2, AC-4, AC-13) 事件携带匹配 executor 的 agent_type → phase scope 记录（scope=phase、attempt=active_phase.attempt）；随后无 agent_type 的主会话事件 → workflow scope（AC-4 门③）
statusReason: expected { Object (op, scope, ...) } to match object { op: 'write', …(3) }
(1 matching property omitted from actual)

[Killed] BlockStatement
bin/src/lib/workflow.ts:456:45
   if (token) {
     return token[1];
   }
-  for (const prefix of AGENT_NAME_PREFIXES) {
-    if (agentRef.startsWith(prefix)) {
-      return agentRef.slice(prefix.length);
-    }
-  }
+  for (const prefix of AGENT_NAME_PREFIXES) {}
   return agentRef;
 }
killedBy: extractAgentName — 门③归一 正向：__CALL_AGENT:<id>__ token → <id>；dev-team:<id> / dev-team_<id> 前缀剥离 (AC-4)
statusReason: expected 'dev-team:implementation-generator' to be 'implementation-generator' // Object.is equality

[Killed] MethodExpression
bin/src/lib/workflow.ts:457:9
     return token[1];
   }
   for (const prefix of AGENT_NAME_PREFIXES) {
-    if (agentRef.startsWith(prefix)) {
+    if (agentRef.endsWith(prefix)) {
       return agentRef.slice(prefix.length);
     }
killedBy: record-files — 归账写清单（持久化观察点改造）(AC-2, AC-4, AC-13) 事件携带匹配 executor 的 agent_type → phase scope 记录（scope=phase、attempt=active_phase.attempt）；随后无 agent_type 的主会话事件 → workflow scope（AC-4 门③）
statusReason: expected { Object (op, scope, ...) } to match object { op: 'write', …(3) }
(1 matching property omitted from actual)

[Killed] BlockStatement
bin/src/lib/workflow.ts:457:38
     return token[1];
   }
   for (const prefix of AGENT_NAME_PREFIXES) {
-    if (agentRef.startsWith(prefix)) {
-      return agentRef.slice(prefix.length);
-    }
+    if (agentRef.startsWith(prefix)) {}
   }
   return agentRef;
killedBy: record-files — 归账写清单（持久化观察点改造）(AC-2, AC-4, AC-13) 事件携带匹配 executor 的 agent_type → phase scope 记录（scope=phase、attempt=active_phase.attempt）；随后无 agent_type 的主会话事件 → workflow scope（AC-4 门③）
statusReason: expected { Object (op, scope, ...) } to match object { op: 'write', …(3) }
(1 matching property omitted from actual)

[Killed] MethodExpression
bin/src/lib/workflow.ts:458:14
   }
   for (const prefix of AGENT_NAME_PREFIXES) {
     if (agentRef.startsWith(prefix)) {
-      return agentRef.slice(prefix.length);
+      return agentRef;
     }
   }
killedBy: record-files — 归账写清单（持久化观察点改造）(AC-2, AC-4, AC-13) 事件携带匹配 executor 的 agent_type → phase scope 记录（scope=phase、attempt=active_phase.attempt）；随后无 agent_type 的主会话事件 → workflow scope（AC-4 门③）
statusReason: expected { Object (op, scope, ...) } to match object { op: 'write', …(3) }
(1 matching property omitted from actual)

[Killed] BlockStatement
bin/src/lib/workflow.ts:473:12
 export function matchesExecutorAgent(
   eventAgentType: string | undefined,
   executorAgentType: string | null | undefined,
-): boolean {
-  if (!eventAgentType || !executorAgentType) {
-    return false;
-  }
-  return extractAgentName(eventAgentType) === extractAgentName(executorAgentType);
-}
+): boolean {}
 
killedBy: matchesExecutorAgent — 门③判定 正向：dev-team:implementation-generator vs __CALL_AGENT:implementation-generator__ → true（跨平台产物形态归一相等）
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
bin/src/lib/workflow.ts:474:26
   eventAgentType: string | undefined,
   executorAgentType: string | null | undefined,
 ): boolean {
-  if (!eventAgentType || !executorAgentType) {
+  if (!eventAgentType || executorAgentType) {
     return false;
   }
killedBy: record-files — 归账写清单（持久化观察点改造）(AC-2, AC-4, AC-13) 事件携带匹配 executor 的 agent_type → phase scope 记录（scope=phase、attempt=active_phase.attempt）；随后无 agent_type 的主会话事件 → workflow scope（AC-4 门③）
statusReason: expected { Object (op, scope, ...) } to match object { op: 'write', …(3) }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
bin/src/lib/workflow.ts:474:7
   eventAgentType: string | undefined,
   executorAgentType: string | null | undefined,
 ): boolean {
-  if (!eventAgentType || !executorAgentType) {
+  if (false) {
     return false;
   }
killedBy: record-files — 归账写清单（持久化观察点改造）(AC-2, AC-4, AC-13) 已绑定 session 的 Write 事件 file_path=src/foo.ts → 清单 written 含 src/foo.ts（相对项目根 POSIX 风格，读回真盘 workflow.json，AC-2）
statusReason: expected [] to deeply equal [ 'src/foo.ts' ]

[Killed] BooleanLiteral
bin/src/lib/workflow.ts:475:12
   executorAgentType: string | null | undefined,
 ): boolean {
   if (!eventAgentType || !executorAgentType) {
-    return false;
+    return true;
   }
   return extractAgentName(eventAgentType) === extractAgentName(executorAgentType);
killedBy: matchesExecutorAgent — 门③判定 异常：任一为 undefined / null / 空串 → false（缺失不误判）
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
bin/src/lib/workflow.ts:477:10
   if (!eventAgentType || !executorAgentType) {
     return false;
   }
-  return extractAgentName(eventAgentType) === extractAgentName(executorAgentType);
+  return false;
 }
 
killedBy: matchesExecutorAgent — 门③判定 正向：dev-team:implementation-generator vs __CALL_AGENT:implementation-generator__ → true（跨平台产物形态归一相等）
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
bin/src/lib/workflow.ts:477:10
   if (!eventAgentType || !executorAgentType) {
     return false;
   }
-  return extractAgentName(eventAgentType) === extractAgentName(executorAgentType);
+  return extractAgentName(eventAgentType) !== extractAgentName(executorAgentType);
 }
 
killedBy: record-files — 归账写清单（持久化观察点改造）(AC-2, AC-4, AC-13) 事件携带匹配 executor 的 agent_type → phase scope 记录（scope=phase、attempt=active_phase.attempt）；随后无 agent_type 的主会话事件 → workflow scope（AC-4 门③）
statusReason: expected { Object (op, scope, ...) } to match object { op: 'write', …(3) }
(1 matching property omitted from actual)
