[Killed] BlockStatement
bin/src/commands/test-execution.ts:129:94
 /**
  * Resolve the mutation scope from the change file inventory.
  */
-function resolveMutationDiffFiles(change: string, projectRoot: string): string[] | undefined {
-  const changeDir = resolveChangeDir(change, projectRoot);
-  const written = deriveNetState(readFileLog(changeDir)).written;
-  const expanded = expandMutationDiffWithInferredSources(written);
-  const scoped = filterNetZeroFiles(expanded, projectRoot);
-  console.log(
-    `mutation scope (change inventory): ${scoped.length} files (${scoped.slice(0, 5).join(', ')})`,
-  );
-  return scoped.map((file) => path.resolve(projectRoot, file).replace(/\\/g, '/'));
-}
+function resolveMutationDiffFiles(change: string, projectRoot: string): string[] | undefined {}
 
 // ---------------------------------------------------------------------------
killedBy: 场景: 真实仓库去噪漏斗 正向: scope 恰为改写文件与 HEAD 缺席的新文件,net-zero 文件被剔除 (AC-7)
statusReason: Target cannot be null or undefined.

[Killed] ArrowFunction
bin/src/commands/test-execution.ts:148:27
   const testCases = result.testCases;
   console.log(
     `  ${entryFramework}: ${testCases.length} tests, ` +
-      `${testCases.filter((t) => t.status === 'passed').length} passed, ` +
+      `${testCases.filter(() => undefined).length} passed, ` +
       `${testCases.filter((t) => t.status === 'failed').length} failed, ` +
       `${testCases.filter((t) => t.status === 'skipped').length} skipped`,
killedBy: runTestExecution — logResult 状态计数文案 testCases：passed×2 + failed×1 + skipped×1 时 stdout 精确匹配 n tests / 2 passed / 1 failed / 1 skipped
statusReason: expected '  vitest: 4 tests, 0 passed, 1 failed…' to contain '2 passed'

[Killed] MethodExpression
bin/src/commands/test-execution.ts:148:10
   const testCases = result.testCases;
   console.log(
     `  ${entryFramework}: ${testCases.length} tests, ` +
-      `${testCases.filter((t) => t.status === 'passed').length} passed, ` +
+      `${testCases.length} passed, ` +
       `${testCases.filter((t) => t.status === 'failed').length} failed, ` +
       `${testCases.filter((t) => t.status === 'skipped').length} skipped`,
killedBy: runTestExecution — logResult 状态计数文案 testCases：passed×2 + failed×1 + skipped×1 时 stdout 精确匹配 n tests / 2 passed / 1 failed / 1 skipped
statusReason: expected '  vitest: 4 tests, 4 passed, 1 failed…' to contain '2 passed'

[Killed] MethodExpression
bin/src/commands/test-execution.ts:149:10
   console.log(
     `  ${entryFramework}: ${testCases.length} tests, ` +
       `${testCases.filter((t) => t.status === 'passed').length} passed, ` +
-      `${testCases.filter((t) => t.status === 'failed').length} failed, ` +
+      `${testCases.length} failed, ` +
       `${testCases.filter((t) => t.status === 'skipped').length} skipped`,
   );
killedBy: runTestExecution — logResult 状态计数文案 testCases：passed×2 + failed×1 + skipped×1 时 stdout 精确匹配 n tests / 2 passed / 1 failed / 1 skipped
statusReason: expected '  vitest: 4 tests, 2 passed, 4 failed…' to contain '1 failed'

[Killed] ConditionalExpression
bin/src/commands/test-execution.ts:150:34
     `  ${entryFramework}: ${testCases.length} tests, ` +
       `${testCases.filter((t) => t.status === 'passed').length} passed, ` +
       `${testCases.filter((t) => t.status === 'failed').length} failed, ` +
-      `${testCases.filter((t) => t.status === 'skipped').length} skipped`,
+      `${testCases.filter((t) => false).length} skipped`,
   );
 }
killedBy: runTestExecution — logResult 状态计数文案 testCases：passed×2 + failed×1 + skipped×1 时 stdout 精确匹配 n tests / 2 passed / 1 failed / 1 skipped
statusReason: expected '  vitest: 4 tests, 2 passed, 1 failed…' to contain '1 skipped'

[Killed] ConditionalExpression
bin/src/commands/test-execution.ts:150:34
     `  ${entryFramework}: ${testCases.length} tests, ` +
       `${testCases.filter((t) => t.status === 'passed').length} passed, ` +
       `${testCases.filter((t) => t.status === 'failed').length} failed, ` +
-      `${testCases.filter((t) => t.status === 'skipped').length} skipped`,
+      `${testCases.filter((t) => true).length} skipped`,
   );
 }
killedBy: runTestExecution — logResult 状态计数文案 testCases：passed×2 + failed×1 + skipped×1 时 stdout 精确匹配 n tests / 2 passed / 1 failed / 1 skipped
statusReason: expected '  vitest: 4 tests, 2 passed, 1 failed…' to contain '1 skipped'

[Killed] ConditionalExpression
bin/src/commands/test-execution.ts:170:7
   console.log(`  Skipped: ${report.skipped}`);
   console.log(`  Duration: ${report.duration_seconds}s`);
 
-  if (report.problems.length > 0) {
+  if (false) {
     console.log(`\nProblems (${report.problems.length}):`);
     for (const problem of report.problems) {
killedBy: runTestExecution — logSummary 文案 problems.length > 0 时打印 Problems (N):；problems: [] 时不得打印 Problems 块
statusReason: expected 'Running vitest tests in . (root: .)..…' to contain 'Problems (1):'

[Killed] ConditionalExpression
bin/src/commands/test-execution.ts:170:7
   console.log(`  Skipped: ${report.skipped}`);
   console.log(`  Duration: ${report.duration_seconds}s`);
 
-  if (report.problems.length > 0) {
+  if (true) {
     console.log(`\nProblems (${report.problems.length}):`);
     for (const problem of report.problems) {
killedBy: runTestExecution — logSummary 文案 conclusion: 'pass' 时 stdout 含 Summary: PASS 与 Total/Passed/Failed/Skipped/Duration 精确标签
statusReason: expected 'Running vitest tests in . (root: .)..…' not to contain 'Problems ('

[Killed] ConditionalExpression
bin/src/commands/test-execution.ts:194:38
   reportsDir: string,
 ): TestExecutionSubReport | null {
   const planFiles = resolvePlanFiles(options.files, entry);
-  if (options.files !== undefined && (planFiles?.length ?? 0) === 0) {
+  if (options.files !== undefined && true) {
     console.log(`Skipping ${entry.framework} in ${entry.root}: no files under suite root`);
     return null;
killedBy: runTestExecution — files 过滤与反推（清单 scope 下的路径处理） options.files 含 ../x.ts：传给 executePlanEntry 的 files 过滤掉 startsWith("..") 项
statusReason: expected "vi.fn()" to be called at least once

[Killed] EqualityOperator
bin/src/commands/test-execution.ts:194:7
   reportsDir: string,
 ): TestExecutionSubReport | null {
   const planFiles = resolvePlanFiles(options.files, entry);
-  if (options.files !== undefined && (planFiles?.length ?? 0) === 0) {
+  if (options.files === undefined && (planFiles?.length ?? 0) === 0) {
     console.log(`Skipping ${entry.framework} in ${entry.root}: no files under suite root`);
     return null;
killedBy: runTestExecution -- 正向 (AC-1) 应对 plan 中每个 framework 调用 executePlanEntry
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] StringLiteral
bin/src/commands/test-execution.ts:195:17
 ): TestExecutionSubReport | null {
   const planFiles = resolvePlanFiles(options.files, entry);
   if (options.files !== undefined && (planFiles?.length ?? 0) === 0) {
-    console.log(`Skipping ${entry.framework} in ${entry.root}: no files under suite root`);
+    console.log(``);
     return null;
   }
killedBy: runTestExecution — reportsDir 新布局 (AC-1) 显式 files 未命中某 suite root 时 skip，不回落全量执行
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
bin/src/commands/test-execution.ts:199:15
     return null;
   }
 
-  console.log(`Running ${entry.framework} tests in ${entry.cwd} (root: ${entry.root})...`);
+  console.log(``);
   const result = executePlanEntry(entry, projectRoot, {
     files: planFiles,

[Killed] ObjectLiteral
bin/src/commands/test-execution.ts:200:55
   }
 
   console.log(`Running ${entry.framework} tests in ${entry.cwd} (root: ${entry.root})...`);
-  const result = executePlanEntry(entry, projectRoot, {
-    files: planFiles,
-    noMutation: options.noMutation,
-    mutationDiffFiles,
-    reportsDir,
-  });
+  const result = executePlanEntry(entry, projectRoot, {});
   const subReport = generateSubReport(entry.framework, result, projectRoot, reportsDir, entry.root);
   logResult(entry.framework, result);
killedBy: runTestExecution -- noMutation 透传 TestExecutionOptions.noMutation 为 true 时透传到 executePlanEntry 的 options 中
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Object>, …(2) ]

Received:

  1st vi.fn() call:

  [
-   Any<Object>,

[Killed] LogicalOperator
bin/src/commands/test-execution.ts:216:23
 // ---------------------------------------------------------------------------
 
 export async function runTestExecution(options: TestExecutionOptions): Promise<number> {
-  const projectRoot = options.projectRoot || getProjectDir();
+  const projectRoot = options.projectRoot && getProjectDir();
   const detectResult = runTestDetectFrameworks({ files: options.files, projectRoot });
 
killedBy: runTestExecution -- 正向 (AC-1) 应调用 runTestDetectFrameworks 获取 plan
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] EqualityOperator
bin/src/commands/test-execution.ts:219:7
   const projectRoot = options.projectRoot || getProjectDir();
   const detectResult = runTestDetectFrameworks({ files: options.files, projectRoot });
 
-  if (detectResult.plan.length === 0) {
+  if (detectResult.plan.length !== 0) {
     console.log('No test configuration found. Configure tests in openspec/config.json');
     return 0;
killedBy: runTestExecution -- 正向 (AC-1) 应对 plan 中每个 framework 调用 executePlanEntry
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] EqualityOperator
bin/src/commands/test-execution.ts:225:43
   }
 
   const planEntries = options.framework
-    ? detectResult.plan.filter((entry) => entry.framework === options.framework)
+    ? detectResult.plan.filter((entry) => entry.framework !== options.framework)
     : detectResult.plan;
 
killedBy: runTestExecution — 清单突变 scope (AC-7) --framework 过滤时仅匹配的 framework 执行，且仍收到清单来源 mutationDiffFiles
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…}, …(2) ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] EqualityOperator
bin/src/commands/test-execution.ts:228:7
     ? detectResult.plan.filter((entry) => entry.framework === options.framework)
     : detectResult.plan;
 
-  if (planEntries.length === 0) {
+  if (planEntries.length !== 0) {
     console.log(`No plan entries found for framework "${options.framework}"`);
     return 0;
killedBy: runTestExecution -- 正向 (AC-1) 应对 plan 中每个 framework 调用 executePlanEntry
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] ConditionalExpression
bin/src/commands/test-execution.ts:234:5
   }
 
   const mutationDiffFiles =
-    options.change && !options.noMutation
+    true
       ? resolveMutationDiffFiles(options.change, projectRoot)
       : undefined;
killedBy: 场景: 入口与守卫 正向: noMutation 与 change 同传 → 惰性解析,旧 change 不误报且不限圈 (AC-7)
statusReason: workflow.json 缺少 file_log 字段 (C:\Users\wps\AppData\Local\Temp\mutation-scope-inventory-qVTtNu\openspec\changes\legacy\workflow.json)：该 change 创建于文件清单机制之前，请重建该 change（change_create）。

[Killed] ConditionalExpression
bin/src/commands/test-execution.ts:234:5
   }
 
   const mutationDiffFiles =
-    options.change && !options.noMutation
+    false
       ? resolveMutationDiffFiles(options.change, projectRoot)
       : undefined;
killedBy: runTestExecution — 清单突变 scope (AC-7) 传 change → readFileInventory(changeDir).written 经反推后作为 mutationDiffFiles 传入 executePlanEntry (AC-7)
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0
