[Killed] BlockStatement
modules/workflow/phase/phase-state.ts:33:72
  * running state. A missing/invalid `workflow.json` throws (the caller's
  * swallow policy decides what that means — the hook layers exit 0).
  */
-export function readActivePhase(changeDir: string): ActivePhase | null {
-  const doc = loadWorkflowDoc(changeDir);
-  const value = doc.active_phase;
-  if (value === undefined || value === null) {
-    return null;
-  }
-  // Schema-parse instead of a cast: `loadWorkflowDoc` already validated the
-  // document, so this never throws — it only narrows the raw value.
-  return activePhaseSchema.parse(value);
-}
+export function readActivePhase(changeDir: string): ActivePhase | null {}
 
 /**
killedBy: record-files — 归账写清单（持久化观察点改造）(AC-2, AC-4, AC-13) 已绑定 session 的 Write 事件 file_path=src/foo.ts → 清单 written 含 src/foo.ts（相对项目根 POSIX 风格，读回真盘 workflow.json，AC-2）
statusReason: expected [] to deeply equal [ 'src/foo.ts' ]

[Killed] EqualityOperator
modules/workflow/phase/phase-state.ts:36:30
 export function readActivePhase(changeDir: string): ActivePhase | null {
   const doc = loadWorkflowDoc(changeDir);
   const value = doc.active_phase;
-  if (value === undefined || value === null) {
+  if (value === undefined || value !== null) {
     return null;
   }
killedBy: 场景: 门控事件序列回放 正向: phase_next(绑定) → phase_start(开门) → executor 写 → 主 agent 写 → log 含 phase 条目与 workflow 条目各一条，workflow_type/created/未知键保留
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
modules/workflow/phase/phase-state.ts:36:7
 export function readActivePhase(changeDir: string): ActivePhase | null {
   const doc = loadWorkflowDoc(changeDir);
   const value = doc.active_phase;
-  if (value === undefined || value === null) {
+  if (true) {
     return null;
   }
killedBy: 场景: 门控事件序列回放 正向: phase_next(绑定) → phase_start(开门) → executor 写 → 主 agent 写 → log 含 phase 条目与 workflow 条目各一条，workflow_type/created/未知键保留
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
modules/workflow/phase/phase-state.ts:48:80
  * Write the running phase state (last-wins overwrite on re-entry); unknown
  * keys and every other field are preserved.
  */
-export function writeActivePhase(changeDir: string, active: ActivePhase): void {
-  const doc = loadWorkflowDoc(changeDir);
-  doc.active_phase = active;
-  saveWorkflowDoc(changeDir, doc);
-}
+export function writeActivePhase(changeDir: string, active: ActivePhase): void {}
 
 /**
killedBy: 场景: 门控事件序列回放 正向: phase_next(绑定) → phase_start(开门) → executor 写 → 主 agent 写 → log 含 phase 条目与 workflow 条目各一条，workflow_type/created/未知键保留
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
modules/workflow/phase/phase-state.ts:59:59
  * archiving — used by `phase_log` after the entry has landed. `interrupted`
  * is untouched.
  */
-export function clearActivePhase(changeDir: string): void {
-  const doc = loadWorkflowDoc(changeDir);
-  doc.active_phase = null;
-  saveWorkflowDoc(changeDir, doc);
-}
+export function clearActivePhase(changeDir: string): void {}
 
 /**
killedBy: 场景: 门控事件序列回放 正向: phase_log 清场后同 session 再写 → log 不增长，stderr 含门②诊断，exit 0
statusReason: expected { Object (phase, attempt, ...) } to be null

[Killed] BlockStatement
modules/workflow/phase/phase-state.ts:71:84
  * to now) and clear the running state. Never writes eval entries (the sweep
  * must not burn retry quota). Returns whether an archive happened.
  */
-export function interruptActivePhase(changeDir: string, endedAt?: string): boolean {
-  const doc = loadWorkflowDoc(changeDir);
-  const value = doc.active_phase;
-  if (value === undefined || value === null) {
-    return false;
-  }
-  const active = activePhaseSchema.parse(value);
-  const entry: InterruptedPhase = {
-    ...active,
-    end_at: endedAt ?? new Date().toISOString(),
-  };
-  // Schema-parse instead of a cast (same rationale as `readActivePhase`).
-  const interrupted = interruptedEntrySchema
-    .array()
-    .parse(Array.isArray(doc.interrupted) ? doc.interrupted : []);
-  interrupted.push(entry);
-  doc.interrupted = interrupted;
-  doc.active_phase = null;
-  saveWorkflowDoc(changeDir, doc);
-  return true;
-}
+export function interruptActivePhase(changeDir: string, endedAt?: string): boolean {}
 
killedBy: 场景: sweep 中断归档与竞争防护 正向: 遗留 active_phase → interrupted[] 追加一条 {phase, attempt, start_at, end_at}、active_phase 清空、eval 不变
statusReason: expected { Object (phase, attempt, ...) } to be null

[Killed] BooleanLiteral
modules/workflow/phase/phase-state.ts:75:12
   const doc = loadWorkflowDoc(changeDir);
   const value = doc.active_phase;
   if (value === undefined || value === null) {
-    return false;
+    return true;
   }
   const active = activePhaseSchema.parse(value);
killedBy: interruptActivePhase 无遗留（active_phase 缺失 / null）→ 返回 false，文件逐字节不变
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
modules/workflow/phase/phase-state.ts:80:13
   const active = activePhaseSchema.parse(value);
   const entry: InterruptedPhase = {
     ...active,
-    end_at: endedAt ?? new Date().toISOString(),
+    end_at: endedAt && new Date().toISOString(),
   };
   // Schema-parse instead of a cast (same rationale as `readActivePhase`).
killedBy: 场景: sweep 中断归档与竞争防护 正向: 遗留 active_phase → interrupted[] 追加一条 {phase, attempt, start_at, end_at}、active_phase 清空、eval 不变
statusReason: expected [ { phase: 'implement', …(2) } ] to deeply equal [ { phase: 'implement', …(3) } ]

[Killed] BooleanLiteral
modules/workflow/phase/phase-state.ts:90:10
   doc.interrupted = interrupted;
   doc.active_phase = null;
   saveWorkflowDoc(changeDir, doc);
-  return true;
+  return false;
 }
 
killedBy: interruptActivePhase 有遗留 → 追加 {phase, attempt, start_at, end_at} 进 interrupted[] 并清空 active_phase，返回 true；显式 endedAt 时使用传入值
statusReason: expected false to be true // Object.is equality
