[Killed] BlockStatement
src/hooks/useChangeDetail.ts:19:21
   source: string,
   title: string,
   reason: string,
-): ArtifactEnvelope {
-  return {
-    kind,
-    version: 0,
-    title,
-    payload: null,
-    fallbackText: `${reason}（kind: ${kind} · source: ${source}）`,
-  };
-}
+): ArtifactEnvelope {}
 
 /** 单产物读取：read_artifact 返回空或失败时降级为 Fallback 信封，不阻断其余产物。 */
killedBy: ipc 管线：DTO 漂移与读取失败的降级兜底 单个 read_artifact reject 时该产物降级呈现且不阻断详情主体
statusReason: expected  to have a length of 3 but got +0

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/hooks/useChangeDetail.ts:34:30
   root: string,
   change: string,
   descriptor: ArtifactDescriptor,
-): Promise<ArtifactEnvelope> {
-  try {
-    const envelope = await invoke<ArtifactEnvelope | null>('read_artifact', {
-      root,
-      change,
-      kind: descriptor.kind,
-      source: descriptor.source,
-    });
-    if (envelope) return envelope;
-    return fallbackEnvelope(descriptor.kind, descriptor.source, descriptor.title, '产物读取失败');
-  } catch {
-    return fallbackEnvelope(descriptor.kind, descriptor.source, descriptor.title, '产物读取失败');
-  }
-}
+): Promise<ArtifactEnvelope> {}
 
 /**
killedBy: useChangeDetail：详情取数与产物信封同周期组装（AC-6 / AC-7） 详情返回产物清单后同一周期内逐个 invoke("read_artifact") 并组装信封
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/hooks/useChangeDetail.ts:35:7
   change: string,
   descriptor: ArtifactDescriptor,
 ): Promise<ArtifactEnvelope> {
-  try {
-    const envelope = await invoke<ArtifactEnvelope | null>('read_artifact', {
-      root,
-      change,
-      kind: descriptor.kind,
-      source: descriptor.source,
-    });
-    if (envelope) return envelope;
-    return fallbackEnvelope(descriptor.kind, descriptor.source, descriptor.title, '产物读取失败');
-  } catch {
+  try {} catch {
     return fallbackEnvelope(descriptor.kind, descriptor.source, descriptor.title, '产物读取失败');
   }
killedBy: ipc 管线：列表到详情与产物渲染 进入详情后 get_change_detail + N 次 read_artifact 的调用序列与产物清单一致
statusReason: Unable to find an element with the text: 提案正文. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ObjectLiteral
src/hooks/useChangeDetail.ts:36:77
   descriptor: ArtifactDescriptor,
 ): Promise<ArtifactEnvelope> {
   try {
-    const envelope = await invoke<ArtifactEnvelope | null>('read_artifact', {
-      root,
-      change,
-      kind: descriptor.kind,
-      source: descriptor.source,
-    });
+    const envelope = await invoke<ArtifactEnvelope | null>('read_artifact', {});
     if (envelope) return envelope;
     return fallbackEnvelope(descriptor.kind, descriptor.source, descriptor.title, '产物读取失败');
killedBy: ipc 管线：列表到详情与产物渲染 进入详情后 get_change_detail + N 次 read_artifact 的调用序列与产物清单一致
statusReason: Unable to find an element with the text: 提案正文. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <header
      class="app-header"
    >

[Killed] ConditionalExpression
src/hooks/useChangeDetail.ts:42:9
       kind: descriptor.kind,
       source: descriptor.source,
     });
-    if (envelope) return envelope;
+    if (false) return envelope;
     return fallbackEnvelope(descriptor.kind, descriptor.source, descriptor.title, '产物读取失败');
   } catch {
killedBy: useChangeDetail：详情取数与产物信封同周期组装（AC-6 / AC-7） 详情返回产物清单后同一周期内逐个 invoke("read_artifact") 并组装信封
statusReason: expected '产物读取失败（kind: markdown-doc · source: p…' to be '保底：提案' // Object.is equality

[Killed] ConditionalExpression
src/hooks/useChangeDetail.ts:42:9
       kind: descriptor.kind,
       source: descriptor.source,
     });
-    if (envelope) return envelope;
+    if (true) return envelope;
     return fallbackEnvelope(descriptor.kind, descriptor.source, descriptor.title, '产物读取失败');
   } catch {
killedBy: useChangeDetail：加载态、降级信封、错误路径与刷新竞态 read_artifact 返回 null（非 reject）时该产物降级为 Fallback 信封
statusReason: Cannot read properties of null (reading 'kind')

[Killed] BlockStatement
src/hooks/useChangeDetail.ts:44:11
     });
     if (envelope) return envelope;
     return fallbackEnvelope(descriptor.kind, descriptor.source, descriptor.title, '产物读取失败');
-  } catch {
-    return fallbackEnvelope(descriptor.kind, descriptor.source, descriptor.title, '产物读取失败');
-  }
+  } catch {}
 }
 
killedBy: ipc 管线：DTO 漂移与读取失败的降级兜底 单个 read_artifact reject 时该产物降级呈现且不阻断详情主体
statusReason: expected  to have a length of 3 but got +0

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] StringLiteral
src/hooks/useChangeDetail.ts:45:83
     if (envelope) return envelope;
     return fallbackEnvelope(descriptor.kind, descriptor.source, descriptor.title, '产物读取失败');
   } catch {
-    return fallbackEnvelope(descriptor.kind, descriptor.source, descriptor.title, '产物读取失败');
+    return fallbackEnvelope(descriptor.kind, descriptor.source, descriptor.title, "");
   }
 }
killedBy: useChangeDetail：详情取数与产物信封同周期组装（AC-6 / AC-7） 单个 read_artifact reject 时该产物以 Fallback 形态呈现，其余正常组装
statusReason: expected '（kind: tasks-progress · source: tasks…' to contain '产物读取失败'

[Killed] ArrayDeclaration
src/hooks/useChangeDetail.ts:56:66
  */
 export function useChangeDetail(root: string | null, change: string | null): ChangeDetailState {
   const [detail, setDetail] = useState<ChangeDetail | null>(null);
-  const [artifacts, setArtifacts] = useState<ArtifactEnvelope[]>([]);
+  const [artifacts, setArtifacts] = useState<ArtifactEnvelope[]>(["Stryker was here"]);
   const [loading, setLoading] = useState(false);
   const [error, setError] = useState<string | null>(null);
killedBy: useChangeDetail：加载态、降级信封、错误路径与刷新竞态 挂载后请求未返回前 loading 置位且 artifacts 初始为空数组
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Survived] BooleanLiteral
src/hooks/useChangeDetail.ts:57:42
 export function useChangeDetail(root: string | null, change: string | null): ChangeDetailState {
   const [detail, setDetail] = useState<ChangeDetail | null>(null);
   const [artifacts, setArtifacts] = useState<ArtifactEnvelope[]>([]);
-  const [loading, setLoading] = useState(false);
+  const [loading, setLoading] = useState(true);
   const [error, setError] = useState<string | null>(null);
   const [tick, setTick] = useState(0);

[Killed] ArrowFunction
src/hooks/useChangeDetail.ts:61:31
   const [error, setError] = useState<string | null>(null);
   const [tick, setTick] = useState(0);
 
-  const refresh = useCallback(() => setTick((t) => t + 1), []);
+  const refresh = useCallback(() => undefined, []);
 
   useEffect(() => {
killedBy: useChangeDetail：加载态、降级信封、错误路径与刷新竞态 显式 refresh 触发重新拉取详情
statusReason: expected 1 to be 2 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ArrowFunction
src/hooks/useChangeDetail.ts:61:45
   const [error, setError] = useState<string | null>(null);
   const [tick, setTick] = useState(0);
 
-  const refresh = useCallback(() => setTick((t) => t + 1), []);
+  const refresh = useCallback(() => setTick(() => undefined), []);
 
   useEffect(() => {
killedBy: useChangeDetail：加载态、降级信封、错误路径与刷新竞态 显式 refresh 触发重新拉取详情
statusReason: expected 2 to be 3 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
src/hooks/useChangeDetail.ts:64:9
   const refresh = useCallback(() => setTick((t) => t + 1), []);
 
   useEffect(() => {
-    if (!root || !change) {
+    if (root || !change) {
       setDetail(null);
       setArtifacts([]);
killedBy: ipc 管线：列表到详情与产物渲染 进入详情后 get_change_detail + N 次 read_artifact 的调用序列与产物清单一致
statusReason: Unable to find an element with the text: 提案正文. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <header
      class="app-header"
    >

[Killed] LogicalOperator
src/hooks/useChangeDetail.ts:64:9
   const refresh = useCallback(() => setTick((t) => t + 1), []);
 
   useEffect(() => {
-    if (!root || !change) {
+    if (!root && !change) {
       setDetail(null);
       setArtifacts([]);
killedBy: useChangeDetail：详情取数与产物信封同周期组装（AC-6 / AC-7） change 为 null 时不发起任何 invoke
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] BooleanLiteral
src/hooks/useChangeDetail.ts:71:21
       setLoading(false);
       return;
     }
-    let cancelled = false;
+    let cancelled = true;
     setLoading(true);
     setError(null);
killedBy: useChangeDetail：详情取数与产物信封同周期组装（AC-6 / AC-7） refresh 触发 invoke("get_change_detail")，detail 更新
statusReason: expected null not to be null

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
src/hooks/useChangeDetail.ts:72:16
       return;
     }
     let cancelled = false;
-    setLoading(true);
+    setLoading(false);
     setError(null);
     invoke<ChangeDetail | null>('get_change_detail', { root, change })
killedBy: useChangeDetail：加载态、降级信封、错误路径与刷新竞态 挂载后请求未返回前 loading 置位且 artifacts 初始为空数组
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/hooks/useChangeDetail.ts:75:31
     setLoading(true);
     setError(null);
     invoke<ChangeDetail | null>('get_change_detail', { root, change })
-      .then(async (result) => {
-        if (cancelled) return;
-        if (!result) {
-          setDetail(null);
-          setArtifacts([]);
-          setLoading(false);
-          return;
-        }
-        setDetail(result);
-        const envelopes = await Promise.all(
-          result.artifacts.map((descriptor) => readArtifactSafe(root, change, descriptor)),
-        );
-        if (cancelled) return;
-        setArtifacts(envelopes);
-        setLoading(false);
-      })
+      .then(async (result) => {})
       .catch((err: unknown) => {
         if (cancelled) return;
killedBy: useChangeDetail：详情取数与产物信封同周期组装（AC-6 / AC-7） refresh 触发 invoke("get_change_detail")，detail 更新
statusReason: expected null not to be null

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/hooks/useChangeDetail.ts:76:13
     setError(null);
     invoke<ChangeDetail | null>('get_change_detail', { root, change })
       .then(async (result) => {
-        if (cancelled) return;
+        if (false) return;
         if (!result) {
           setDetail(null);
killedBy: useChangeDetail：加载态、降级信封、错误路径与刷新竞态 刷新后旧响应被丢弃：仅最后一次刷新的结果生效
statusReason: expected { name: 'add-feature', …(9) } to be null

[Killed] ConditionalExpression
src/hooks/useChangeDetail.ts:76:13
     setError(null);
     invoke<ChangeDetail | null>('get_change_detail', { root, change })
       .then(async (result) => {
-        if (cancelled) return;
+        if (true) return;
         if (!result) {
           setDetail(null);
killedBy: useChangeDetail：详情取数与产物信封同周期组装（AC-6 / AC-7） refresh 触发 invoke("get_change_detail")，detail 更新
statusReason: expected null not to be null

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/hooks/useChangeDetail.ts:77:13
     invoke<ChangeDetail | null>('get_change_detail', { root, change })
       .then(async (result) => {
         if (cancelled) return;
-        if (!result) {
+        if (true) {
           setDetail(null);
           setArtifacts([]);
killedBy: useChangeDetail：详情取数与产物信封同周期组装（AC-6 / AC-7） refresh 触发 invoke("get_change_detail")，detail 更新
statusReason: expected null not to be null

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/hooks/useChangeDetail.ts:77:22
     invoke<ChangeDetail | null>('get_change_detail', { root, change })
       .then(async (result) => {
         if (cancelled) return;
-        if (!result) {
-          setDetail(null);
-          setArtifacts([]);
-          setLoading(false);
-          return;
-        }
+        if (!result) {}
         setDetail(result);
         const envelopes = await Promise.all(
killedBy: useChangeDetail：详情取数与产物信封同周期组装（AC-6 / AC-7） get_change_detail 返回 null 时 detail 为 null 且不发起任何 read_artifact
statusReason: expected 'TypeError: Cannot read properties of …' to be null

[Killed] BooleanLiteral
src/hooks/useChangeDetail.ts:80:22
         if (!result) {
           setDetail(null);
           setArtifacts([]);
-          setLoading(false);
+          setLoading(true);
           return;
         }
killedBy: useChangeDetail：详情取数与产物信封同周期组装（AC-6 / AC-7） get_change_detail 返回 null 时 detail 为 null 且不发起任何 read_artifact
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ArrowFunction
src/hooks/useChangeDetail.ts:85:32
         }
         setDetail(result);
         const envelopes = await Promise.all(
-          result.artifacts.map((descriptor) => readArtifactSafe(root, change, descriptor)),
+          result.artifacts.map(() => undefined),
         );
         if (cancelled) return;
killedBy: ipc 管线：列表到详情与产物渲染 进入详情后 get_change_detail + N 次 read_artifact 的调用序列与产物清单一致
statusReason: Unable to find an element with the text: 提案正文. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/hooks/useChangeDetail.ts:87:13
         const envelopes = await Promise.all(
           result.artifacts.map((descriptor) => readArtifactSafe(root, change, descriptor)),
         );
-        if (cancelled) return;
+        if (false) return;
         setArtifacts(envelopes);
         setLoading(false);
killedBy: useChangeDetail：加载态、降级信封、错误路径与刷新竞态 刷新后旧响应的产物读取结果同样被丢弃
statusReason: expected [ { kind: 'tasks-progress', …(4) } ] to deeply equal []

[Killed] ConditionalExpression
src/hooks/useChangeDetail.ts:87:13
         const envelopes = await Promise.all(
           result.artifacts.map((descriptor) => readArtifactSafe(root, change, descriptor)),
         );
-        if (cancelled) return;
+        if (true) return;
         setArtifacts(envelopes);
         setLoading(false);
killedBy: useChangeDetail：详情取数与产物信封同周期组装（AC-6 / AC-7） refresh 触发 invoke("get_change_detail")，detail 更新
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/hooks/useChangeDetail.ts:89:20
         );
         if (cancelled) return;
         setArtifacts(envelopes);
-        setLoading(false);
+        setLoading(true);
       })
       .catch((err: unknown) => {
killedBy: useChangeDetail：详情取数与产物信封同周期组装（AC-6 / AC-7） refresh 触发 invoke("get_change_detail")，detail 更新
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/hooks/useChangeDetail.ts:91:32
         setArtifacts(envelopes);
         setLoading(false);
       })
-      .catch((err: unknown) => {
-        if (cancelled) return;
-        setError(String(err));
-        setLoading(false);
-      });
+      .catch((err: unknown) => {});
     return () => {
       cancelled = true;
killedBy: useChangeDetail：加载态、降级信封、错误路径与刷新竞态 get_change_detail reject 时置错误态、清空数据并复位 loading
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/hooks/useChangeDetail.ts:92:13
         setLoading(false);
       })
       .catch((err: unknown) => {
-        if (cancelled) return;
+        if (true) return;
         setError(String(err));
         setLoading(false);
killedBy: useChangeDetail：加载态、降级信封、错误路径与刷新竞态 get_change_detail reject 时置错误态、清空数据并复位 loading
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/hooks/useChangeDetail.ts:92:13
         setLoading(false);
       })
       .catch((err: unknown) => {
-        if (cancelled) return;
+        if (false) return;
         setError(String(err));
         setLoading(false);
killedBy: useChangeDetail：加载态、降级信封、错误路径与刷新竞态 刷新后旧请求的失败（reject）同样被丢弃
statusReason: expected 'Error: 过期请求失败' to be null

[Killed] BooleanLiteral
src/hooks/useChangeDetail.ts:94:20
       .catch((err: unknown) => {
         if (cancelled) return;
         setError(String(err));
-        setLoading(false);
+        setLoading(true);
       });
     return () => {
killedBy: useChangeDetail：加载态、降级信封、错误路径与刷新竞态 get_change_detail reject 时置错误态、清空数据并复位 loading
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/hooks/useChangeDetail.ts:96:18
         setError(String(err));
         setLoading(false);
       });
-    return () => {
-      cancelled = true;
-    };
+    return () => {};
   }, [root, change, tick]);
 
killedBy: useChangeDetail：加载态、降级信封、错误路径与刷新竞态 刷新后旧响应被丢弃：仅最后一次刷新的结果生效
statusReason: expected { name: 'add-feature', …(9) } to be null
