[Survived] BooleanLiteral
src/hooks/useChangeList.ts:19:42
  */
 export function useChangeList(root: string | null): ChangeListState {
   const [data, setData] = useState<ChangeList | null>(null);
-  const [loading, setLoading] = useState(false);
+  const [loading, setLoading] = useState(true);
   const [error, setError] = useState<string | null>(null);
   const [tick, setTick] = useState(0);

[Killed] BlockStatement
src/hooks/useChangeList.ts:25:19
 
   const refresh = useCallback(() => setTick((t) => t + 1), []);
 
-  useEffect(() => {
-    if (!root) {
-      setData(null);
-      setError(null);
-      setLoading(false);
-      return;
-    }
-    let cancelled = false;
-    setLoading(true);
-    setError(null);
-    invoke<ChangeList>('list_changes', { root })
-      .then((result) => {
-        if (cancelled) return;
-        setData(result);
-        setLoading(false);
-      })
-      .catch((err: unknown) => {
-        if (cancelled) return;
-        setError(String(err));
-        setLoading(false);
-      });
-    return () => {
-      cancelled = true;
-    };
-  }, [root, tick]);
+  useEffect(() => {}, [root, tick]);
 
   return { data, loading, error, refresh };
killedBy: useChangeList：显式刷新取数纪律（AC-12） 选定 root / refresh 触发 invoke("list_changes")，成功后 data 更新
statusReason: expected null not to be null

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/hooks/useChangeList.ts:26:16
   const refresh = useCallback(() => setTick((t) => t + 1), []);
 
   useEffect(() => {
-    if (!root) {
-      setData(null);
-      setError(null);
-      setLoading(false);
-      return;
-    }
+    if (!root) {}
     let cancelled = false;
     setLoading(true);
killedBy: useChangeList：显式刷新取数纪律（AC-12） root 为 null 时不发起 invoke，data 为 null
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] BooleanLiteral
src/hooks/useChangeList.ts:26:9
   const refresh = useCallback(() => setTick((t) => t + 1), []);
 
   useEffect(() => {
-    if (!root) {
+    if (root) {
       setData(null);
       setError(null);
killedBy: useChangeList：显式刷新取数纪律（AC-12） root 为 null 时不发起 invoke，data 为 null
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] BlockStatement
src/hooks/useChangeList.ts:36:25
     setLoading(true);
     setError(null);
     invoke<ChangeList>('list_changes', { root })
-      .then((result) => {
-        if (cancelled) return;
-        setData(result);
-        setLoading(false);
-      })
+      .then((result) => {})
       .catch((err: unknown) => {
         if (cancelled) return;
killedBy: ipc 管线：选定 workspace 到列表渲染 选择目录后刷新：invoke 参数携带选定 root，列表渲染月分组且未知时间组置尾
statusReason: Unable to find an element with the text: add-feature. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <header
      class="app-header"
    >

[Killed] ConditionalExpression
src/hooks/useChangeList.ts:37:13
     setError(null);
     invoke<ChangeList>('list_changes', { root })
       .then((result) => {
-        if (cancelled) return;
+        if (true) return;
         setData(result);
         setLoading(false);
killedBy: useChangeList：显式刷新取数纪律（AC-12） 选定 root / refresh 触发 invoke("list_changes")，成功后 data 更新
statusReason: expected null not to be null

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Survived] ConditionalExpression
src/hooks/useChangeList.ts:37:13
     setError(null);
     invoke<ChangeList>('list_changes', { root })
       .then((result) => {
-        if (cancelled) return;
+        if (false) return;
         setData(result);
         setLoading(false);

[Killed] BooleanLiteral
src/hooks/useChangeList.ts:39:20
       .then((result) => {
         if (cancelled) return;
         setData(result);
-        setLoading(false);
+        setLoading(true);
       })
       .catch((err: unknown) => {
killedBy: useChangeList：显式刷新取数纪律（AC-12） 选定 root / refresh 触发 invoke("list_changes")，成功后 data 更新
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/hooks/useChangeList.ts:51:10
     };
   }, [root, tick]);
 
-  return { data, loading, error, refresh };
+  return {};
 }
 
killedBy: ipc 管线：选定 workspace 到列表渲染 选择目录后刷新：invoke 参数携带选定 root，列表渲染月分组且未知时间组置尾
statusReason: expected "vi.fn()" to be called with arguments: [ 'list_changes', { root: '/repo' } ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />
