[Killed] BlockStatement
src/renderers/ArtifactView.tsx:5:76
 import { resolveRenderer } from './registry';
 
 /** 信封路由组件：按 resolveRenderer(kind) 渲染单个 ArtifactEnvelope */
-export function ArtifactView({ envelope }: { envelope: ArtifactEnvelope }) {
-  const Renderer = resolveRenderer(envelope.kind);
-  return (
-    <section className="artifact-card">
-      <header>
-        <span className="badge badge-kind">{envelope.kind}</span>
-        <h3>{envelope.title}</h3>
-        <span className="artifact-version">v{envelope.version}</span>
-      </header>
-      <Renderer envelope={envelope} />
-    </section>
-  );
-}
+export function ArtifactView({ envelope }: { envelope: ArtifactEnvelope }) {}
 
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 v0 change（空流水线 + 纯文档产物清单）以纯文档形态呈现
statusReason: Unable to find an element with the text: v0 提案文档. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"
