[Killed] BlockStatement
src/renderers/TasksProgressRenderer.tsx:11:42
   pending?: unknown;
 }
 
-function countOf(value: unknown): number {
-  return typeof value === 'number' && Number.isFinite(value) && value >= 0 ? value : 0;
-}
+function countOf(value: unknown): number {}
 
 /** 类型守卫：以 payload 实际形状收窄，替代 as 断言（payload 契约为 unknown） */
killedBy: ipc 管线：列表到详情与产物渲染 三 kind 信封分别路由到对应 renderer 并渲染 payload
statusReason: Unable to find an element with the text: 25%. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <header
      class="app-header"
    >

[Killed] EqualityOperator
src/renderers/TasksProgressRenderer.tsx:12:65
 }
 
 function countOf(value: unknown): number {
-  return typeof value === 'number' && Number.isFinite(value) && value >= 0 ? value : 0;
+  return typeof value === 'number' && Number.isFinite(value) && value < 0 ? value : 0;
 }
 
killedBy: ipc 管线：列表到详情与产物渲染 三 kind 信封分别路由到对应 renderer 并渲染 payload
statusReason: Unable to find an element with the text: 25%. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <header
      class="app-header"
    >

[Killed] EqualityOperator
src/renderers/TasksProgressRenderer.tsx:12:10
 }
 
 function countOf(value: unknown): number {
-  return typeof value === 'number' && Number.isFinite(value) && value >= 0 ? value : 0;
+  return typeof value !== 'number' && Number.isFinite(value) && value >= 0 ? value : 0;
 }
 
killedBy: ipc 管线：列表到详情与产物渲染 三 kind 信封分别路由到对应 renderer 并渲染 payload
statusReason: Unable to find an element with the text: 25%. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <header
      class="app-header"
    >

[Killed] BlockStatement
src/renderers/TasksProgressRenderer.tsx:16:80
 }
 
 /** 类型守卫：以 payload 实际形状收窄，替代 as 断言（payload 契约为 unknown） */
-function isTasksProgressPayload(value: unknown): value is TasksProgressPayload {
-  return typeof value === 'object' && value !== null;
-}
+function isTasksProgressPayload(value: unknown): value is TasksProgressPayload {}
 
 /** tasks-progress renderer：total / done / pending 进度渲染 */
killedBy: ipc 管线：列表到详情与产物渲染 三 kind 信封分别路由到对应 renderer 并渲染 payload
statusReason: Unable to find an element with the text: 25%. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <header
      class="app-header"
    >

[Killed] ConditionalExpression
src/renderers/TasksProgressRenderer.tsx:17:10
 
 /** 类型守卫：以 payload 实际形状收窄，替代 as 断言（payload 契约为 unknown） */
 function isTasksProgressPayload(value: unknown): value is TasksProgressPayload {
-  return typeof value === 'object' && value !== null;
+  return false;
 }
 
killedBy: ipc 管线：列表到详情与产物渲染 三 kind 信封分别路由到对应 renderer 并渲染 payload
statusReason: Unable to find an element with the text: 25%. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <header
      class="app-header"
    >

[Killed] EqualityOperator
src/renderers/TasksProgressRenderer.tsx:17:39
 
 /** 类型守卫：以 payload 实际形状收窄，替代 as 断言（payload 契约为 unknown） */
 function isTasksProgressPayload(value: unknown): value is TasksProgressPayload {
-  return typeof value === 'object' && value !== null;
+  return typeof value === 'object' && value === null;
 }
 
killedBy: ipc 管线：列表到详情与产物渲染 三 kind 信封分别路由到对应 renderer 并渲染 payload
statusReason: Unable to find an element with the text: 25%. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <header
      class="app-header"
    >

[Killed] BlockStatement
src/renderers/TasksProgressRenderer.tsx:21:85
 }
 
 /** tasks-progress renderer：total / done / pending 进度渲染 */
-export function TasksProgressRenderer({ envelope }: { envelope: ArtifactEnvelope }) {
-  const payload = isTasksProgressPayload(envelope.payload) ? envelope.payload : undefined;
-  const total = countOf(payload?.total);
-  const done = countOf(payload?.done);
-  const pending = countOf(payload?.pending);
-  // total 为 0 时无进度可言，直接 0%
-  const percent = total > 0 ? Math.round((done / total) * 100) : 0;
-  return (
-    <div>
-      <div className="progress-track">
-        <div className="progress-fill" style={{ width: `${percent}%` }} />
-      </div>
-      <div className="progress-labels">
-        <span>{percent}%</span>
-        <span>已完成 {done}</span>
-        <span>待办 {pending}</span>
-        <span>共 {total}</span>
-      </div>
-    </div>
-  );
-}
+export function TasksProgressRenderer({ envelope }: { envelope: ArtifactEnvelope }) {}
 
killedBy: ipc 管线：列表到详情与产物渲染 三 kind 信封分别路由到对应 renderer 并渲染 payload
statusReason: Unable to find an element with the text: 25%. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <header
      class="app-header"
    >

[Killed] OptionalChaining
src/renderers/TasksProgressRenderer.tsx:23:25
 /** tasks-progress renderer：total / done / pending 进度渲染 */
 export function TasksProgressRenderer({ envelope }: { envelope: ArtifactEnvelope }) {
   const payload = isTasksProgressPayload(envelope.payload) ? envelope.payload : undefined;
-  const total = countOf(payload?.total);
+  const total = countOf(payload.total);
   const done = countOf(payload?.done);
   const pending = countOf(payload?.pending);
killedBy: ipc 管线：DTO 漂移与读取失败的降级兜底 单个 read_artifact reject 时该产物降级呈现且不阻断详情主体
statusReason: expected  to have a length of 3 but got +0

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] OptionalChaining
src/renderers/TasksProgressRenderer.tsx:24:24
 export function TasksProgressRenderer({ envelope }: { envelope: ArtifactEnvelope }) {
   const payload = isTasksProgressPayload(envelope.payload) ? envelope.payload : undefined;
   const total = countOf(payload?.total);
-  const done = countOf(payload?.done);
+  const done = countOf(payload.done);
   const pending = countOf(payload?.pending);
   // total 为 0 时无进度可言，直接 0%
killedBy: ipc 管线：DTO 漂移与读取失败的降级兜底 单个 read_artifact reject 时该产物降级呈现且不阻断详情主体
statusReason: expected  to have a length of 3 but got +0

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] OptionalChaining
src/renderers/TasksProgressRenderer.tsx:25:27
   const payload = isTasksProgressPayload(envelope.payload) ? envelope.payload : undefined;
   const total = countOf(payload?.total);
   const done = countOf(payload?.done);
-  const pending = countOf(payload?.pending);
+  const pending = countOf(payload.pending);
   // total 为 0 时无进度可言，直接 0%
   const percent = total > 0 ? Math.round((done / total) * 100) : 0;
killedBy: ipc 管线：DTO 漂移与读取失败的降级兜底 单个 read_artifact reject 时该产物降级呈现且不阻断详情主体
statusReason: expected  to have a length of 3 but got +0

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] EqualityOperator
src/renderers/TasksProgressRenderer.tsx:27:19
   const done = countOf(payload?.done);
   const pending = countOf(payload?.pending);
   // total 为 0 时无进度可言，直接 0%
-  const percent = total > 0 ? Math.round((done / total) * 100) : 0;
+  const percent = total >= 0 ? Math.round((done / total) * 100) : 0;
   return (
     <div>
killedBy: ipc 管线：DTO 漂移与读取失败的降级兜底 单个 read_artifact reject 时该产物降级呈现且不阻断详情主体
statusReason: expected 'Desktop Terminal/repo刷新列表切换 workspace…' to contain '0%'

[Killed] ArithmeticOperator
src/renderers/TasksProgressRenderer.tsx:27:43
   const done = countOf(payload?.done);
   const pending = countOf(payload?.pending);
   // total 为 0 时无进度可言，直接 0%
-  const percent = total > 0 ? Math.round((done / total) * 100) : 0;
+  const percent = total > 0 ? Math.round((done * total) * 100) : 0;
   return (
     <div>
killedBy: ipc 管线：列表到详情与产物渲染 三 kind 信封分别路由到对应 renderer 并渲染 payload
statusReason: Unable to find an element with the text: 25%. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <header
      class="app-header"
    >

[Killed] ObjectLiteral
src/renderers/TasksProgressRenderer.tsx:31:47
   return (
     <div>
       <div className="progress-track">
-        <div className="progress-fill" style={{ width: `${percent}%` }} />
+        <div className="progress-fill" style={{}} />
       </div>
       <div className="progress-labels">
killedBy: TasksProgressRenderer：total / done / pending 进度渲染 比例与计数一致地渲染进度
statusReason: expected '' to be '40%' // Object.is equality
