[Killed] BlockStatement
src/views/ChangeDetailView.tsx:5:75
 import { ArtifactView } from '../renderers/ArtifactView';
 import type { ArtifactEnvelope, AttemptRecord, ChangeDetail, PhaseEntry } from '../types/dto';
 
-function VerdictBadge({ verdict }: { verdict: AttemptRecord['verdict'] }) {
-  return <span className={`badge badge-${verdict === 'pass' ? 'pass' : 'fail'}`}>{verdict}</span>;
-}
+function VerdictBadge({ verdict }: { verdict: AttemptRecord['verdict'] }) {}
 
 function formatTime(value: string | null): string {
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 verdict 徽标按 pass / fail 呈现对应样式与文案
statusReason: expected undefined to be 'pass' // Object.is equality

[Killed] EqualityOperator
src/views/ChangeDetailView.tsx:6:42
 import type { ArtifactEnvelope, AttemptRecord, ChangeDetail, PhaseEntry } from '../types/dto';
 
 function VerdictBadge({ verdict }: { verdict: AttemptRecord['verdict'] }) {
-  return <span className={`badge badge-${verdict === 'pass' ? 'pass' : 'fail'}`}>{verdict}</span>;
+  return <span className={`badge badge-${verdict !== 'pass' ? 'pass' : 'fail'}`}>{verdict}</span>;
 }
 
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 verdict 徽标按 pass / fail 呈现对应样式与文案
statusReason: expected 'fail' to be 'pass' // Object.is equality

[Killed] ConditionalExpression
src/views/ChangeDetailView.tsx:6:42
 import type { ArtifactEnvelope, AttemptRecord, ChangeDetail, PhaseEntry } from '../types/dto';
 
 function VerdictBadge({ verdict }: { verdict: AttemptRecord['verdict'] }) {
-  return <span className={`badge badge-${verdict === 'pass' ? 'pass' : 'fail'}`}>{verdict}</span>;
+  return <span className={`badge badge-${true ? 'pass' : 'fail'}`}>{verdict}</span>;
 }
 
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 verdict 徽标按 pass / fail 呈现对应样式与文案
statusReason: expected undefined to be 'fail' // Object.is equality

[Killed] BlockStatement
src/views/ChangeDetailView.tsx:9:51
   return <span className={`badge badge-${verdict === 'pass' ? 'pass' : 'fail'}`}>{verdict}</span>;
 }
 
-function formatTime(value: string | null): string {
-  if (value === null) return '—';
-  return value;
-}
+function formatTime(value: string | null): string {}
 
 function Attempt({ record }: { record: AttemptRecord }) {
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 active_phase 存在时渲染运行中标示；backtrack_to / backtrack_reason 随条目展示
statusReason: Unable to find an element with the text: 运行中 · implement · attempt 2 · 2026-09-02T01:00:00Z. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"

[Killed] ConditionalExpression
src/views/ChangeDetailView.tsx:10:7
 }
 
 function formatTime(value: string | null): string {
-  if (value === null) return '—';
+  if (false) return '—';
   return value;
 }
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 中断留档区块渲染条目，空缺时间显示占位符
statusReason: expected '← 返回列表刷新详情add-featurev2进行中2026-09-01流…' to contain 'end: —'

[Killed] EqualityOperator
src/views/ChangeDetailView.tsx:10:7
 }
 
 function formatTime(value: string | null): string {
-  if (value === null) return '—';
+  if (value !== null) return '—';
   return value;
 }
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 active_phase 存在时渲染运行中标示；backtrack_to / backtrack_reason 随条目展示
statusReason: Unable to find an element with the text: 运行中 · implement · attempt 2 · 2026-09-02T01:00:00Z. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"

[Killed] ConditionalExpression
src/views/ChangeDetailView.tsx:18:10
   return (
     <div className="attempt">
       <div className="attempt-meta">
-        {record.attempt !== null ? <span>attempt {record.attempt}</span> : <span>attempt —</span>}
+        {false ? <span>attempt {record.attempt}</span> : <span>attempt —</span>}
         <VerdictBadge verdict={record.verdict} />
         {record.skipped && <span>skipped</span>}
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 attempt 编号缺失渲染占位符 attempt —，有编号渲染实际值
statusReason: expected '← 返回列表刷新详情add-featurev2进行中2026-09-01流…' to contain 'attempt 3'

[Killed] ConditionalExpression
src/views/ChangeDetailView.tsx:18:10
   return (
     <div className="attempt">
       <div className="attempt-meta">
-        {record.attempt !== null ? <span>attempt {record.attempt}</span> : <span>attempt —</span>}
+        {true ? <span>attempt {record.attempt}</span> : <span>attempt —</span>}
         <VerdictBadge verdict={record.verdict} />
         {record.skipped && <span>skipped</span>}
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 attempt 编号缺失渲染占位符 attempt —，有编号渲染实际值
statusReason: expected '← 返回列表刷新详情add-featurev2进行中2026-09-01流…' to contain 'attempt —'

[Killed] ConditionalExpression
src/views/ChangeDetailView.tsx:20:10
       <div className="attempt-meta">
         {record.attempt !== null ? <span>attempt {record.attempt}</span> : <span>attempt —</span>}
         <VerdictBadge verdict={record.verdict} />
-        {record.skipped && <span>skipped</span>}
+        {false}
         {record.stale && <span>stale</span>}
         {record.startAt !== null && <span>start: {formatTime(record.startAt)}</span>}
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 skipped / stale / start / at 标记仅在对应值存在时渲染
statusReason: expected '← 返回列表刷新详情add-featurev2进行中2026-09-01流…' to contain 'skipped'

[Killed] ConditionalExpression
src/views/ChangeDetailView.tsx:20:10
       <div className="attempt-meta">
         {record.attempt !== null ? <span>attempt {record.attempt}</span> : <span>attempt —</span>}
         <VerdictBadge verdict={record.verdict} />
-        {record.skipped && <span>skipped</span>}
+        {true}
         {record.stale && <span>stale</span>}
         {record.startAt !== null && <span>start: {formatTime(record.startAt)}</span>}
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 skipped / stale / start / at 标记仅在对应值存在时渲染
statusReason: expected '← 返回列表刷新详情add-featurev2进行中2026-09-01流…' to contain 'skipped'

[Killed] ConditionalExpression
src/views/ChangeDetailView.tsx:21:10
         {record.attempt !== null ? <span>attempt {record.attempt}</span> : <span>attempt —</span>}
         <VerdictBadge verdict={record.verdict} />
         {record.skipped && <span>skipped</span>}
-        {record.stale && <span>stale</span>}
+        {true}
         {record.startAt !== null && <span>start: {formatTime(record.startAt)}</span>}
         {record.timestamp !== null && <span>at: {formatTime(record.timestamp)}</span>}
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 active_phase 存在时渲染运行中标示；backtrack_to / backtrack_reason 随条目展示
statusReason: Unable to find an element with the text: stale. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"

[Killed] ConditionalExpression
src/views/ChangeDetailView.tsx:21:10
         {record.attempt !== null ? <span>attempt {record.attempt}</span> : <span>attempt —</span>}
         <VerdictBadge verdict={record.verdict} />
         {record.skipped && <span>skipped</span>}
-        {record.stale && <span>stale</span>}
+        {false}
         {record.startAt !== null && <span>start: {formatTime(record.startAt)}</span>}
         {record.timestamp !== null && <span>at: {formatTime(record.timestamp)}</span>}
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 active_phase 存在时渲染运行中标示；backtrack_to / backtrack_reason 随条目展示
statusReason: Unable to find an element with the text: stale. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"

[Killed] ConditionalExpression
src/views/ChangeDetailView.tsx:22:10
         <VerdictBadge verdict={record.verdict} />
         {record.skipped && <span>skipped</span>}
         {record.stale && <span>stale</span>}
-        {record.startAt !== null && <span>start: {formatTime(record.startAt)}</span>}
+        {true}
         {record.timestamp !== null && <span>at: {formatTime(record.timestamp)}</span>}
       </div>
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 skipped / stale / start / at 标记仅在对应值存在时渲染
statusReason: expected '← 返回列表刷新详情add-featurev2进行中2026-09-01流…' to contain 'start: 2026-09-01T00:00:00Z'

[Killed] ConditionalExpression
src/views/ChangeDetailView.tsx:22:10
         <VerdictBadge verdict={record.verdict} />
         {record.skipped && <span>skipped</span>}
         {record.stale && <span>stale</span>}
-        {record.startAt !== null && <span>start: {formatTime(record.startAt)}</span>}
+        {true && <span>start: {formatTime(record.startAt)}</span>}
         {record.timestamp !== null && <span>at: {formatTime(record.timestamp)}</span>}
       </div>
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 skipped / stale / start / at 标记仅在对应值存在时渲染
statusReason: expected '← 返回列表刷新详情add-featurev2进行中2026-09-01流…' not to contain 'start:'

[Killed] ConditionalExpression
src/views/ChangeDetailView.tsx:23:10
         {record.skipped && <span>skipped</span>}
         {record.stale && <span>stale</span>}
         {record.startAt !== null && <span>start: {formatTime(record.startAt)}</span>}
-        {record.timestamp !== null && <span>at: {formatTime(record.timestamp)}</span>}
+        {true}
       </div>
       <div className="report">{record.report}</div>
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 skipped / stale / start / at 标记仅在对应值存在时渲染
statusReason: expected '← 返回列表刷新详情add-featurev2进行中2026-09-01流…' to contain 'at: 2026-09-01T02:00:00Z'

[Killed] ConditionalExpression
src/views/ChangeDetailView.tsx:23:10
         {record.skipped && <span>skipped</span>}
         {record.stale && <span>stale</span>}
         {record.startAt !== null && <span>start: {formatTime(record.startAt)}</span>}
-        {record.timestamp !== null && <span>at: {formatTime(record.timestamp)}</span>}
+        {true && <span>at: {formatTime(record.timestamp)}</span>}
       </div>
       <div className="report">{record.report}</div>
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 skipped / stale / start / at 标记仅在对应值存在时渲染
statusReason: expected '← 返回列表刷新详情add-featurev2进行中2026-09-01流…' not to contain 'at:'

[Killed] EqualityOperator
src/views/ChangeDetailView.tsx:26:9
         {record.timestamp !== null && <span>at: {formatTime(record.timestamp)}</span>}
       </div>
       <div className="report">{record.report}</div>
-      {(record.backtrackTo !== null || record.backtrackReason !== null) && (
+      {(record.backtrackTo === null || record.backtrackReason !== null) && (
         <div className="backtrack">
           ↩ 回跳至 {record.backtrackTo ?? '?'}
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 backtrack 块按 to / reason 的四种组合形态渲染
statusReason: expected '← 返回列表刷新详情add-featurev2进行中2026-09-01流…' to contain '回跳至 proposal'

[Killed] ConditionalExpression
src/views/ChangeDetailView.tsx:26:8
         {record.timestamp !== null && <span>at: {formatTime(record.timestamp)}</span>}
       </div>
       <div className="report">{record.report}</div>
-      {(record.backtrackTo !== null || record.backtrackReason !== null) && (
-        <div className="backtrack">
-          ↩ 回跳至 {record.backtrackTo ?? '?'}
-          {record.backtrackReason !== null && `：${record.backtrackReason}`}
-        </div>
-      )}
+      {false}
       {record.checklist.length > 0 && (
         <ul className="checklist">
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 active_phase 存在时渲染运行中标示；backtrack_to / backtrack_reason 随条目展示
statusReason: Unable to find an element with the text: /回跳至 test-design/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"

[Killed] LogicalOperator
src/views/ChangeDetailView.tsx:28:18
       <div className="report">{record.report}</div>
       {(record.backtrackTo !== null || record.backtrackReason !== null) && (
         <div className="backtrack">
-          ↩ 回跳至 {record.backtrackTo ?? '?'}
+          ↩ 回跳至 {record.backtrackTo && '?'}
           {record.backtrackReason !== null && `：${record.backtrackReason}`}
         </div>
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 active_phase 存在时渲染运行中标示；backtrack_to / backtrack_reason 随条目展示
statusReason: Unable to find an element with the text: /回跳至 test-design/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"

[Killed] LogicalOperator
src/views/ChangeDetailView.tsx:29:12
       {(record.backtrackTo !== null || record.backtrackReason !== null) && (
         <div className="backtrack">
           ↩ 回跳至 {record.backtrackTo ?? '?'}
-          {record.backtrackReason !== null && `：${record.backtrackReason}`}
+          {record.backtrackReason !== null || `：${record.backtrackReason}`}
         </div>
       )}
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 active_phase 存在时渲染运行中标示；backtrack_to / backtrack_reason 随条目展示
statusReason: Unable to find an element with the text: /测试设计缺失/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"

[Killed] EqualityOperator
src/views/ChangeDetailView.tsx:29:12
       {(record.backtrackTo !== null || record.backtrackReason !== null) && (
         <div className="backtrack">
           ↩ 回跳至 {record.backtrackTo ?? '?'}
-          {record.backtrackReason !== null && `：${record.backtrackReason}`}
+          {record.backtrackReason === null && `：${record.backtrackReason}`}
         </div>
       )}
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 active_phase 存在时渲染运行中标示；backtrack_to / backtrack_reason 随条目展示
statusReason: Unable to find an element with the text: /测试设计缺失/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"

[Killed] EqualityOperator
src/views/ChangeDetailView.tsx:32:8
           {record.backtrackReason !== null && `：${record.backtrackReason}`}
         </div>
       )}
-      {record.checklist.length > 0 && (
+      {record.checklist.length <= 0 && (
         <ul className="checklist">
           {record.checklist.map((entry, index) => (
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 9 站流水线渲染 attempt 序列 / verdict / checklist 展开内容
statusReason: Unable to find an element with the text: 问题清晰. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"

[Killed] LogicalOperator
src/views/ChangeDetailView.tsx:32:8
           {record.backtrackReason !== null && `：${record.backtrackReason}`}
         </div>
       )}
-      {record.checklist.length > 0 && (
-        <ul className="checklist">
-          {record.checklist.map((entry, index) => (
-            <li key={index}>
-              <span className={`badge badge-${entry.pass ? 'pass' : 'fail'}`}>
-                {entry.pass ? 'pass' : 'fail'}
-              </span>
-              <div>
-                <div className="item-row">{entry.item}</div>
-                <div className="evidence">{entry.evidence}</div>
-              </div>
-            </li>
-          ))}
-        </ul>
-      )}
+      {record.checklist.length > 0 || <ul className="checklist">
+          {record.checklist.map((entry, index) => <li key={index}>
+              <span className={`badge badge-${entry.pass ? 'pass' : 'fail'}`}>
+                {entry.pass ? 'pass' : 'fail'}
+              </span>
+              <div>
+                <div className="item-row">{entry.item}</div>
+                <div className="evidence">{entry.evidence}</div>
+              </div>
+            </li>)}
+        </ul>}
     </div>
   );
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 9 站流水线渲染 attempt 序列 / verdict / checklist 展开内容
statusReason: Unable to find an element with the text: 问题清晰. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"

[Killed] ArrowFunction
src/views/ChangeDetailView.tsx:34:33
       )}
       {record.checklist.length > 0 && (
         <ul className="checklist">
-          {record.checklist.map((entry, index) => (
-            <li key={index}>
-              <span className={`badge badge-${entry.pass ? 'pass' : 'fail'}`}>
-                {entry.pass ? 'pass' : 'fail'}
-              </span>
-              <div>
-                <div className="item-row">{entry.item}</div>
-                <div className="evidence">{entry.evidence}</div>
-              </div>
-            </li>
-          ))}
+          {record.checklist.map(() => undefined)}
         </ul>
       )}
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 9 站流水线渲染 attempt 序列 / verdict / checklist 展开内容
statusReason: Unable to find an element with the text: 问题清晰. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"

[Killed] BlockStatement
src/views/ChangeDetailView.tsx:51:52
   );
 }
 
-function Station({ entry }: { entry: PhaseEntry }) {
-  return (
-    <div className="station">
-      <div className="station-head">
-        <span>{entry.phase}</span>
-        <span className="muted">({entry.attempts.length} 次尝试)</span>
-      </div>
-      {entry.attempts.length === 0 ? (
-        <div className="muted">（无记录）</div>
-      ) : (
-        entry.attempts.map((record, index) => <Attempt key={index} record={record} />)
-      )}
-    </div>
-  );
-}
+function Station({ entry }: { entry: PhaseEntry }) {}
 
 function DetailSectionInterupted({ interrupted }: { interrupted: ChangeDetail['interrupted'] }) {
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 9 站流水线渲染 attempt 序列 / verdict / checklist 展开内容
statusReason: Unable to find an element with the text: proposal. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"

[Killed] ConditionalExpression
src/views/ChangeDetailView.tsx:58:8
         <span>{entry.phase}</span>
         <span className="muted">({entry.attempts.length} 次尝试)</span>
       </div>
-      {entry.attempts.length === 0 ? (
+      {true ? (
         <div className="muted">（无记录）</div>
       ) : (
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 9 站流水线渲染 attempt 序列 / verdict / checklist 展开内容
statusReason: Unable to find an element with the text: 提案评估通过. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"

[Killed] ConditionalExpression
src/views/ChangeDetailView.tsx:58:8
         <span>{entry.phase}</span>
         <span className="muted">({entry.attempts.length} 次尝试)</span>
       </div>
-      {entry.attempts.length === 0 ? (
+      {false ? (
         <div className="muted">（无记录）</div>
       ) : (
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 9 站流水线渲染 attempt 序列 / verdict / checklist 展开内容
statusReason: Unable to find an element with the text: （无记录）. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"

[Killed] ArrowFunction
src/views/ChangeDetailView.tsx:61:28
       {entry.attempts.length === 0 ? (
         <div className="muted">（无记录）</div>
       ) : (
-        entry.attempts.map((record, index) => <Attempt key={index} record={record} />)
+        entry.attempts.map(() => undefined)
       )}
     </div>
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 9 站流水线渲染 attempt 序列 / verdict / checklist 展开内容
statusReason: Unable to find an element with the text: 提案评估通过. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"

[Killed] BlockStatement
src/views/ChangeDetailView.tsx:67:97
   );
 }
 
-function DetailSectionInterupted({ interrupted }: { interrupted: ChangeDetail['interrupted'] }) {
-  return (
-    <section className="panel">
-      <h2>中断留档</h2>
-      {interrupted.map((entry, index) => (
-        <div className="attempt" key={index}>
-          <div className="attempt-meta">
-            <span>{entry.phase}</span>
-            <span>attempt {entry.attempt}</span>
-            <span>start: {formatTime(entry.startAt)}</span>
-            <span>end: {formatTime(entry.endAt)}</span>
-          </div>
-        </div>
-      ))}
-    </section>
-  );
-}
+function DetailSectionInterupted({ interrupted }: { interrupted: ChangeDetail['interrupted'] }) {}
 
 function DetailSectionFileList({ detail }: { detail: ChangeDetail }) {
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 中断留档区块渲染条目，空缺时间显示占位符
statusReason: Unable to find an element with the text: 中断留档. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"

[Killed] ArrowFunction
src/views/ChangeDetailView.tsx:71:24
   return (
     <section className="panel">
       <h2>中断留档</h2>
-      {interrupted.map((entry, index) => (
-        <div className="attempt" key={index}>
-          <div className="attempt-meta">
-            <span>{entry.phase}</span>
-            <span>attempt {entry.attempt}</span>
-            <span>start: {formatTime(entry.startAt)}</span>
-            <span>end: {formatTime(entry.endAt)}</span>
-          </div>
-        </div>
-      ))}
+      {interrupted.map(() => undefined)}
     </section>
   );
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 中断留档区块渲染条目，空缺时间显示占位符
statusReason: expected '← 返回列表刷新详情add-featurev2进行中2026-09-01流…' to contain 'start: 2026-09-02T00:00:00Z'

[Killed] ConditionalExpression
src/views/ChangeDetailView.tsx:89:8
   return (
     <section className="panel">
       <h2>文件清单 (file_log)</h2>
-      {detail.fileLog === null ? (
+      {true ? (
         <div className="muted">（无 file_log 数据：v1 及更早代际无此字段）</div>
       ) : detail.fileLog.length === 0 ? (
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 file_log 为空数组时渲染（空）占位而非留空降级
statusReason: expected '← 返回列表刷新详情add-featurev2进行中2026-09-01流…' to contain '（空）'

[Killed] EqualityOperator
src/views/ChangeDetailView.tsx:89:8
   return (
     <section className="panel">
       <h2>文件清单 (file_log)</h2>
-      {detail.fileLog === null ? (
+      {detail.fileLog !== null ? (
         <div className="muted">（无 file_log 数据：v1 及更早代际无此字段）</div>
       ) : detail.fileLog.length === 0 ? (
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 v0 change（空流水线 + 纯文档产物清单）以纯文档形态呈现
statusReason: Cannot read properties of null (reading 'length')

[Killed] ConditionalExpression
src/views/ChangeDetailView.tsx:91:11
       <h2>文件清单 (file_log)</h2>
       {detail.fileLog === null ? (
         <div className="muted">（无 file_log 数据：v1 及更早代际无此字段）</div>
-      ) : detail.fileLog.length === 0 ? (
+      ) : true ? (
         <div className="muted">（空）</div>
       ) : (
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 file_log 条目以表格逐行渲染，attempt 与时间空缺显示占位符
statusReason: expected [] to have a length of 2 but got +0

[Killed] EqualityOperator
src/views/ChangeDetailView.tsx:91:11
       <h2>文件清单 (file_log)</h2>
       {detail.fileLog === null ? (
         <div className="muted">（无 file_log 数据：v1 及更早代际无此字段）</div>
-      ) : detail.fileLog.length === 0 ? (
+      ) : detail.fileLog.length !== 0 ? (
         <div className="muted">（空）</div>
       ) : (
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 file_log 为空数组时渲染（空）占位而非留空降级
statusReason: expected '← 返回列表刷新详情add-featurev2进行中2026-09-01流…' to contain '（空）'

[Killed] ArrowFunction
src/views/ChangeDetailView.tsx:105:33
             </tr>
           </thead>
           <tbody>
-            {detail.fileLog.map((entry, index) => (
-              <tr key={index}>
-                <td>{entry.op}</td>
-                <td>{entry.scope}</td>
-                <td>{entry.attempt ?? '—'}</td>
-                <td>{entry.path}</td>
-                <td>{formatTime(entry.at)}</td>
-              </tr>
-            ))}
+            {detail.fileLog.map(() => undefined)}
           </tbody>
         </table>
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 file_log 条目以表格逐行渲染，attempt 与时间空缺显示占位符
statusReason: expected [] to have a length of 2 but got +0

[Killed] LogicalOperator
src/views/ChangeDetailView.tsx:109:22
               <tr key={index}>
                 <td>{entry.op}</td>
                 <td>{entry.scope}</td>
-                <td>{entry.attempt ?? '—'}</td>
+                <td>{entry.attempt && '—'}</td>
                 <td>{entry.path}</td>
                 <td>{formatTime(entry.at)}</td>
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 file_log 条目以表格逐行渲染，attempt 与时间空缺显示占位符
statusReason: expected [ 'write', 'workflow', '—', …(2) ] to deeply equal [ 'write', 'workflow', '3', …(2) ]

[Killed] BlockStatement
src/views/ChangeDetailView.tsx:131:4
   loading: boolean;
   onBack: () => void;
   refresh: () => void;
-}) {
-  return (
-    <div className="detail-header">
-      <button onClick={onBack}>← 返回列表</button>
-      <button onClick={refresh} disabled={loading}>
-        刷新详情
-      </button>
-      <h2>{detail.name}</h2>
-      <span className={`badge badge-in${detail.inventory}`}>{detail.inventory}</span>
-      <span className="muted">{detail.source === 'archive' ? '已归档' : '进行中'}</span>
-      {detail.created !== null && <span className="muted">{detail.created}</span>}
-      {detail.activePhase !== null && (
-        <span className="badge badge-active">
-          运行中 · {detail.activePhase.phase} · attempt {detail.activePhase.attempt}
-          {detail.activePhase.startAt !== null && ` · ${formatTime(detail.activePhase.startAt)}`}
-        </span>
-      )}
-    </div>
-  );
-}
+}) {}
 
 function DetailSectionPipeline({
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 active_phase 存在时渲染运行中标示；backtrack_to / backtrack_reason 随条目展示
statusReason: Unable to find an element with the text: 运行中 · implement · attempt 2 · 2026-09-02T01:00:00Z. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <section
        class="panel"

[Killed] StringLiteral
src/views/ChangeDetailView.tsx:139:24
         刷新详情
       </button>
       <h2>{detail.name}</h2>
-      <span className={`badge badge-in${detail.inventory}`}>{detail.inventory}</span>
+      <span className={``}>{detail.inventory}</span>
       <span className="muted">{detail.source === 'archive' ? '已归档' : '进行中'}</span>
       {detail.created !== null && <span className="muted">{detail.created}</span>}
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 头部按 source / created / inventory 渲染元信息
statusReason: expected undefined to be 'v2' // Object.is equality

[Killed] ConditionalExpression
src/views/ChangeDetailView.tsx:140:32
       </button>
       <h2>{detail.name}</h2>
       <span className={`badge badge-in${detail.inventory}`}>{detail.inventory}</span>
-      <span className="muted">{detail.source === 'archive' ? '已归档' : '进行中'}</span>
+      <span className="muted">{false ? '已归档' : '进行中'}</span>
       {detail.created !== null && <span className="muted">{detail.created}</span>}
       {detail.activePhase !== null && (
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 头部按 source / created / inventory 渲染元信息
statusReason: expected '← 返回列表刷新详情add-featurev2进行中流水线proposal…' to contain '已归档'
