[Killed] EqualityOperator
src/views/ChangeDetailView.tsx:140:32
       </button>
       <h2>{detail.name}</h2>
       <span className={`badge badge-in${detail.inventory}`}>{detail.inventory}</span>
-      <span className="muted">{detail.source === 'archive' ? '已归档' : '进行中'}</span>
+      <span className="muted">{detail.source !== 'archive' ? '已归档' : '进行中'}</span>
       {detail.created !== null && <span className="muted">{detail.created}</span>}
       {detail.activePhase !== null && (
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 头部按 source / created / inventory 渲染元信息
statusReason: Unable to find an element with the text: 进行中. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"

[Killed] LogicalOperator
src/views/ChangeDetailView.tsx:141:8
       <h2>{detail.name}</h2>
       <span className={`badge badge-in${detail.inventory}`}>{detail.inventory}</span>
       <span className="muted">{detail.source === 'archive' ? '已归档' : '进行中'}</span>
-      {detail.created !== null && <span className="muted">{detail.created}</span>}
+      {detail.created !== null || <span className="muted">{detail.created}</span>}
       {detail.activePhase !== null && (
         <span className="badge badge-active">
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 头部按 source / created / inventory 渲染元信息
statusReason: expected '← 返回列表刷新详情add-featurev2进行中流水线proposal…' to contain '2026-09-01'

[Killed] EqualityOperator
src/views/ChangeDetailView.tsx:141:8
       <h2>{detail.name}</h2>
       <span className={`badge badge-in${detail.inventory}`}>{detail.inventory}</span>
       <span className="muted">{detail.source === 'archive' ? '已归档' : '进行中'}</span>
-      {detail.created !== null && <span className="muted">{detail.created}</span>}
+      {detail.created === null && <span className="muted">{detail.created}</span>}
       {detail.activePhase !== null && (
         <span className="badge badge-active">
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 头部按 source / created / inventory 渲染元信息
statusReason: expected '← 返回列表刷新详情add-featurev2进行中流水线proposal…' to contain '2026-09-01'

[Killed] ConditionalExpression
src/views/ChangeDetailView.tsx:142:8
       <span className={`badge badge-in${detail.inventory}`}>{detail.inventory}</span>
       <span className="muted">{detail.source === 'archive' ? '已归档' : '进行中'}</span>
       {detail.created !== null && <span className="muted">{detail.created}</span>}
-      {detail.activePhase !== null && (
-        <span className="badge badge-active">
-          运行中 · {detail.activePhase.phase} · attempt {detail.activePhase.attempt}
-          {detail.activePhase.startAt !== null && ` · ${formatTime(detail.activePhase.startAt)}`}
-        </span>
-      )}
+      {false}
     </div>
   );
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 active_phase 存在时渲染运行中标示；backtrack_to / backtrack_reason 随条目展示
statusReason: Unable to find an element with the text: 运行中 · implement · attempt 2 · 2026-09-02T01:00:00Z. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"

[Killed] EqualityOperator
src/views/ChangeDetailView.tsx:142:8
       <span className={`badge badge-in${detail.inventory}`}>{detail.inventory}</span>
       <span className="muted">{detail.source === 'archive' ? '已归档' : '进行中'}</span>
       {detail.created !== null && <span className="muted">{detail.created}</span>}
-      {detail.activePhase !== null && (
+      {detail.activePhase === null && (
         <span className="badge badge-active">
           运行中 · {detail.activePhase.phase} · attempt {detail.activePhase.attempt}
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 9 站流水线渲染 attempt 序列 / verdict / checklist 展开内容
statusReason: Cannot read properties of null (reading 'phase')

[Killed] LogicalOperator
src/views/ChangeDetailView.tsx:145:12
       {detail.activePhase !== null && (
         <span className="badge badge-active">
           运行中 · {detail.activePhase.phase} · attempt {detail.activePhase.attempt}
-          {detail.activePhase.startAt !== null && ` · ${formatTime(detail.activePhase.startAt)}`}
+          {detail.activePhase.startAt !== null || ` · ${formatTime(detail.activePhase.startAt)}`}
         </span>
       )}
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 active_phase 存在时渲染运行中标示；backtrack_to / backtrack_reason 随条目展示
statusReason: Unable to find an element with the text: 运行中 · implement · attempt 2 · 2026-09-02T01:00:00Z. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"

[Killed] EqualityOperator
src/views/ChangeDetailView.tsx:145:12
       {detail.activePhase !== null && (
         <span className="badge badge-active">
           运行中 · {detail.activePhase.phase} · attempt {detail.activePhase.attempt}
-          {detail.activePhase.startAt !== null && ` · ${formatTime(detail.activePhase.startAt)}`}
+          {detail.activePhase.startAt === null && ` · ${formatTime(detail.activePhase.startAt)}`}
         </span>
       )}
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 active_phase 存在时渲染运行中标示；backtrack_to / backtrack_reason 随条目展示
statusReason: Unable to find an element with the text: 运行中 · implement · attempt 2 · 2026-09-02T01:00:00Z. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"

[Killed] BlockStatement
src/views/ChangeDetailView.tsx:158:4
 }: {
   pipeline: PhaseEntry[];
   docOnly: boolean;
-}) {
-  return (
-    <section className="panel">
-      <h2>流水线</h2>
-      {pipeline.length === 0 ? (
-        <div className="muted">
-          {docOnly ? '（v0 早期代际：无 workflow.json，仅文档形态）' : '（无评估记录）'}
-        </div>
-      ) : (
-        pipeline.map((entry) => <Station key={entry.phase} entry={entry} />)
-      )}
-    </section>
-  );
-}
+}) {}
 
 function DetailSectionArtifacts({ artifacts }: { artifacts: ArtifactEnvelope[] }) {
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 9 站流水线渲染 attempt 序列 / verdict / checklist 展开内容
statusReason: Unable to find an element with the text: proposal. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"

[Killed] ConditionalExpression
src/views/ChangeDetailView.tsx:162:8
   return (
     <section className="panel">
       <h2>流水线</h2>
-      {pipeline.length === 0 ? (
+      {true ? (
         <div className="muted">
           {docOnly ? '（v0 早期代际：无 workflow.json，仅文档形态）' : '（无评估记录）'}
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 9 站流水线渲染 attempt 序列 / verdict / checklist 展开内容
statusReason: Unable to find an element with the text: proposal. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"

[Killed] ConditionalExpression
src/views/ChangeDetailView.tsx:162:8
   return (
     <section className="panel">
       <h2>流水线</h2>
-      {pipeline.length === 0 ? (
+      {false ? (
         <div className="muted">
           {docOnly ? '（v0 早期代际：无 workflow.json，仅文档形态）' : '（无评估记录）'}
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 v0 change（空流水线 + 纯文档产物清单）以纯文档形态呈现
statusReason: Unable to find an element with the text: /v0 早期代际：无 workflow.json，仅文档形态/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"

[Killed] ArrowFunction
src/views/ChangeDetailView.tsx:167:22
           {docOnly ? '（v0 早期代际：无 workflow.json，仅文档形态）' : '（无评估记录）'}
         </div>
       ) : (
-        pipeline.map((entry) => <Station key={entry.phase} entry={entry} />)
+        pipeline.map(() => undefined)
       )}
     </section>
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 9 站流水线渲染 attempt 序列 / verdict / checklist 展开内容
statusReason: Unable to find an element with the text: proposal. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"

[Killed] BlockStatement
src/views/ChangeDetailView.tsx:173:83
   );
 }
 
-function DetailSectionArtifacts({ artifacts }: { artifacts: ArtifactEnvelope[] }) {
-  return (
-    <section className="panel">
-      <h2>
-        产物 <span className="muted">({artifacts.length})</span>
-      </h2>
-      {artifacts.length === 0 ? (
-        <div className="muted">（未发现可读产物）</div>
-      ) : (
-        artifacts.map((envelope, index) => (
-          <ArtifactView key={`${envelope.kind}-${envelope.title}-${index}`} envelope={envelope} />
-        ))
-      )}
-    </section>
-  );
-}
+function DetailSectionArtifacts({ artifacts }: { artifacts: ArtifactEnvelope[] }) {}
 
 /** 详情降级页：错误 / 加载中 / 未找到共用，error 控制提示样式。 */
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 v0 change（空流水线 + 纯文档产物清单）以纯文档形态呈现
statusReason: Unable to find an element with the text: v0 提案文档. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"

[Killed] ConditionalExpression
src/views/ChangeDetailView.tsx:179:8
       <h2>
         产物 <span className="muted">({artifacts.length})</span>
       </h2>
-      {artifacts.length === 0 ? (
+      {true ? (
         <div className="muted">（未发现可读产物）</div>
       ) : (
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 v0 change（空流水线 + 纯文档产物清单）以纯文档形态呈现
statusReason: Unable to find an element with the text: v0 提案文档. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"

[Killed] EqualityOperator
src/views/ChangeDetailView.tsx:179:8
       <h2>
         产物 <span className="muted">({artifacts.length})</span>
       </h2>
-      {artifacts.length === 0 ? (
+      {artifacts.length !== 0 ? (
         <div className="muted">（未发现可读产物）</div>
       ) : (
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 v0 change（空流水线 + 纯文档产物清单）以纯文档形态呈现
statusReason: Unable to find an element with the text: v0 提案文档. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"

[Killed] ArrowFunction
src/views/ChangeDetailView.tsx:182:23
       {artifacts.length === 0 ? (
         <div className="muted">（未发现可读产物）</div>
       ) : (
-        artifacts.map((envelope, index) => (
-          <ArtifactView key={`${envelope.kind}-${envelope.title}-${index}`} envelope={envelope} />
-        ))
+        artifacts.map(() => undefined)
       )}
     </section>
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 v0 change（空流水线 + 纯文档产物清单）以纯文档形态呈现
statusReason: Unable to find an element with the text: v0 提案文档. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"

[Survived] StringLiteral
src/views/ChangeDetailView.tsx:183:30
         <div className="muted">（未发现可读产物）</div>
       ) : (
         artifacts.map((envelope, index) => (
-          <ArtifactView key={`${envelope.kind}-${envelope.title}-${index}`} envelope={envelope} />
+          <ArtifactView key={``} envelope={envelope} />
         ))
       )}

[Killed] BooleanLiteral
src/views/ChangeDetailView.tsx:193:11
 /** 详情降级页：错误 / 加载中 / 未找到共用，error 控制提示样式。 */
 function DetailFallback({
   message,
-  error = false,
+  error = true,
   onBack,
 }: {
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 detail 为 null / error 态渲染空态与错误提示，不白屏
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/views/ChangeDetailView.tsx:199:4
   message: string;
   error?: boolean;
   onBack: () => void;
-}) {
-  return (
-    <div>
-      <button onClick={onBack}>← 返回列表</button>
-      <div className={error ? 'error-note' : 'muted'}>{message}</div>
-    </div>
-  );
-}
+}) {}
 
 /** change 详情视图：9 站流水线、active_phase 运行中标示、v0 纯文档形态、v1 区块留空降级、产物区 */
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 detail 为 null / error 态渲染空态与错误提示，不白屏
statusReason: expected '' to contain '未找到该 change。'

[Killed] ConditionalExpression
src/views/ChangeDetailView.tsx:217:7
   onBack: () => void;
 }) {
   const { detail, artifacts, loading, error, refresh } = state;
-  if (error !== null) {
+  if (true) {
     return <DetailFallback message={`详情加载失败：${error}`} error onBack={onBack} />;
   }
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 9 站流水线渲染 attempt 序列 / verdict / checklist 展开内容
statusReason: Unable to find an element with the text: proposal. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <button>
        ← 返回列表

[Killed] BlockStatement
src/views/ChangeDetailView.tsx:217:23
   onBack: () => void;
 }) {
   const { detail, artifacts, loading, error, refresh } = state;
-  if (error !== null) {
-    return <DetailFallback message={`详情加载失败：${error}`} error onBack={onBack} />;
-  }
+  if (error !== null) {}
   if (loading && detail === null) {
     return <DetailFallback message="加载中…" onBack={onBack} />;
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 detail 为 null / error 态渲染空态与错误提示，不白屏
statusReason: expected '← 返回列表未找到该 change。' to contain '详情加载失败：IPC 断开'

[Killed] StringLiteral
src/views/ChangeDetailView.tsx:218:37
 }) {
   const { detail, artifacts, loading, error, refresh } = state;
   if (error !== null) {
-    return <DetailFallback message={`详情加载失败：${error}`} error onBack={onBack} />;
+    return <DetailFallback message={``} error onBack={onBack} />;
   }
   if (loading && detail === null) {
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 detail 为 null / error 态渲染空态与错误提示，不白屏
statusReason: expected '← 返回列表' to contain '详情加载失败：IPC 断开'

[Killed] EqualityOperator
src/views/ChangeDetailView.tsx:220:18
   if (error !== null) {
     return <DetailFallback message={`详情加载失败：${error}`} error onBack={onBack} />;
   }
-  if (loading && detail === null) {
+  if (loading && detail !== null) {
     return <DetailFallback message="加载中…" onBack={onBack} />;
   }
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 loading 态与未找到态共用降级页且采用 muted 样式
statusReason: expected '← 返回列表未找到该 change。' to contain '加载中…'

[Killed] ConditionalExpression
src/views/ChangeDetailView.tsx:220:18
   if (error !== null) {
     return <DetailFallback message={`详情加载失败：${error}`} error onBack={onBack} />;
   }
-  if (loading && detail === null) {
+  if (loading && true) {
     return <DetailFallback message="加载中…" onBack={onBack} />;
   }
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 loading 中已有详情时不回落到加载占位，刷新按钮禁用
statusReason: expected '← 返回列表加载中…' not to contain '加载中…'

[Killed] ConditionalExpression
src/views/ChangeDetailView.tsx:223:7
   if (loading && detail === null) {
     return <DetailFallback message="加载中…" onBack={onBack} />;
   }
-  if (detail === null) {
+  if (true) {
     return <DetailFallback message="未找到该 change。" onBack={onBack} />;
   }
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 9 站流水线渲染 attempt 序列 / verdict / checklist 展开内容
statusReason: Unable to find an element with the text: proposal. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <button>
        ← 返回列表

[Killed] BlockStatement
src/views/ChangeDetailView.tsx:223:24
   if (loading && detail === null) {
     return <DetailFallback message="加载中…" onBack={onBack} />;
   }
-  if (detail === null) {
-    return <DetailFallback message="未找到该 change。" onBack={onBack} />;
-  }
+  if (detail === null) {}
   const docOnly = detail.inventory === 'v0';
   return (
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 detail 为 null / error 态渲染空态与错误提示，不白屏
statusReason: Cannot read properties of null (reading 'inventory')

[Killed] ConditionalExpression
src/views/ChangeDetailView.tsx:226:19
   if (detail === null) {
     return <DetailFallback message="未找到该 change。" onBack={onBack} />;
   }
-  const docOnly = detail.inventory === 'v0';
+  const docOnly = false;
   return (
     <div>
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 v0 change（空流水线 + 纯文档产物清单）以纯文档形态呈现
statusReason: Unable to find an element with the text: /v0 早期代际：无 workflow.json，仅文档形态/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"

[Killed] ConditionalExpression
src/views/ChangeDetailView.tsx:226:19
   if (detail === null) {
     return <DetailFallback message="未找到该 change。" onBack={onBack} />;
   }
-  const docOnly = detail.inventory === 'v0';
+  const docOnly = true;
   return (
     <div>
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 v2 空流水线渲染（无评估记录）而非 v0 纯文档文案
statusReason: expected '← 返回列表刷新详情add-featurev2进行中2026-09-01流…' to contain '（无评估记录）'

[Killed] ConditionalExpression
src/views/ChangeDetailView.tsx:231:8
     <div>
       <DetailHeader detail={detail} loading={loading} onBack={onBack} refresh={refresh} />
 
-      {detail.unparsable && (
-        <div className="warn-note">
-          workflow.json 无法解析（可能已损坏），以下仅展示文件系统层信息与产物。
-        </div>
-      )}
+      {false}
 
       <DetailSectionPipeline pipeline={detail.pipeline} docOnly={docOnly} />
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 unparsable 详情渲染警示条
statusReason: expected '← 返回列表刷新详情add-featurev2进行中2026-09-01流…' to contain 'workflow.json 无法解析'

[Killed] ConditionalExpression
src/views/ChangeDetailView.tsx:231:8
     <div>
       <DetailHeader detail={detail} loading={loading} onBack={onBack} refresh={refresh} />
 
-      {detail.unparsable && (
-        <div className="warn-note">
-          workflow.json 无法解析（可能已损坏），以下仅展示文件系统层信息与产物。
-        </div>
-      )}
+      {true}
 
       <DetailSectionPipeline pipeline={detail.pipeline} docOnly={docOnly} />
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 unparsable 详情渲染警示条
statusReason: expected '← 返回列表刷新详情add-featurev2进行中2026-09-01流…' to contain 'workflow.json 无法解析'

[Killed] ConditionalExpression
src/views/ChangeDetailView.tsx:239:8
 
       <DetailSectionPipeline pipeline={detail.pipeline} docOnly={docOnly} />
 
-      {detail.interrupted.length > 0 && (
-        <DetailSectionInterupted interrupted={detail.interrupted}></DetailSectionInterupted>
-      )}
+      {false}
 
       <DetailSectionFileList detail={detail}></DetailSectionFileList>
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 中断留档区块渲染条目，空缺时间显示占位符
statusReason: Unable to find an element with the text: 中断留档. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"

[Killed] ConditionalExpression
src/views/ChangeDetailView.tsx:239:8
 
       <DetailSectionPipeline pipeline={detail.pipeline} docOnly={docOnly} />
 
-      {detail.interrupted.length > 0 && (
-        <DetailSectionInterupted interrupted={detail.interrupted}></DetailSectionInterupted>
-      )}
+      {true}
 
       <DetailSectionFileList detail={detail}></DetailSectionFileList>
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 中断留档区块渲染条目，空缺时间显示占位符
statusReason: Unable to find an element with the text: 中断留档. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="detail-header"
