[Killed] BlockStatement
src/views/changes/ChangeDetailView.tsx:29:75
   v2: 'inv2',
 };
 
-function VerdictBadge({ verdict }: { verdict: AttemptRecord['verdict'] }) {
-  return (
-    <Badge variant={verdict === 'pass' ? 'pass' : 'fail'} data-testid="attempt-verdict">
-      {verdict}
-    </Badge>
-  );
-}
+function VerdictBadge({ verdict }: { verdict: AttemptRecord['verdict'] }) {}
 
 function formatTime(value: string | null): string {
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 verdict 徽标按 pass / fail 呈现对应文案
statusReason: Unable to find an element by: [data-testid="attempt-verdict"]

Ignored nodes: comments, script, style
<div
  class="mb-1 flex flex-wrap items-center gap-2 text-xs text-muted-foreground"
  data-testid="attempt-meta"
>
  <span>

[Survived] ConditionalExpression
src/views/changes/ChangeDetailView.tsx:31:21
 
 function VerdictBadge({ verdict }: { verdict: AttemptRecord['verdict'] }) {
   return (
-    <Badge variant={verdict === 'pass' ? 'pass' : 'fail'} data-testid="attempt-verdict">
+    <Badge variant={false ? 'pass' : 'fail'} data-testid="attempt-verdict">
       {verdict}
     </Badge>

[Survived] EqualityOperator
src/views/changes/ChangeDetailView.tsx:31:21
 
 function VerdictBadge({ verdict }: { verdict: AttemptRecord['verdict'] }) {
   return (
-    <Badge variant={verdict === 'pass' ? 'pass' : 'fail'} data-testid="attempt-verdict">
+    <Badge variant={verdict !== 'pass' ? 'pass' : 'fail'} data-testid="attempt-verdict">
       {verdict}
     </Badge>

[Killed] ConditionalExpression
src/views/changes/ChangeDetailView.tsx:49:10
         className="mb-1 flex flex-wrap items-center gap-2 text-xs text-muted-foreground"
         data-testid="attempt-meta"
       >
-        {record.attempt !== null ? <span>attempt {record.attempt}</span> : <span>attempt —</span>}
+        {true ? <span>attempt {record.attempt}</span> : <span>attempt —</span>}
         <VerdictBadge verdict={record.verdict} />
         {record.skipped && <span>skipped</span>}
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 attempt 编号缺失渲染占位符 attempt —，有编号渲染实际值
statusReason: expected '← 返回列表刷新详情add-featurev2进行中2026-09-01流…' to contain 'attempt —'

[Killed] ConditionalExpression
src/views/changes/ChangeDetailView.tsx:49:10
         className="mb-1 flex flex-wrap items-center gap-2 text-xs text-muted-foreground"
         data-testid="attempt-meta"
       >
-        {record.attempt !== null ? <span>attempt {record.attempt}</span> : <span>attempt —</span>}
+        {false ? <span>attempt {record.attempt}</span> : <span>attempt —</span>}
         <VerdictBadge verdict={record.verdict} />
         {record.skipped && <span>skipped</span>}
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 attempt 编号缺失渲染占位符 attempt —，有编号渲染实际值
statusReason: expected '← 返回列表刷新详情add-featurev2进行中2026-09-01流…' to contain 'attempt 3'

[Killed] LogicalOperator
src/views/changes/ChangeDetailView.tsx:52:10
         {record.attempt !== null ? <span>attempt {record.attempt}</span> : <span>attempt —</span>}
         <VerdictBadge verdict={record.verdict} />
         {record.skipped && <span>skipped</span>}
-        {record.stale && <span>stale</span>}
+        {record.stale || <span>stale</span>}
         {record.startAt !== null && <span>start: {formatTime(record.startAt)}</span>}
         {record.timestamp !== null && <span>at: {formatTime(record.timestamp)}</span>}
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 skipped / stale / start / at 标记仅在对应值存在时渲染
statusReason: expected '← 返回列表刷新详情add-featurev2进行中2026-09-01流…' to contain 'stale'

[Killed] EqualityOperator
src/views/changes/ChangeDetailView.tsx:54:10
         {record.skipped && <span>skipped</span>}
         {record.stale && <span>stale</span>}
         {record.startAt !== null && <span>start: {formatTime(record.startAt)}</span>}
-        {record.timestamp !== null && <span>at: {formatTime(record.timestamp)}</span>}
+        {record.timestamp === null && <span>at: {formatTime(record.timestamp)}</span>}
       </div>
       <div className="my-1 whitespace-pre-wrap break-words">{record.report}</div>
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 skipped / stale / start / at 标记仅在对应值存在时渲染
statusReason: expected '← 返回列表刷新详情add-featurev2进行中2026-09-01流…' to contain 'at: 2026-09-01T02:00:00Z'

[Killed] LogicalOperator
src/views/changes/ChangeDetailView.tsx:54:10
         {record.skipped && <span>skipped</span>}
         {record.stale && <span>stale</span>}
         {record.startAt !== null && <span>start: {formatTime(record.startAt)}</span>}
-        {record.timestamp !== null && <span>at: {formatTime(record.timestamp)}</span>}
+        {record.timestamp !== null || <span>at: {formatTime(record.timestamp)}</span>}
       </div>
       <div className="my-1 whitespace-pre-wrap break-words">{record.report}</div>
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 skipped / stale / start / at 标记仅在对应值存在时渲染
statusReason: expected '← 返回列表刷新详情add-featurev2进行中2026-09-01流…' to contain 'at: 2026-09-01T02:00:00Z'

[Killed] EqualityOperator
src/views/changes/ChangeDetailView.tsx:57:40
         {record.timestamp !== null && <span>at: {formatTime(record.timestamp)}</span>}
       </div>
       <div className="my-1 whitespace-pre-wrap break-words">{record.report}</div>
-      {(record.backtrackTo !== null || record.backtrackReason !== null) && (
+      {(record.backtrackTo !== null || record.backtrackReason === null) && (
         <div className="mt-1 text-xs text-orange-800" data-testid="backtrack">
           ↩ 回跳至 {record.backtrackTo ?? '?'}
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 backtrack 块按 to / reason 的四种组合形态渲染
statusReason: expected '← 返回列表刷新详情add-featurev2进行中2026-09-01流…' to contain '回跳至 ?'

[Killed] ConditionalExpression
src/views/changes/ChangeDetailView.tsx:57:40
         {record.timestamp !== null && <span>at: {formatTime(record.timestamp)}</span>}
       </div>
       <div className="my-1 whitespace-pre-wrap break-words">{record.report}</div>
-      {(record.backtrackTo !== null || record.backtrackReason !== null) && (
+      {(record.backtrackTo !== null || false) && (
         <div className="mt-1 text-xs text-orange-800" data-testid="backtrack">
           ↩ 回跳至 {record.backtrackTo ?? '?'}
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 backtrack 块按 to / reason 的四种组合形态渲染
statusReason: expected '← 返回列表刷新详情add-featurev2进行中2026-09-01流…' to contain '回跳至 ?'

[Killed] LogicalOperator
src/views/changes/ChangeDetailView.tsx:59:18
       <div className="my-1 whitespace-pre-wrap break-words">{record.report}</div>
       {(record.backtrackTo !== null || record.backtrackReason !== null) && (
         <div className="mt-1 text-xs text-orange-800" data-testid="backtrack">
-          ↩ 回跳至 {record.backtrackTo ?? '?'}
+          ↩ 回跳至 {record.backtrackTo && '?'}
           {record.backtrackReason !== null && `：${record.backtrackReason}`}
         </div>
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 active_phase 存在时渲染运行中标示；backtrack_to / backtrack_reason 随条目展示
statusReason: Unable to find an element with the text: /回跳至 test-design/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="mb-3 flex flex-wrap items-center gap-2.5"

[Killed] StringLiteral
src/views/changes/ChangeDetailView.tsx:59:40
       <div className="my-1 whitespace-pre-wrap break-words">{record.report}</div>
       {(record.backtrackTo !== null || record.backtrackReason !== null) && (
         <div className="mt-1 text-xs text-orange-800" data-testid="backtrack">
-          ↩ 回跳至 {record.backtrackTo ?? '?'}
+          ↩ 回跳至 {record.backtrackTo ?? ""}
           {record.backtrackReason !== null && `：${record.backtrackReason}`}
         </div>
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 backtrack 块按 to / reason 的四种组合形态渲染
statusReason: expected '← 返回列表刷新详情add-featurev2进行中2026-09-01流…' to contain '回跳至 ?'

[Killed] ConditionalExpression
src/views/changes/ChangeDetailView.tsx:60:12
       {(record.backtrackTo !== null || record.backtrackReason !== null) && (
         <div className="mt-1 text-xs text-orange-800" data-testid="backtrack">
           ↩ 回跳至 {record.backtrackTo ?? '?'}
-          {record.backtrackReason !== null && `：${record.backtrackReason}`}
+          {true}
         </div>
       )}
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 active_phase 存在时渲染运行中标示；backtrack_to / backtrack_reason 随条目展示
statusReason: Unable to find an element with the text: /测试设计缺失/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="mb-3 flex flex-wrap items-center gap-2.5"

[Killed] ConditionalExpression
src/views/changes/ChangeDetailView.tsx:60:12
       {(record.backtrackTo !== null || record.backtrackReason !== null) && (
         <div className="mt-1 text-xs text-orange-800" data-testid="backtrack">
           ↩ 回跳至 {record.backtrackTo ?? '?'}
-          {record.backtrackReason !== null && `：${record.backtrackReason}`}
+          {true && `：${record.backtrackReason}`}
         </div>
       )}
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 backtrack 块按 to / reason 的四种组合形态渲染
statusReason: expected '← 返回列表刷新详情add-featurev2进行中2026-09-01流…' not to contain '：null'

[Killed] LogicalOperator
src/views/changes/ChangeDetailView.tsx:63:8
           {record.backtrackReason !== null && `：${record.backtrackReason}`}
         </div>
       )}
-      {record.checklist.length > 0 && (
-        <ul className="m-0 mt-1.5 list-none p-0" data-testid="checklist">
-          {record.checklist.map((entry, index) => (
-            <li key={index} className="flex items-baseline gap-2 py-[3px]">
-              <Badge variant={entry.pass ? 'pass' : 'fail'} data-testid="checklist-verdict">
-                {entry.pass ? 'pass' : 'fail'}
-              </Badge>
-              <div>
-                <div className="border-b border-dashed border-border py-1">{entry.item}</div>
-                <div className="break-words text-xs text-muted-foreground">{entry.evidence}</div>
-              </div>
-            </li>
-          ))}
-        </ul>
-      )}
+      {record.checklist.length > 0 || <ul className="m-0 mt-1.5 list-none p-0" data-testid="checklist">
+          {record.checklist.map((entry, index) => <li key={index} className="flex items-baseline gap-2 py-[3px]">
+              <Badge variant={entry.pass ? 'pass' : 'fail'} data-testid="checklist-verdict">
+                {entry.pass ? 'pass' : 'fail'}
+              </Badge>
+              <div>
+                <div className="border-b border-dashed border-border py-1">{entry.item}</div>
+                <div className="break-words text-xs text-muted-foreground">{entry.evidence}</div>
+              </div>
+            </li>)}
+        </ul>}
     </div>
   );
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 9 站流水线渲染 attempt 序列 / verdict / checklist 展开内容
statusReason: Unable to find an element with the text: 问题清晰. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="mb-3 flex flex-wrap items-center gap-2.5"

[Killed] ConditionalExpression
src/views/changes/ChangeDetailView.tsx:63:8
           {record.backtrackReason !== null && `：${record.backtrackReason}`}
         </div>
       )}
-      {record.checklist.length > 0 && (
-        <ul className="m-0 mt-1.5 list-none p-0" data-testid="checklist">
-          {record.checklist.map((entry, index) => (
-            <li key={index} className="flex items-baseline gap-2 py-[3px]">
-              <Badge variant={entry.pass ? 'pass' : 'fail'} data-testid="checklist-verdict">
-                {entry.pass ? 'pass' : 'fail'}
-              </Badge>
-              <div>
-                <div className="border-b border-dashed border-border py-1">{entry.item}</div>
-                <div className="break-words text-xs text-muted-foreground">{entry.evidence}</div>
-              </div>
-            </li>
-          ))}
-        </ul>
-      )}
+      {true}
     </div>
   );
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 9 站流水线渲染 attempt 序列 / verdict / checklist 展开内容
statusReason: Unable to find an element with the text: 问题清晰. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="mb-3 flex flex-wrap items-center gap-2.5"

[Killed] ArrowFunction
src/views/changes/ChangeDetailView.tsx:65:33
       )}
       {record.checklist.length > 0 && (
         <ul className="m-0 mt-1.5 list-none p-0" data-testid="checklist">
-          {record.checklist.map((entry, index) => (
-            <li key={index} className="flex items-baseline gap-2 py-[3px]">
-              <Badge variant={entry.pass ? 'pass' : 'fail'} data-testid="checklist-verdict">
-                {entry.pass ? 'pass' : 'fail'}
-              </Badge>
-              <div>
-                <div className="border-b border-dashed border-border py-1">{entry.item}</div>
-                <div className="break-words text-xs text-muted-foreground">{entry.evidence}</div>
-              </div>
-            </li>
-          ))}
+          {record.checklist.map(() => undefined)}
         </ul>
       )}
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 9 站流水线渲染 attempt 序列 / verdict / checklist 展开内容
statusReason: Unable to find an element with the text: 问题清晰. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="mb-3 flex flex-wrap items-center gap-2.5"

[Survived] StringLiteral
src/views/changes/ChangeDetailView.tsx:67:44
         <ul className="m-0 mt-1.5 list-none p-0" data-testid="checklist">
           {record.checklist.map((entry, index) => (
             <li key={index} className="flex items-baseline gap-2 py-[3px]">
-              <Badge variant={entry.pass ? 'pass' : 'fail'} data-testid="checklist-verdict">
+              <Badge variant={entry.pass ? "" : 'fail'} data-testid="checklist-verdict">
                 {entry.pass ? 'pass' : 'fail'}
               </Badge>

[Killed] StringLiteral
src/views/changes/ChangeDetailView.tsx:68:40
           {record.checklist.map((entry, index) => (
             <li key={index} className="flex items-baseline gap-2 py-[3px]">
               <Badge variant={entry.pass ? 'pass' : 'fail'} data-testid="checklist-verdict">
-                {entry.pass ? 'pass' : 'fail'}
+                {entry.pass ? 'pass' : ""}
               </Badge>
               <div>
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 checklist 条目渲染 item 名与 evidence 文本
statusReason: expected '' to be 'fail' // Object.is equality

[Killed] StringLiteral
src/views/changes/ChangeDetailView.tsx:68:31
           {record.checklist.map((entry, index) => (
             <li key={index} className="flex items-baseline gap-2 py-[3px]">
               <Badge variant={entry.pass ? 'pass' : 'fail'} data-testid="checklist-verdict">
-                {entry.pass ? 'pass' : 'fail'}
+                {entry.pass ? "" : 'fail'}
               </Badge>
               <div>
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 9 站流水线渲染 attempt 序列 / verdict / checklist 展开内容
statusReason: expected '' to be 'pass' // Object.is equality

[Killed] BlockStatement
src/views/changes/ChangeDetailView.tsx:82:52
   );
 }
 
-function Station({ entry }: { entry: PhaseEntry }) {
-  return (
-    <div className="mb-3.5">
-      <div className="flex items-center gap-2 font-semibold">
-        <span>{entry.phase}</span>
-        <span className="text-muted-foreground">({entry.attempts.length} 次尝试)</span>
-      </div>
-      {entry.attempts.length === 0 ? (
-        <div className="text-muted-foreground">（无记录）</div>
-      ) : (
-        entry.attempts.map((record, index) => <Attempt key={index} record={record} />)
-      )}
-    </div>
-  );
-}
+function Station({ entry }: { entry: PhaseEntry }) {}
 
 function DetailSectionInterupted({ interrupted }: { interrupted: ChangeDetail['interrupted'] }) {
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 9 站流水线渲染 attempt 序列 / verdict / checklist 展开内容
statusReason: Unable to find an element with the text: proposal. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="mb-3 flex flex-wrap items-center gap-2.5"

[Killed] EqualityOperator
src/views/changes/ChangeDetailView.tsx:89:8
         <span>{entry.phase}</span>
         <span className="text-muted-foreground">({entry.attempts.length} 次尝试)</span>
       </div>
-      {entry.attempts.length === 0 ? (
+      {entry.attempts.length !== 0 ? (
         <div className="text-muted-foreground">（无记录）</div>
       ) : (
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 9 站流水线渲染 attempt 序列 / verdict / checklist 展开内容
statusReason: Unable to find an element with the text: 提案评估通过. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="mb-3 flex flex-wrap items-center gap-2.5"

[Killed] BlockStatement
src/views/changes/ChangeDetailView.tsx:98:97
   );
 }
 
-function DetailSectionInterupted({ interrupted }: { interrupted: ChangeDetail['interrupted'] }) {
-  return (
-    <section className="mb-4 rounded-lg border border-border bg-card px-4 py-3.5">
-      <h2 className="m-0 mb-2.5 text-[15px]">中断留档</h2>
-      {interrupted.map((entry, index) => (
-        <div className="my-2 ml-1 border-l-[3px] border-border py-1.5 pl-3" key={index}>
-          <div className="mb-1 flex flex-wrap items-center gap-2 text-xs text-muted-foreground">
-            <span>{entry.phase}</span>
-            <span>attempt {entry.attempt}</span>
-            <span>start: {formatTime(entry.startAt)}</span>
-            <span>end: {formatTime(entry.endAt)}</span>
-          </div>
-        </div>
-      ))}
-    </section>
-  );
-}
+function DetailSectionInterupted({ interrupted }: { interrupted: ChangeDetail['interrupted'] }) {}
 
 function DetailSectionFileList({ detail }: { detail: ChangeDetail }) {
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 中断留档区块渲染条目，空缺时间显示占位符
statusReason: Unable to find an element with the text: 中断留档. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="mb-3 flex flex-wrap items-center gap-2.5"

[Killed] ArrowFunction
src/views/changes/ChangeDetailView.tsx:102:24
   return (
     <section className="mb-4 rounded-lg border border-border bg-card px-4 py-3.5">
       <h2 className="m-0 mb-2.5 text-[15px]">中断留档</h2>
-      {interrupted.map((entry, index) => (
-        <div className="my-2 ml-1 border-l-[3px] border-border py-1.5 pl-3" key={index}>
-          <div className="mb-1 flex flex-wrap items-center gap-2 text-xs text-muted-foreground">
-            <span>{entry.phase}</span>
-            <span>attempt {entry.attempt}</span>
-            <span>start: {formatTime(entry.startAt)}</span>
-            <span>end: {formatTime(entry.endAt)}</span>
-          </div>
-        </div>
-      ))}
+      {interrupted.map(() => undefined)}
     </section>
   );
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 中断留档区块渲染条目，空缺时间显示占位符
statusReason: expected '← 返回列表刷新详情add-featurev2进行中2026-09-01流…' to contain 'start: 2026-09-02T00:00:00Z'

[Killed] EqualityOperator
src/views/changes/ChangeDetailView.tsx:120:8
   return (
     <section className="mb-4 rounded-lg border border-border bg-card px-4 py-3.5">
       <h2 className="m-0 mb-2.5 text-[15px]">文件清单 (file_log)</h2>
-      {detail.fileLog === null ? (
+      {detail.fileLog !== null ? (
         <div className="text-muted-foreground">（无 file_log 数据：v1 及更早代际无此字段）</div>
       ) : detail.fileLog.length === 0 ? (
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 v0 change（空流水线 + 纯文档产物清单）以纯文档形态呈现
statusReason: Cannot read properties of null (reading 'length')

[Killed] ConditionalExpression
src/views/changes/ChangeDetailView.tsx:120:8
   return (
     <section className="mb-4 rounded-lg border border-border bg-card px-4 py-3.5">
       <h2 className="m-0 mb-2.5 text-[15px]">文件清单 (file_log)</h2>
-      {detail.fileLog === null ? (
+      {false ? (
         <div className="text-muted-foreground">（无 file_log 数据：v1 及更早代际无此字段）</div>
       ) : detail.fileLog.length === 0 ? (
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 v0 change（空流水线 + 纯文档产物清单）以纯文档形态呈现
statusReason: Cannot read properties of null (reading 'length')

[Killed] ConditionalExpression
src/views/changes/ChangeDetailView.tsx:122:11
       <h2 className="m-0 mb-2.5 text-[15px]">文件清单 (file_log)</h2>
       {detail.fileLog === null ? (
         <div className="text-muted-foreground">（无 file_log 数据：v1 及更早代际无此字段）</div>
-      ) : detail.fileLog.length === 0 ? (
+      ) : false ? (
         <div className="text-muted-foreground">（空）</div>
       ) : (
killedBy: filelog Table 语义结构：行列矩阵完整、空缺占位 fileLog 为空数组：渲染（空）占位且无 Table 结构
statusReason: Unable to find an element with the text: （空）. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="mb-3 flex flex-wrap items-center gap-2.5"

[Killed] ConditionalExpression
src/views/changes/ChangeDetailView.tsx:122:11
       <h2 className="m-0 mb-2.5 text-[15px]">文件清单 (file_log)</h2>
       {detail.fileLog === null ? (
         <div className="text-muted-foreground">（无 file_log 数据：v1 及更早代际无此字段）</div>
-      ) : detail.fileLog.length === 0 ? (
+      ) : true ? (
         <div className="text-muted-foreground">（空）</div>
       ) : (
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 file_log 条目以表格逐行渲染，attempt 与时间空缺显示占位符
statusReason: Unable to find an element by: [data-testid="filelog-table"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="mb-3 flex flex-wrap items-center gap-2.5"

[Killed] ArrowFunction
src/views/changes/ChangeDetailView.tsx:136:33
             </TableRow>
           </TableHeader>
           <TableBody>
-            {detail.fileLog.map((entry, index) => (
-              <TableRow key={index}>
-                <TableCell>{entry.op}</TableCell>
-                <TableCell>{entry.scope}</TableCell>
-                <TableCell>{entry.attempt ?? '—'}</TableCell>
-                <TableCell>{entry.path}</TableCell>
-                <TableCell>{formatTime(entry.at)}</TableCell>
-              </TableRow>
-            ))}
+            {detail.fileLog.map(() => undefined)}
           </TableBody>
         </Table>
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 file_log 条目以表格逐行渲染，attempt 与时间空缺显示占位符
statusReason: expected [ …(1) ] to have a length of 3 but got 1

[Killed] LogicalOperator
src/views/changes/ChangeDetailView.tsx:140:29
               <TableRow key={index}>
                 <TableCell>{entry.op}</TableCell>
                 <TableCell>{entry.scope}</TableCell>
-                <TableCell>{entry.attempt ?? '—'}</TableCell>
+                <TableCell>{entry.attempt && '—'}</TableCell>
                 <TableCell>{entry.path}</TableCell>
                 <TableCell>{formatTime(entry.at)}</TableCell>
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 file_log 条目以表格逐行渲染，attempt 与时间空缺显示占位符
statusReason: expected [ 'write', 'workflow', '—', …(2) ] to deeply equal [ 'write', 'workflow', '3', …(2) ]

[Killed] StringLiteral
src/views/changes/ChangeDetailView.tsx:140:46
               <TableRow key={index}>
                 <TableCell>{entry.op}</TableCell>
                 <TableCell>{entry.scope}</TableCell>
-                <TableCell>{entry.attempt ?? '—'}</TableCell>
+                <TableCell>{entry.attempt ?? ""}</TableCell>
                 <TableCell>{entry.path}</TableCell>
                 <TableCell>{formatTime(entry.at)}</TableCell>
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 file_log 条目以表格逐行渲染，attempt 与时间空缺显示占位符
statusReason: expected [ 'delete', 'files', '', …(2) ] to deeply equal [ 'delete', 'files', '—', …(2) ]

[Killed] BlockStatement
src/views/changes/ChangeDetailView.tsx:162:4
   loading: boolean;
   onBack: () => void;
   refresh: () => void;
-}) {
-  return (
-    <div className="mb-3 flex flex-wrap items-center gap-2.5" data-testid="detail-header">
-      <Button onClick={onBack}>← 返回列表</Button>
-      <Button onClick={refresh} disabled={loading}>
-        刷新详情
-      </Button>
-      <h2 className="m-0 break-all text-[17px]">{detail.name}</h2>
-      <Badge variant={INVENTORY_VARIANT[detail.inventory]}>{detail.inventory}</Badge>
-      <span className="text-muted-foreground">
-        {detail.source === 'archive' ? '已归档' : '进行中'}
-      </span>
-      {detail.created !== null && <span className="text-muted-foreground">{detail.created}</span>}
-      {detail.activePhase !== null && (
-        <Badge variant="active">
-          运行中 · {detail.activePhase.phase} · attempt {detail.activePhase.attempt}
-          {detail.activePhase.startAt !== null && ` · ${formatTime(detail.activePhase.startAt)}`}
-        </Badge>
-      )}
-    </div>
-  );
-}
+}) {}
 
 function DetailSectionPipeline({
killedBy: ChangeDetailView：9 站流水线、运行标示、降级区块与产物区 active_phase 存在时渲染运行中标示；backtrack_to / backtrack_reason 随条目展示
statusReason: Unable to find an element with the text: 运行中 · implement · attempt 2 · 2026-09-02T01:00:00Z. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <section
        class="mb-4 rounded-lg border border-border bg-card px

[Killed] ConditionalExpression
src/views/changes/ChangeDetailView.tsx:172:10
       <h2 className="m-0 break-all text-[17px]">{detail.name}</h2>
       <Badge variant={INVENTORY_VARIANT[detail.inventory]}>{detail.inventory}</Badge>
       <span className="text-muted-foreground">
-        {detail.source === 'archive' ? '已归档' : '进行中'}
+        {true ? '已归档' : '进行中'}
       </span>
       {detail.created !== null && <span className="text-muted-foreground">{detail.created}</span>}
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 头部按 source / created / inventory 渲染元信息
statusReason: Unable to find an element with the text: 进行中. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="mb-3 flex flex-wrap items-center gap-2.5"

[Killed] ConditionalExpression
src/views/changes/ChangeDetailView.tsx:172:10
       <h2 className="m-0 break-all text-[17px]">{detail.name}</h2>
       <Badge variant={INVENTORY_VARIANT[detail.inventory]}>{detail.inventory}</Badge>
       <span className="text-muted-foreground">
-        {detail.source === 'archive' ? '已归档' : '进行中'}
+        {false ? '已归档' : '进行中'}
       </span>
       {detail.created !== null && <span className="text-muted-foreground">{detail.created}</span>}
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 头部按 source / created / inventory 渲染元信息
statusReason: expected '← 返回列表刷新详情add-featurev2进行中流水线proposal…' to contain '已归档'

[Killed] ConditionalExpression
src/views/changes/ChangeDetailView.tsx:174:8
       <span className="text-muted-foreground">
         {detail.source === 'archive' ? '已归档' : '进行中'}
       </span>
-      {detail.created !== null && <span className="text-muted-foreground">{detail.created}</span>}
+      {false}
       {detail.activePhase !== null && (
         <Badge variant="active">
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 头部按 source / created / inventory 渲染元信息
statusReason: expected '← 返回列表刷新详情add-featurev2进行中流水线proposal…' to contain '2026-09-01'

[Killed] EqualityOperator
src/views/changes/ChangeDetailView.tsx:174:8
       <span className="text-muted-foreground">
         {detail.source === 'archive' ? '已归档' : '进行中'}
       </span>
-      {detail.created !== null && <span className="text-muted-foreground">{detail.created}</span>}
+      {detail.created === null && <span className="text-muted-foreground">{detail.created}</span>}
       {detail.activePhase !== null && (
         <Badge variant="active">
killedBy: ChangeDetailView：标记位、backtrack 组合、区块分支与头部元信息 头部按 source / created / inventory 渲染元信息
statusReason: expected '← 返回列表刷新详情add-featurev2进行中流水线proposal…' to contain '2026-09-01'
