[Killed] BlockStatement
src/renderers/ArtifactView.tsx:7:76
 import { resolveRenderer } from './registry';
 
 /** 信封路由组件：按 resolveRenderer(kind) 渲染单个 ArtifactEnvelope */
-export function ArtifactView({ envelope }: { envelope: ArtifactEnvelope }) {
-  const Renderer = resolveRenderer(envelope.kind);
-  return (
-    <section
-      className="mb-3 rounded-lg border border-border bg-card px-3.5 py-3"
-      data-testid="artifact-card"
-    >
-      <header className="mb-2 flex items-center gap-2">
-        <Badge variant="kind" data-testid="artifact-kind">
-          {envelope.kind}
-        </Badge>
-        <h3 className="m-0 text-sm">{envelope.title}</h3>
-        <span className="text-xs text-muted-foreground" data-testid="artifact-version">
-          v{envelope.version}
-        </span>
-      </header>
-      <Renderer envelope={envelope} />
-    </section>
-  );
-}
+export function ArtifactView({ envelope }: { envelope: ArtifactEnvelope }) {}
 
killedBy: ipc 管线：列表到详情与产物渲染 进入详情后 get_change_detail + N 次 read_artifact 的调用序列与产物清单一致
statusReason: Unable to find an element with the text: 提案正文. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <header
      class="flex flex-wrap items-center gap-3 border-b border-border bg-card px-4 py-2.5"
    >
