[Killed] BlockStatement
src/lib/utils.ts:5:53
 import { twMerge } from 'tailwind-merge';
 
 /** Tailwind 类名组合与冲突消解：clsx 条件拼接 + tailwind-merge 去重（shadcn canonical 工具） */
-export function cn(...inputs: ClassValue[]): string {
-  return twMerge(clsx(inputs));
-}
+export function cn(...inputs: ClassValue[]): string {}
 
killedBy: Badge 变体全枚举渲染：INVENTORY_VARIANT 三键全命中 inventory 运行时漂移值：不崩、不产模板串类名，回退 Badge 默认变体
statusReason: expected '' to contain 'bg-gray-200'
