[Killed] BlockStatement
src/renderers/MarkdownDocRenderer.tsx:24:48
  * 裸元素后代样式由 @tailwindcss/typography 的 prose 承载（prose-* modifier 对齐原观感），
  * 不再存在 .markdown-doc 后代选择器（AC-7）。 */
 export function MarkdownDocRenderer({ envelope }: { envelope: ArtifactEnvelope }) {
-  if (!isMarkdownDocPayload(envelope.payload)) {
-    return (
-      <pre
-        className="m-0 max-h-[320px] overflow-auto whitespace-pre-wrap break-words rounded-md bg-background px-2.5 py-2 text-xs text-foreground"
-        data-testid="fallback-text"
-      >
-        {envelope.fallbackText ?? '（无 markdown 内容）'}
-      </pre>
-    );
-  }
+  if (!isMarkdownDocPayload(envelope.payload)) {}
   return (
     <div
killedBy: MarkdownDocRenderer：payload.markdown 的收窄与渲染组装 payload 缺 markdown 字段时降级为 fallback_text，不抛错
statusReason: Unable to find an element with the text: 保底：原文内容。. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="markdown-root"

[Killed] ConditionalExpression
src/renderers/MarkdownDocRenderer.tsx:24:7
  * 裸元素后代样式由 @tailwindcss/typography 的 prose 承载（prose-* modifier 对齐原观感），
  * 不再存在 .markdown-doc 后代选择器（AC-7）。 */
 export function MarkdownDocRenderer({ envelope }: { envelope: ArtifactEnvelope }) {
-  if (!isMarkdownDocPayload(envelope.payload)) {
+  if (true) {
     return (
       <pre
killedBy: MarkdownDocRenderer：payload.markdown 的收窄与渲染组装 payload.markdown 为字符串时渲染出内容节点
statusReason: Unable to find an element with the text: 提案标题. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <pre
      class="m-0 max-h-[320px] overflow-auto whitespace-pre-wrap break-words rounded-md bg-background px-2.5 py-2 text-xs te

[Killed] LogicalOperator
src/renderers/MarkdownDocRenderer.tsx:30:10
         className="m-0 max-h-[320px] overflow-auto whitespace-pre-wrap break-words rounded-md bg-background px-2.5 py-2 text-xs text-foreground"
         data-testid="fallback-text"
       >
-        {envelope.fallbackText ?? '（无 markdown 内容）'}
+        {envelope.fallbackText && '（无 markdown 内容）'}
       </pre>
     );
killedBy: MarkdownDocRenderer：payload.markdown 的收窄与渲染组装 payload 缺 markdown 字段时降级为 fallback_text，不抛错
statusReason: Unable to find an element with the text: 保底：原文内容。. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <pre
      class="m-0 max-h-[320px] overflow-auto whitespace-pre-wrap break-words rounded-md bg-background px-2.5 py-2 text-x
