[Killed] ConditionalExpression
src/renderers/TasksProgressRenderer.tsx:14:10
 }
 
 function countOf(value: unknown): number {
-  return typeof value === 'number' && Number.isFinite(value) && value >= 0 ? value : 0;
+  return true ? value : 0;
 }
 
killedBy: TasksProgressRenderer：total / done / pending 进度渲染 payload 缺字段（undefined 计数）时不抛错，按 0 处理且无 indeterminate 形态
statusReason: Unable to find an element with the text: 共 0. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        aria-valuemax="100"

[Killed] BlockStatement
src/renderers/TasksProgressRenderer.tsx:23:85
 }
 
 /** tasks-progress renderer：total / done / pending 进度渲染 */
-export function TasksProgressRenderer({ envelope }: { envelope: ArtifactEnvelope }) {
-  const payload = isTasksProgressPayload(envelope.payload) ? envelope.payload : undefined;
-  const total = countOf(payload?.total);
-  const done = countOf(payload?.done);
-  const pending = countOf(payload?.pending);
-  // total 为 0 时无进度可言，直接 0%
-  const percent = total > 0 ? Math.round((done / total) * 100) : 0;
-  return (
-    <div>
-      <Progress value={percent} className="my-2" data-testid="progress" />
-      <div className="flex gap-4 text-[13px] text-muted-foreground">
-        <span>{percent}%</span>
-        <span>已完成 {done}</span>
-        <span>待办 {pending}</span>
-        <span>共 {total}</span>
-      </div>
-    </div>
-  );
-}
+export function TasksProgressRenderer({ envelope }: { envelope: ArtifactEnvelope }) {}
 
killedBy: ipc 管线：列表到详情与产物渲染 三 kind 信封分别路由到对应 renderer 并渲染 payload
statusReason: Unable to find an element with the text: 25%. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <header
      class="flex flex-wrap items-center gap-3 border-b border-border bg-card px-4 py-2.5"
    >

[Killed] ConditionalExpression
src/renderers/TasksProgressRenderer.tsx:29:19
   const done = countOf(payload?.done);
   const pending = countOf(payload?.pending);
   // total 为 0 时无进度可言，直接 0%
-  const percent = total > 0 ? Math.round((done / total) * 100) : 0;
+  const percent = true ? Math.round((done / total) * 100) : 0;
   return (
     <div>
killedBy: ipc 管线：DTO 漂移与读取失败的降级兜底 单个 read_artifact reject 时该产物降级呈现且不阻断详情主体
statusReason: Unable to find an element with the text: 0%. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <header
      class="flex flex-wrap items-center gap-3 border-b border-border bg-card px-4 py-2.5"
    >

[Killed] ConditionalExpression
src/renderers/TasksProgressRenderer.tsx:29:19
   const done = countOf(payload?.done);
   const pending = countOf(payload?.pending);
   // total 为 0 时无进度可言，直接 0%
-  const percent = total > 0 ? Math.round((done / total) * 100) : 0;
+  const percent = false ? Math.round((done / total) * 100) : 0;
   return (
     <div>
killedBy: ipc 管线：列表到详情与产物渲染 三 kind 信封分别路由到对应 renderer 并渲染 payload
statusReason: Unable to find an element with the text: 25%. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <header
      class="flex flex-wrap items-center gap-3 border-b border-border bg-card px-4 py-2.5"
    >
