[Survived] ArithmeticOperator
views/agent/hooks/useAgentRunHistory.ts:37:52
   const [query, setQuery] = useState<QueryState>(IDLE);
   const [tick, setTick] = useState(0);
 
-  const refresh = useCallback(() => setTick((t) => t + 1), []);
+  const refresh = useCallback(() => setTick((t) => t - 1), []);
 
   useEffect(() => {

[Killed] BlockStatement
views/agent/hooks/useAgentRunHistory.ts:39:19
 
   const refresh = useCallback(() => setTick((t) => t + 1), []);
 
-  useEffect(() => {
-    if (tick === 0) return;
-    let cancelled = false;
-    setQuery({ loading: true, error: null });
-    invoke<AgentRunRecord[]>('agent_runs')
-      .then((result) => {
-        if (cancelled) return;
-        setRuns(result);
-        setQuery(IDLE);
-      })
-      .catch((err: unknown) => {
-        if (cancelled) return;
-        setQuery({ loading: false, error: String(err) });
-      });
-    return () => {
-      cancelled = true;
-    };
-  }, [tick]);
+  useEffect(() => {}, [tick]);
 
   return { runs, query, refresh };
killedBy: useAgentRunHistory：显式刷新与点开重放 refresh() → invoke("agent_runs") → runs 按后端降序原样承接
statusReason: expected [] to deeply equal [ …(2) ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
views/agent/hooks/useAgentRunHistory.ts:40:9
   const refresh = useCallback(() => setTick((t) => t + 1), []);
 
   useEffect(() => {
-    if (tick === 0) return;
+    if (true) return;
     let cancelled = false;
     setQuery({ loading: true, error: null });
killedBy: useAgentRunHistory：显式刷新与点开重放 refresh() → invoke("agent_runs") → runs 按后端降序原样承接
statusReason: expected [] to deeply equal [ …(2) ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] EqualityOperator
views/agent/hooks/useAgentRunHistory.ts:40:9
   const refresh = useCallback(() => setTick((t) => t + 1), []);
 
   useEffect(() => {
-    if (tick === 0) return;
+    if (tick !== 0) return;
     let cancelled = false;
     setQuery({ loading: true, error: null });
killedBy: useAgentRunHistory：显式刷新与点开重放 挂载不自动取数：不发起任何 invoke
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] BooleanLiteral
views/agent/hooks/useAgentRunHistory.ts:41:21
 
   useEffect(() => {
     if (tick === 0) return;
-    let cancelled = false;
+    let cancelled = true;
     setQuery({ loading: true, error: null });
     invoke<AgentRunRecord[]>('agent_runs')
killedBy: useAgentRunHistory：显式刷新与点开重放 refresh() → invoke("agent_runs") → runs 按后端降序原样承接
statusReason: expected [] to deeply equal [ …(2) ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
views/agent/hooks/useAgentRunHistory.ts:42:25
   useEffect(() => {
     if (tick === 0) return;
     let cancelled = false;
-    setQuery({ loading: true, error: null });
+    setQuery({ loading: false, error: null });
     invoke<AgentRunRecord[]>('agent_runs')
       .then((result) => {
killedBy: useAgentRunHistory：显式刷新与点开重放 取数进行中 loading=true、返回后复位；两轨道任一取数中即 loading
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
views/agent/hooks/useAgentRunHistory.ts:44:25
     let cancelled = false;
     setQuery({ loading: true, error: null });
     invoke<AgentRunRecord[]>('agent_runs')
-      .then((result) => {
-        if (cancelled) return;
-        setRuns(result);
-        setQuery(IDLE);
-      })
+      .then((result) => {})
       .catch((err: unknown) => {
         if (cancelled) return;
killedBy: useAgentRunHistory：显式刷新与点开重放 refresh() → invoke("agent_runs") → runs 按后端降序原样承接
statusReason: expected [] to deeply equal [ …(2) ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
views/agent/hooks/useAgentRunHistory.ts:49:32
         setRuns(result);
         setQuery(IDLE);
       })
-      .catch((err: unknown) => {
-        if (cancelled) return;
-        setQuery({ loading: false, error: String(err) });
-      });
+      .catch((err: unknown) => {});
     return () => {
       cancelled = true;
killedBy: useAgentRunHistory：显式刷新与点开重放 refresh reject：error 置串、loading 复位（显式触发失败不静默）
statusReason: expected null to be 'db: 清单打开失败' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
views/agent/hooks/useAgentRunHistory.ts:51:29
       })
       .catch((err: unknown) => {
         if (cancelled) return;
-        setQuery({ loading: false, error: String(err) });
+        setQuery({ loading: true, error: String(err) });
       });
     return () => {
killedBy: useAgentRunHistory：显式刷新与点开重放 refresh reject：error 置串、loading 复位（显式触发失败不静默）
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
views/agent/hooks/useAgentRunHistory.ts:51:18
       })
       .catch((err: unknown) => {
         if (cancelled) return;
-        setQuery({ loading: false, error: String(err) });
+        setQuery({});
       });
     return () => {
killedBy: useAgentRunHistory：显式刷新与点开重放 refresh reject：error 置串、loading 复位（显式触发失败不静默）
statusReason: expected null to be 'db: 清单打开失败' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ArrayDeclaration
views/agent/hooks/useAgentRunHistory.ts:56:6
     return () => {
       cancelled = true;
     };
-  }, [tick]);
+  }, []);
 
   return { runs, query, refresh };
killedBy: agent_run_pipeline：历史重放链 → 共用时间线还原 refresh → agent_runs 列表呈现状态/时间/摘要；点开 → agent_run_events { runId } → 共用时间线还原（含 Raw 与实时路径同形态）
statusReason: Unable to find an element by: [data-testid="agent-run-row"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <section
        class="mb-4 rounded-lg border border-border bg-card px-4 py-3.5"

[Killed] ArrowFunction
views/agent/hooks/useAgentRunHistory.ts:76:31
   const [query, setQuery] = useState<QueryState>(IDLE);
   const [target, setTarget] = useState<number | null>(null);
 
-  const openRun = useCallback((runId: number) => setTarget(runId), []);
+  const openRun = useCallback(() => undefined, []);
 
   useEffect(() => {
killedBy: useAgentRunHistory：显式刷新与点开重放 openRun(id) → invoke("agent_run_events", { runId }) → events 更新、selectedRunId 跟随
statusReason: expected [] to deeply equal [ { seq: +0, …(6) }, { seq: 1, …(4) } ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Survived] ArrayDeclaration
views/agent/hooks/useAgentRunHistory.ts:76:68
   const [query, setQuery] = useState<QueryState>(IDLE);
   const [target, setTarget] = useState<number | null>(null);
 
-  const openRun = useCallback((runId: number) => setTarget(runId), []);
+  const openRun = useCallback((runId: number) => setTarget(runId), ["Stryker was here"]);
 
   useEffect(() => {

[Killed] BlockStatement
views/agent/hooks/useAgentRunHistory.ts:78:19
 
   const openRun = useCallback((runId: number) => setTarget(runId), []);
 
-  useEffect(() => {
-    if (target === null) return;
-    let cancelled = false;
-    setQuery({ loading: true, error: null });
-    invoke<AgentEvent[]>('agent_run_events', { runId: target })
-      .then((result) => {
-        if (cancelled) return;
-        setEvents(result);
-        setSelectedRunId(target);
-        setQuery(IDLE);
-      })
-      .catch((err: unknown) => {
-        if (cancelled) return;
-        setQuery({ loading: false, error: String(err) });
-      });
-    return () => {
-      cancelled = true;
-    };
-  }, [target]);
+  useEffect(() => {}, [target]);
 
   return { events, selectedRunId, query, openRun };
killedBy: agent_run_pipeline：历史重放链 → 共用时间线还原 refresh → agent_runs 列表呈现状态/时间/摘要；点开 → agent_run_events { runId } → 共用时间线还原（含 Raw 与实时路径同形态）
statusReason: expected "vi.fn()" to be called with arguments: [ 'agent_run_events', { runId: 3 } ]

Received:

  1st vi.fn() call:

  [
-   "agent_run_events",

[Killed] ConditionalExpression
views/agent/hooks/useAgentRunHistory.ts:79:9
   const openRun = useCallback((runId: number) => setTarget(runId), []);
 
   useEffect(() => {
-    if (target === null) return;
+    if (true) return;
     let cancelled = false;
     setQuery({ loading: true, error: null });
killedBy: useAgentRunHistory：显式刷新与点开重放 openRun(id) → invoke("agent_run_events", { runId }) → events 更新、selectedRunId 跟随
statusReason: expected [] to deeply equal [ { seq: +0, …(6) }, { seq: 1, …(4) } ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
views/agent/hooks/useAgentRunHistory.ts:79:9
   const openRun = useCallback((runId: number) => setTarget(runId), []);
 
   useEffect(() => {
-    if (target === null) return;
+    if (false) return;
     let cancelled = false;
     setQuery({ loading: true, error: null });
killedBy: useAgentRunHistory：显式刷新与点开重放 挂载不自动取数：不发起任何 invoke
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] BooleanLiteral
views/agent/hooks/useAgentRunHistory.ts:80:21
 
   useEffect(() => {
     if (target === null) return;
-    let cancelled = false;
+    let cancelled = true;
     setQuery({ loading: true, error: null });
     invoke<AgentEvent[]>('agent_run_events', { runId: target })
killedBy: useAgentRunHistory：显式刷新与点开重放 openRun(id) → invoke("agent_run_events", { runId }) → events 更新、selectedRunId 跟随
statusReason: expected [] to deeply equal [ { seq: +0, …(6) }, { seq: 1, …(4) } ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ObjectLiteral
views/agent/hooks/useAgentRunHistory.ts:82:46
     if (target === null) return;
     let cancelled = false;
     setQuery({ loading: true, error: null });
-    invoke<AgentEvent[]>('agent_run_events', { runId: target })
+    invoke<AgentEvent[]>('agent_run_events', {})
       .then((result) => {
         if (cancelled) return;
killedBy: useAgentRunHistory：显式刷新与点开重放 openRun(id) → invoke("agent_run_events", { runId }) → events 更新、selectedRunId 跟随
statusReason: expected [] to deeply equal [ { seq: +0, …(6) }, { seq: 1, …(4) } ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
views/agent/hooks/useAgentRunHistory.ts:83:25
     let cancelled = false;
     setQuery({ loading: true, error: null });
     invoke<AgentEvent[]>('agent_run_events', { runId: target })
-      .then((result) => {
-        if (cancelled) return;
-        setEvents(result);
-        setSelectedRunId(target);
-        setQuery(IDLE);
-      })
+      .then((result) => {})
       .catch((err: unknown) => {
         if (cancelled) return;
killedBy: useAgentRunHistory：显式刷新与点开重放 openRun(id) → invoke("agent_run_events", { runId }) → events 更新、selectedRunId 跟随
statusReason: expected [] to deeply equal [ { seq: +0, …(6) }, { seq: 1, …(4) } ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ArrayDeclaration
views/agent/hooks/useAgentRunHistory.ts:96:6
     return () => {
       cancelled = true;
     };
-  }, [target]);
+  }, []);
 
   return { events, selectedRunId, query, openRun };
killedBy: useAgentRunHistory：显式刷新与点开重放 openRun(id) → invoke("agent_run_events", { runId }) → events 更新、selectedRunId 跟随
statusReason: expected [] to deeply equal [ { seq: +0, …(6) }, { seq: 1, …(4) } ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ObjectLiteral
views/agent/hooks/useAgentRunHistory.ts:98:10
     };
   }, [target]);
 
-  return { events, selectedRunId, query, openRun };
+  return {};
 }
 
killedBy: useAgentRunHistory：显式刷新与点开重放 挂载不自动取数：不发起任何 invoke
statusReason: Cannot read properties of undefined (reading 'loading')

[Killed] BlockStatement
views/agent/hooks/useAgentRunHistory.ts:106:60
  * openRun(id) 重放事件；挂载不自动取数、run 结束不自动刷新（design：查询
  * 取数显式触发，Channel 例外不外溢）、无轮询。
  */
-export function useAgentRunHistory(): AgentRunHistoryState {
-  const runsState = useRuns();
-  const replayState = useReplay();
-  return {
-    runs: runsState.runs,
-    events: replayState.events,
-    selectedRunId: replayState.selectedRunId,
-    loading: runsState.query.loading || replayState.query.loading,
-    error: runsState.query.error ?? replayState.query.error,
-    refresh: runsState.refresh,
-    openRun: replayState.openRun,
-  };
-}
+export function useAgentRunHistory(): AgentRunHistoryState {}
 
killedBy: useAgentRunHistory：显式刷新与点开重放 refresh() → invoke("agent_runs") → runs 按后端降序原样承接
statusReason: Cannot read properties of undefined (reading 'refresh')

[Killed] ConditionalExpression
views/agent/hooks/useAgentRunHistory.ts:113:14
     runs: runsState.runs,
     events: replayState.events,
     selectedRunId: replayState.selectedRunId,
-    loading: runsState.query.loading || replayState.query.loading,
+    loading: true,
     error: runsState.query.error ?? replayState.query.error,
     refresh: runsState.refresh,
killedBy: useAgentRunHistory：显式刷新与点开重放 refresh() → invoke("agent_runs") → runs 按后端降序原样承接
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
views/agent/hooks/useAgentRunHistory.ts:113:14
     runs: runsState.runs,
     events: replayState.events,
     selectedRunId: replayState.selectedRunId,
-    loading: runsState.query.loading || replayState.query.loading,
+    loading: false,
     error: runsState.query.error ?? replayState.query.error,
     refresh: runsState.refresh,
killedBy: useAgentRunHistory：显式刷新与点开重放 取数进行中 loading=true、返回后复位；两轨道任一取数中即 loading
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] LogicalOperator
views/agent/hooks/useAgentRunHistory.ts:114:12
     events: replayState.events,
     selectedRunId: replayState.selectedRunId,
     loading: runsState.query.loading || replayState.query.loading,
-    error: runsState.query.error ?? replayState.query.error,
+    error: runsState.query.error && replayState.query.error,
     refresh: runsState.refresh,
     openRun: replayState.openRun,
killedBy: useAgentRunHistory：显式刷新与点开重放 refresh reject：error 置串、loading 复位（显式触发失败不静默）
statusReason: expected null to be 'db: 清单打开失败' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>
