[Killed] StringLiteral
src/components/AppSidebar.tsx:44:66
 
 /** root 去掉最后一段的完整前缀（最后一个 / 或 \ 之前）；无分隔符返回空串（design D3） */
 function parentDir(root: string): string {
-  const index = Math.max(root.lastIndexOf('/'), root.lastIndexOf('\\'));
+  const index = Math.max(root.lastIndexOf('/'), root.lastIndexOf(""));
   return index === -1 ? '' : root.slice(0, index);
 }
killedBy: AppSidebar：Tooltip 与副文本 同名不同父两项：data-root 定位后 within() 取 workspace-sub，副文本各为父目录（D3 区分能力）
statusReason: expected 'C:\a\plugin' to be 'C:\a' // Object.is equality

[Killed] EqualityOperator
src/components/AppSidebar.tsx:67:23
           <SidebarMenuButton
             data-root={record.root}
             data-testid="workspace-item"
-            isActive={record.root === currentRoot}
+            isActive={record.root !== currentRoot}
             size="lg"
             tooltip={record.root}
killedBy: AppSidebar：清单渲染 currentRoot 匹配项呈激活态（isActive 标记），非匹配项不激活
statusReason: expected 'false' to be 'true' // Object.is equality

[Killed] ConditionalExpression
src/components/AppSidebar.tsx:75:16
             {/* leading-tight 收紧行高，主文本 + 父目录两行在 lg（h-12）内完整呈现 */}
             <span className="flex min-w-0 flex-col leading-tight">
               <span className="truncate">{record.name}</span>
-              {parent !== '' && (
-                <span
-                  className="block truncate text-xs font-normal text-muted-foreground"
-                  data-testid="workspace-sub"
-                >
-                  {parent}
-                </span>
-              )}
+              {false}
             </span>
           </SidebarMenuButton>
killedBy: AppSidebar：Tooltip 与副文本 同名不同父两项：data-root 定位后 within() 取 workspace-sub，副文本各为父目录（D3 区分能力）
statusReason: Unable to find an element by: [data-testid="workspace-sub"]

Ignored nodes: comments, script, style
<button
  data-active="true"
  data-root="C:\\a\\plugin"
  data-sidebar="menu-button"

[Killed] ConditionalExpression
src/components/AppSidebar.tsx:75:16
             {/* leading-tight 收紧行高，主文本 + 父目录两行在 lg（h-12）内完整呈现 */}
             <span className="flex min-w-0 flex-col leading-tight">
               <span className="truncate">{record.name}</span>
-              {parent !== '' && (
-                <span
-                  className="block truncate text-xs font-normal text-muted-foreground"
-                  data-testid="workspace-sub"
-                >
-                  {parent}
-                </span>
-              )}
+              {true}
             </span>
           </SidebarMenuButton>
killedBy: AppSidebar：Tooltip 与副文本 同名不同父两项：data-root 定位后 within() 取 workspace-sub，副文本各为父目录（D3 区分能力）
statusReason: Unable to find an element by: [data-testid="workspace-sub"]

Ignored nodes: comments, script, style
<button
  data-active="true"
  data-root="C:\\a\\plugin"
  data-sidebar="menu-button"

[Killed] ConditionalExpression
src/components/AppSidebar.tsx:110:25
           <SidebarMenuItem>
             <SidebarMenuButton
               data-testid="nav-changes"
-              isActive={page === 'changes'}
+              isActive={false}
               tooltip="变更"
               onClick={() => onPageChange?.('changes')}
killedBy: AppSidebar：页面导航组（page / onPageChange） 当前 page 项呈激活态、另一项不激活（changes 与 agent 两态）
statusReason: expected 'false' to be 'true' // Object.is equality

[Killed] ConditionalExpression
src/components/AppSidebar.tsx:110:25
           <SidebarMenuItem>
             <SidebarMenuButton
               data-testid="nav-changes"
-              isActive={page === 'changes'}
+              isActive={true}
               tooltip="变更"
               onClick={() => onPageChange?.('changes')}
killedBy: AppSidebar：页面导航组（page / onPageChange） 当前 page 项呈激活态、另一项不激活（changes 与 agent 两态）
statusReason: expected 'true' to be 'false' // Object.is equality

[Killed] ArrowFunction
src/components/AppSidebar.tsx:112:24
               data-testid="nav-changes"
               isActive={page === 'changes'}
               tooltip="变更"
-              onClick={() => onPageChange?.('changes')}
+              onClick={() => undefined}
             >
               <GitBranch />
killedBy: AppSidebar：页面导航组（page / onPageChange） 点击「Agent 调试」→ onPageChange("agent") 恰一次；点击「变更」→ onPageChange("changes") 恰一次
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Survived] OptionalChaining
src/components/AppSidebar.tsx:112:30
               data-testid="nav-changes"
               isActive={page === 'changes'}
               tooltip="变更"
-              onClick={() => onPageChange?.('changes')}
+              onClick={() => onPageChange('changes')}
             >
               <GitBranch />

[Killed] ConditionalExpression
src/components/AppSidebar.tsx:121:25
           <SidebarMenuItem>
             <SidebarMenuButton
               data-testid="nav-agent"
-              isActive={page === 'agent'}
+              isActive={true}
               tooltip="Agent 调试"
               onClick={() => onPageChange?.('agent')}
killedBy: AppSidebar：页面导航组（page / onPageChange） 当前 page 项呈激活态、另一项不激活（changes 与 agent 两态）
statusReason: expected 'true' to be 'false' // Object.is equality

[Killed] ConditionalExpression
src/components/AppSidebar.tsx:121:25
           <SidebarMenuItem>
             <SidebarMenuButton
               data-testid="nav-agent"
-              isActive={page === 'agent'}
+              isActive={false}
               tooltip="Agent 调试"
               onClick={() => onPageChange?.('agent')}
killedBy: AppSidebar：页面导航组（page / onPageChange） 当前 page 项呈激活态、另一项不激活（changes 与 agent 两态）
statusReason: expected 'false' to be 'true' // Object.is equality

[Killed] ArrowFunction
src/components/AppSidebar.tsx:123:24
               data-testid="nav-agent"
               isActive={page === 'agent'}
               tooltip="Agent 调试"
-              onClick={() => onPageChange?.('agent')}
+              onClick={() => undefined}
             >
               <Bot />
killedBy: AppSidebar：页面导航组（page / onPageChange） 点击「Agent 调试」→ onPageChange("agent") 恰一次；点击「变更」→ onPageChange("changes") 恰一次
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Survived] OptionalChaining
src/components/AppSidebar.tsx:123:30
               data-testid="nav-agent"
               isActive={page === 'agent'}
               tooltip="Agent 调试"
-              onClick={() => onPageChange?.('agent')}
+              onClick={() => onPageChange('agent')}
             >
               <Bot />

[Survived] StringLiteral
src/components/AppSidebar.tsx:142:10
  * 移除。
  */
 export function AppSidebar({
-  page = 'changes',
+  page = "",
   onPageChange,
   workspaces,
