[Killed] EqualityOperator
views/agent/components/AgentRawStream.tsx:19:8
       data-testid="agent-raw-stream"
     >
       <h2 className="m-0 mb-1.5 text-[15px]">原始 JSONL</h2>
-      {events.length === 0 ? (
+      {events.length !== 0 ? (
         <div className="text-muted-foreground" data-testid="raw-stream-empty">
           尚无事件。
killedBy: AgentRawStream：逐事件 JSON dump（D12 落库形态） 每事件渲染一行 JSON，键形态与线格式一致（camelCase）
statusReason: Unable to find an element by: [data-testid="raw-line"]

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="mb-4 rounded-lg border border-border bg-card px-4 py-3.5"
      data-testid="agent-raw-stream"

[Killed] ConditionalExpression
views/agent/components/AgentRawStream.tsx:19:8
       data-testid="agent-raw-stream"
     >
       <h2 className="m-0 mb-1.5 text-[15px]">原始 JSONL</h2>
-      {events.length === 0 ? (
+      {false ? (
         <div className="text-muted-foreground" data-testid="raw-stream-empty">
           尚无事件。
killedBy: AgentRawStream：逐事件 JSON dump（D12 落库形态） events 为空时呈现空面板不崩
statusReason: Unable to find an element by: [data-testid="raw-stream-empty"]

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="mb-4 rounded-lg border border-border bg-card px-4 py-3.5"
      data-testid="agent-raw-stream"

[Killed] ArrowFunction
views/agent/components/AgentRawStream.tsx:24:20
           尚无事件。
         </div>
       ) : (
-        events.map((event) => (
-          <pre
-            key={event.seq}
-            className="mb-1.5 overflow-x-auto rounded bg-muted px-2 py-1.5 text-xs"
-            data-testid="raw-line"
-            data-seq={event.seq}
-          >
-            {JSON.stringify(event, null, 2)}
-          </pre>
-        ))
+        events.map(() => undefined)
       )}
     </section>
killedBy: AgentRawStream：逐事件 JSON dump（D12 落库形态） 每事件渲染一行 JSON，键形态与线格式一致（camelCase）
statusReason: Unable to find an element by: [data-testid="raw-line"]

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="mb-4 rounded-lg border border-border bg-card px-4 py-3.5"
      data-testid="agent-raw-stream"
