[Killed] BooleanLiteral
views/agent/hooks/useAgentRun.ts:28:42
  */
 export function useAgentRun(root: string | null): AgentRunState {
   const [events, setEvents] = useState<AgentEvent[]>([]);
-  const [running, setRunning] = useState(false);
+  const [running, setRunning] = useState(true);
   const [error, setError] = useState<string | null>(null);
   const [result, setResult] = useState<AgentRunRecord | null>(null);
killedBy: agent_run_pipeline：表单启动 → agent_start → 实时时间线 表单启动 → invoke 参数逐字符合契约（默认 env/permissionMode 随链路上抛，IPC 键 camelCase）
statusReason: agent_start 未被调用

[Killed] BooleanLiteral
views/agent/hooks/useAgentRun.ts:31:29
   const [running, setRunning] = useState(false);
   const [error, setError] = useState<string | null>(null);
   const [result, setResult] = useState<AgentRunRecord | null>(null);
-  const runningRef = useRef(false);
+  const runningRef = useRef(true);
 
   const start = useCallback(
killedBy: useAgentRun：start 参数契约与实时事件累积 start 以 camelCase IPC 键调用 invoke("agent_start")：onEvent 为 Channel 实例 + root/prompt/env/permissionMode
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] LogicalOperator
views/agent/hooks/useAgentRun.ts:35:11
 
   const start = useCallback(
     (input: AgentStartInput) => {
-      if (root === null || runningRef.current) return;
+      if (root === null && runningRef.current) return;
       runningRef.current = true;
       setRunning(true);
killedBy: useAgentRun：start 参数契约与实时事件累积 root 为 null 时 start 不发起 invoke（禁用语义）
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "agent_start",

[Killed] ConditionalExpression
views/agent/hooks/useAgentRun.ts:35:11
 
   const start = useCallback(
     (input: AgentStartInput) => {
-      if (root === null || runningRef.current) return;
+      if (false) return;
       runningRef.current = true;
       setRunning(true);
killedBy: useAgentRun：start 参数契约与实时事件累积 root 为 null 时 start 不发起 invoke（禁用语义）
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "agent_start",

[Killed] BooleanLiteral
views/agent/hooks/useAgentRun.ts:36:28
   const start = useCallback(
     (input: AgentStartInput) => {
       if (root === null || runningRef.current) return;
-      runningRef.current = true;
+      runningRef.current = false;
       setRunning(true);
       setError(null);
killedBy: useAgentRun：start 参数契约与实时事件累积 再次 start 时新运行重置事件与错误（running 防并发忽略重复 start）
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] ArrayDeclaration
views/agent/hooks/useAgentRun.ts:40:17
       setRunning(true);
       setError(null);
       setResult(null);
-      setEvents([]);
+      setEvents(["Stryker was here"]);
       const channel = new Channel<AgentEvent>();
       channel.onmessage = (event) => {
killedBy: useAgentRun：start 参数契约与实时事件累积 发起后 running=true，Channel 逐事件回调使 events 按序累积
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] BlockStatement
views/agent/hooks/useAgentRun.ts:42:38
       setResult(null);
       setEvents([]);
       const channel = new Channel<AgentEvent>();
-      channel.onmessage = (event) => {
-        setEvents((prev) => [...prev, event]);
-      };
+      channel.onmessage = (event) => {};
       invoke<AgentRunRecord>('agent_start', {
         onEvent: channel,
killedBy: useAgentRun：start 参数契约与实时事件累积 发起后 running=true，Channel 逐事件回调使 events 按序累积
statusReason: expected [] to deeply equal [ { seq: +0, …(6) }, { seq: 1, …(5) } ]

[Killed] ArrowFunction
views/agent/hooks/useAgentRun.ts:43:19
       setEvents([]);
       const channel = new Channel<AgentEvent>();
       channel.onmessage = (event) => {
-        setEvents((prev) => [...prev, event]);
+        setEvents(() => undefined);
       };
       invoke<AgentRunRecord>('agent_start', {
killedBy: useAgentRun：start 参数契约与实时事件累积 发起后 running=true，Channel 逐事件回调使 events 按序累积
statusReason: expected undefined to deeply equal [ { seq: +0, …(6) }, { seq: 1, …(5) } ]

[Killed] BlockStatement
views/agent/hooks/useAgentRun.ts:52:27
         env: input.env,
         permissionMode: input.permissionMode,
       })
-        .then((record) => {
-          setResult(record);
-        })
+        .then((record) => {})
         .catch((err: unknown) => {
           setError(String(err));
killedBy: useAgentRun：start 参数契约与实时事件累积 invoke resolve 记录：result 置记录、running=false（completed 与 failed 两形态）
statusReason: expected null to deeply equal { id: 1, prompt: '你好', …(11) }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
views/agent/hooks/useAgentRun.ts:55:34
         .then((record) => {
           setResult(record);
         })
-        .catch((err: unknown) => {
-          setError(String(err));
-        })
+        .catch((err: unknown) => {})
         .finally(() => {
           runningRef.current = false;
killedBy: useAgentRun：start 参数契约与实时事件累积 invoke reject(string)：error 置串、running=false，且可再次 start
statusReason: expected null to be 'CLI 未找到' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
views/agent/hooks/useAgentRun.ts:58:24
         .catch((err: unknown) => {
           setError(String(err));
         })
-        .finally(() => {
-          runningRef.current = false;
-          setRunning(false);
-        });
+        .finally(() => {});
     },
     [root],
killedBy: useAgentRun：start 参数契约与实时事件累积 invoke resolve 记录：result 置记录、running=false（completed 与 failed 两形态）
statusReason: expected true to be false // Object.is equality
