[Killed] BlockStatement
views/explores/components/ExploreConversation.tsx:281:23
 }: {
   entry: Entry;
   paired: Map<string, ToolResultBlock>;
-}): React.JSX.Element {
-  if (entry.kind === 'chat') return <ChatBubble event={entry.event} paired={paired} />;
-  if (entry.kind === 'result') return <ResultCard event={entry.event} />;
-  if (entry.kind === 'raw')
-    return (
-      <div className="py-1.5" data-testid="event-raw">
-        <div className="text-xs text-muted-foreground">未识别事件（{entry.eventType}）</div>
-        <pre className="mt-0.5 overflow-x-auto rounded bg-muted px-2 py-1.5 text-xs">
-          {entry.rawJson}
-        </pre>
-      </div>
-    );
-  return (
-    <div className="py-1 text-xs text-muted-foreground" data-testid="event-info">
-      {entry.text}
-    </div>
-  );
-}
+}): React.JSX.Element {}
 
 /** 滚动承载：message-scroller 组合（Provider/Root/Viewport/Content/Item + 到底按钮） */
killedBy: ExploreConversation：四变体块映射（AC-9） Message.blocks 含 Text 块：以 markdown 形态渲染（标题/加粗成元素而非纯文本）
statusReason: Unable to find an element by: [data-testid="block-text"]

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="flex min-h-0 flex-1 flex-col rounded-lg border border-border bg-card"
      data-testid="explore-conversation"

[Killed] ConditionalExpression
views/explores/components/ExploreConversation.tsx:282:7
   entry: Entry;
   paired: Map<string, ToolResultBlock>;
 }): React.JSX.Element {
-  if (entry.kind === 'chat') return <ChatBubble event={entry.event} paired={paired} />;
+  if (false) return <ChatBubble event={entry.event} paired={paired} />;
   if (entry.kind === 'result') return <ResultCard event={entry.event} />;
   if (entry.kind === 'raw')
killedBy: ExploreConversation：四变体块映射（AC-9） Message.blocks 含 Text 块：以 markdown 形态渲染（标题/加粗成元素而非纯文本）
statusReason: Unable to find an element by: [data-testid="block-text"]

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="flex min-h-0 flex-1 flex-col rounded-lg border border-border bg-card"
      data-testid="explore-conversation"

[Killed] EqualityOperator
views/explores/components/ExploreConversation.tsx:282:7
   entry: Entry;
   paired: Map<string, ToolResultBlock>;
 }): React.JSX.Element {
-  if (entry.kind === 'chat') return <ChatBubble event={entry.event} paired={paired} />;
+  if (entry.kind !== 'chat') return <ChatBubble event={entry.event} paired={paired} />;
   if (entry.kind === 'result') return <ResultCard event={entry.event} />;
   if (entry.kind === 'raw')
killedBy: ExploreConversation：四变体块映射（AC-9） Message.blocks 含 Text 块：以 markdown 形态渲染（标题/加粗成元素而非纯文本）
statusReason: Unable to find an element by: [data-testid="block-text"]

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="flex min-h-0 flex-1 flex-col rounded-lg border border-border bg-card"
      data-testid="explore-conversation"

[Killed] EqualityOperator
views/explores/components/ExploreConversation.tsx:283:7
   paired: Map<string, ToolResultBlock>;
 }): React.JSX.Element {
   if (entry.kind === 'chat') return <ChatBubble event={entry.event} paired={paired} />;
-  if (entry.kind === 'result') return <ResultCard event={entry.event} />;
+  if (entry.kind !== 'result') return <ResultCard event={entry.event} />;
   if (entry.kind === 'raw')
     return (
killedBy: ExploreConversation：成对与空态（AC-9） runResult 汇总卡：轮数/成本/时长/session 可读
statusReason: Unable to find an element by: [data-testid="result-summary"]

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="flex min-h-0 flex-1 flex-col rounded-lg border border-border bg-card"
      data-testid="explore-conversation"

[Killed] ConditionalExpression
views/explores/components/ExploreConversation.tsx:283:7
   paired: Map<string, ToolResultBlock>;
 }): React.JSX.Element {
   if (entry.kind === 'chat') return <ChatBubble event={entry.event} paired={paired} />;
-  if (entry.kind === 'result') return <ResultCard event={entry.event} />;
+  if (false) return <ResultCard event={entry.event} />;
   if (entry.kind === 'raw')
     return (
killedBy: ExploreConversation：成对与空态（AC-9） runResult 汇总卡：轮数/成本/时长/session 可读
statusReason: Unable to find an element by: [data-testid="result-summary"]

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="flex min-h-0 flex-1 flex-col rounded-lg border border-border bg-card"
      data-testid="explore-conversation"

[Killed] ConditionalExpression
views/explores/components/ExploreConversation.tsx:284:7
 }): React.JSX.Element {
   if (entry.kind === 'chat') return <ChatBubble event={entry.event} paired={paired} />;
   if (entry.kind === 'result') return <ResultCard event={entry.event} />;
-  if (entry.kind === 'raw')
+  if (false)
     return (
       <div className="py-1.5" data-testid="event-raw">
killedBy: ExploreConversation：成对与空态（AC-9） raw 事件透传：未识别事件呈现原文形态
statusReason: Unable to find an element by: [data-testid="event-raw"]

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="flex min-h-0 flex-1 flex-col rounded-lg border border-border bg-card"
      data-testid="explore-conversation"

[Killed] ConditionalExpression
views/explores/components/ExploreConversation.tsx:284:7
 }): React.JSX.Element {
   if (entry.kind === 'chat') return <ChatBubble event={entry.event} paired={paired} />;
   if (entry.kind === 'result') return <ResultCard event={entry.event} />;
-  if (entry.kind === 'raw')
+  if (true)
     return (
       <div className="py-1.5" data-testid="event-raw">
killedBy: ExploreConversation：辅助事件行分发（systemNotice / runStarted） systemNotice 事件：呈 info 辅助行（subtype 文案完整），不透传为 raw 原文
statusReason: Unable to find an element by: [data-testid="event-info"]

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="flex min-h-0 flex-1 flex-col rounded-lg border border-border bg-card"
      data-testid="explore-conversation"

[Killed] BlockStatement
views/explores/components/ExploreConversation.tsx:307:23
 }: {
   entries: Entry[];
   paired: Map<string, ToolResultBlock>;
-}): React.JSX.Element {
-  return (
-    <MessageScrollerProvider autoScroll defaultScrollPosition="end">
-      <MessageScroller className="flex-1">
-        <MessageScrollerViewport aria-label="对话消息">
-          <MessageScrollerContent className="px-3 py-3">
-            {entries.length === 0 && (
-              <div className="text-muted-foreground" data-testid="conversation-empty">
-                尚无对话。在下方输入以开始探索。
-              </div>
-            )}
-            {entries.map((entry) => (
-              <MessageScrollerItem key={entry.seq} messageId={String(entry.seq)}>
-                <EntryView entry={entry} paired={paired} />
-              </MessageScrollerItem>
-            ))}
-          </MessageScrollerContent>
-        </MessageScrollerViewport>
-        <MessageScrollerButton direction="end" />
-      </MessageScroller>
-    </MessageScrollerProvider>
-  );
-}
+}): React.JSX.Element {}
 
 /**
killedBy: ExploreConversation：四变体块映射（AC-9） Message.blocks 含 Text 块：以 markdown 形态渲染（标题/加粗成元素而非纯文本）
statusReason: Unable to find an element by: [data-testid="block-text"]

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="flex min-h-0 flex-1 flex-col rounded-lg border border-border bg-card"
      data-testid="explore-conversation"

[Killed] LogicalOperator
views/explores/components/ExploreConversation.tsx:313:14
       <MessageScroller className="flex-1">
         <MessageScrollerViewport aria-label="对话消息">
           <MessageScrollerContent className="px-3 py-3">
-            {entries.length === 0 && (
-              <div className="text-muted-foreground" data-testid="conversation-empty">
-                尚无对话。在下方输入以开始探索。
-              </div>
-            )}
+            {entries.length === 0 || <div className="text-muted-foreground" data-testid="conversation-empty">
+                尚无对话。在下方输入以开始探索。
+              </div>}
             {entries.map((entry) => (
               <MessageScrollerItem key={entry.seq} messageId={String(entry.seq)}>
killedBy: ExploreConversation：成对与空态（AC-9） 空事件序列：空态呈现不崩
statusReason: Unable to find an element by: [data-testid="conversation-empty"]

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="flex min-h-0 flex-1 flex-col rounded-lg border border-border bg-card"
      data-testid="explore-conversation"

[Killed] ConditionalExpression
views/explores/components/ExploreConversation.tsx:313:14
       <MessageScroller className="flex-1">
         <MessageScrollerViewport aria-label="对话消息">
           <MessageScrollerContent className="px-3 py-3">
-            {entries.length === 0 && (
+            {true && (
               <div className="text-muted-foreground" data-testid="conversation-empty">
                 尚无对话。在下方输入以开始探索。
killedBy: ExploreConversation：辅助事件行分发（systemNotice / runStarted） systemNotice 事件：呈 info 辅助行（subtype 文案完整），不透传为 raw 原文
statusReason: expected <div …(2)></div> to be null

[Killed] ArrowFunction
views/explores/components/ExploreConversation.tsx:318:26
                 尚无对话。在下方输入以开始探索。
               </div>
             )}
-            {entries.map((entry) => (
-              <MessageScrollerItem key={entry.seq} messageId={String(entry.seq)}>
-                <EntryView entry={entry} paired={paired} />
-              </MessageScrollerItem>
-            ))}
+            {entries.map(() => undefined)}
           </MessageScrollerContent>
         </MessageScrollerViewport>
killedBy: ExploreConversation：四变体块映射（AC-9） Message.blocks 含 Text 块：以 markdown 形态渲染（标题/加粗成元素而非纯文本）
statusReason: Unable to find an element by: [data-testid="block-text"]

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="flex min-h-0 flex-1 flex-col rounded-lg border border-border bg-card"
      data-testid="explore-conversation"

[Killed] LogicalOperator
views/explores/components/ExploreConversation.tsx:352:10
     >
       <div className="flex items-center gap-2 border-b border-border px-3 py-2">
         <h2 className="m-0 text-[15px]">对话</h2>
-        {running && (
-          <span className="text-xs text-muted-foreground" data-testid="conversation-running">
-            运行中…
-          </span>
-        )}
+        {running || <span className="text-xs text-muted-foreground" data-testid="conversation-running">
+            运行中…
+          </span>}
       </div>
       {loading && entries.length === 0 ? (
killedBy: explore_session_pipeline：发送拼 stance + resume 链尾 + 三元组（AC-9） agent_start reject：running 呈现后复位、历史气泡保留、composer 不崩可再输入
statusReason: expected <span …(2)></span> to be null

[Killed] ConditionalExpression
views/explores/components/ExploreConversation.tsx:352:10
     >
       <div className="flex items-center gap-2 border-b border-border px-3 py-2">
         <h2 className="m-0 text-[15px]">对话</h2>
-        {running && (
-          <span className="text-xs text-muted-foreground" data-testid="conversation-running">
-            运行中…
-          </span>
-        )}
+        {false}
       </div>
       {loading && entries.length === 0 ? (
killedBy: explore_session_pipeline：发送拼 stance + resume 链尾 + 三元组（AC-9） agent_start reject：running 呈现后复位、历史气泡保留、composer 不崩可再输入
statusReason: Unable to find an element by: [data-testid="conversation-running"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="group/sidebar-wrapper flex min-h-svh w-full"
      data-slot="sidebar-wrapper"

[Killed] ConditionalExpression
views/explores/components/ExploreConversation.tsx:358:8
           </span>
         )}
       </div>
-      {loading && entries.length === 0 ? (
+      {false ? (
         <div className="p-3 text-muted-foreground" data-testid="conversation-loading">
           会话还原中…
killedBy: ExploreConversation：成对与空态（AC-9） loading 且无事件：会话还原中提示在场（不以空态顶替）
statusReason: Unable to find an element by: [data-testid="conversation-loading"]

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="flex min-h-0 flex-1 flex-col rounded-lg border border-border bg-card"
      data-testid="explore-conversation"

[Killed] ConditionalExpression
views/explores/components/ExploreConversation.tsx:358:8
           </span>
         )}
       </div>
-      {loading && entries.length === 0 ? (
+      {true ? (
         <div className="p-3 text-muted-foreground" data-testid="conversation-loading">
           会话还原中…
killedBy: ExploreConversation：四变体块映射（AC-9） Message.blocks 含 Text 块：以 markdown 形态渲染（标题/加粗成元素而非纯文本）
statusReason: Unable to find an element by: [data-testid="block-text"]

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="flex min-h-0 flex-1 flex-col rounded-lg border border-border bg-card"
      data-testid="explore-conversation"
