[Killed] BlockStatement
src/lib/exploreStance.ts:43:63
 - 回答与提问一律用中文`;
 
 /** 组装 explore run 的 prompt：stance 前导 + 空行分隔 + 用户输入。 */
-export function buildExplorePrompt(userInput: string): string {
-  return `${STANCE_PREAMBLE}\n\n---\n\n${userInput}`;
-}
+export function buildExplorePrompt(userInput: string): string {}
 
killedBy: explore_session_pipeline：发送拼 stance + resume 链尾 + 三元组（AC-9） 有链发送：prompt 以 stance 前导开头、resume 为链尾 sessionId、三元组齐全
statusReason: expected false to be true // Object.is equality
