[Timeout] BlockStatement
src/components/AppSidebar.tsx:37:42
 }
 
 /** root 去掉最后一段的完整前缀（最后一个 / 或 \ 之前）；无分隔符返回空串（design D3） */
-function parentDir(root: string): string {
-  const index = Math.max(root.lastIndexOf('/'), root.lastIndexOf('\\'));
-  return index === -1 ? '' : root.slice(0, index);
-}
+function parentDir(root: string): string {}
 
 function WorkspaceItem({

[Timeout] MethodExpression
src/components/AppSidebar.tsx:38:17
 
 /** root 去掉最后一段的完整前缀（最后一个 / 或 \ 之前）；无分隔符返回空串（design D3） */
 function parentDir(root: string): string {
-  const index = Math.max(root.lastIndexOf('/'), root.lastIndexOf('\\'));
+  const index = Math.min(root.lastIndexOf('/'), root.lastIndexOf('\\'));
   return index === -1 ? '' : root.slice(0, index);
 }

[Killed] MethodExpression
src/components/AppSidebar.tsx:39:30
 /** root 去掉最后一段的完整前缀（最后一个 / 或 \ 之前）；无分隔符返回空串（design D3） */
 function parentDir(root: string): string {
   const index = Math.max(root.lastIndexOf('/'), root.lastIndexOf('\\'));
-  return index === -1 ? '' : root.slice(0, index);
+  return index === -1 ? '' : root;
 }
 
killedBy: AppSidebar：Tooltip 与副文本 同名不同父两项：data-root 定位后 within() 取 workspace-sub，副文本各为父目录（D3 区分能力）
statusReason: expected 'C:\a\plugin' to be 'C:\a' // Object.is equality

[Killed] UnaryOperator
src/components/AppSidebar.tsx:39:20
 /** root 去掉最后一段的完整前缀（最后一个 / 或 \ 之前）；无分隔符返回空串（design D3） */
 function parentDir(root: string): string {
   const index = Math.max(root.lastIndexOf('/'), root.lastIndexOf('\\'));
-  return index === -1 ? '' : root.slice(0, index);
+  return index === +1 ? '' : root.slice(0, index);
 }
 
killedBy: AppSidebar：Tooltip 与副文本 root 无分隔符（如 plugin）：副文本为空串、workspace-sub 节点不渲染（D3）
statusReason: expected <span …(2)></span> to be null

[Killed] ConditionalExpression
src/components/AppSidebar.tsx:61:23
           <SidebarMenuButton
             data-root={record.root}
             data-testid="workspace-item"
-            isActive={record.root === currentRoot}
+            isActive={false}
             size="lg"
             tooltip={record.root}
killedBy: AppSidebar：清单渲染 currentRoot 匹配项呈激活态（isActive 标记），非匹配项不激活
statusReason: expected 'false' to be 'true' // Object.is equality

[Killed] ConditionalExpression
src/components/AppSidebar.tsx:61:23
           <SidebarMenuButton
             data-root={record.root}
             data-testid="workspace-item"
-            isActive={record.root === currentRoot}
+            isActive={true}
             size="lg"
             tooltip={record.root}
killedBy: AppSidebar：清单渲染 currentRoot 匹配项呈激活态（isActive 标记），非匹配项不激活
statusReason: expected 'true' to be 'false' // Object.is equality

[Killed] ArrowFunction
src/components/AppSidebar.tsx:64:22
             isActive={record.root === currentRoot}
             size="lg"
             tooltip={record.root}
-            onClick={() => onOpen(record.root)}
+            onClick={() => undefined}
           >
             {/* leading-tight 收紧行高，主文本 + 父目录两行在 lg（h-12）内完整呈现 */}
killedBy: AppSidebar：切换回调与添加入口 点击列表项 → onOpen 以该项 root 调用恰一次
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] LogicalOperator
src/components/AppSidebar.tsx:69:16
             {/* leading-tight 收紧行高，主文本 + 父目录两行在 lg（h-12）内完整呈现 */}
             <span className="flex min-w-0 flex-col leading-tight">
               <span className="truncate">{record.name}</span>
-              {parent !== '' && (
-                <span
-                  className="block truncate text-xs font-normal text-muted-foreground"
-                  data-testid="workspace-sub"
-                >
-                  {parent}
-                </span>
-              )}
+              {parent !== '' || <span className="block truncate text-xs font-normal text-muted-foreground" data-testid="workspace-sub">
+                  {parent}
+                </span>}
             </span>
           </SidebarMenuButton>
killedBy: AppSidebar：Tooltip 与副文本 同名不同父两项：data-root 定位后 within() 取 workspace-sub，副文本各为父目录（D3 区分能力）
statusReason: Unable to find an element by: [data-testid="workspace-sub"]

Ignored nodes: comments, script, style
<button
  data-active="true"
  data-root="C:\\a\\plugin"
  data-sidebar="menu-button"

[Killed] EqualityOperator
src/components/AppSidebar.tsx:69:16
             {/* leading-tight 收紧行高，主文本 + 父目录两行在 lg（h-12）内完整呈现 */}
             <span className="flex min-w-0 flex-col leading-tight">
               <span className="truncate">{record.name}</span>
-              {parent !== '' && (
+              {parent === '' && (
                 <span
                   className="block truncate text-xs font-normal text-muted-foreground"
killedBy: AppSidebar：Tooltip 与副文本 同名不同父两项：data-root 定位后 within() 取 workspace-sub，副文本各为父目录（D3 区分能力）
statusReason: Unable to find an element by: [data-testid="workspace-sub"]

Ignored nodes: comments, script, style
<button
  data-active="true"
  data-root="C:\\a\\plugin"
  data-sidebar="menu-button"

[Killed] ArrowFunction
src/components/AppSidebar.tsx:82:35
         </SidebarMenuItem>
       </ContextMenuTrigger>
       <ContextMenuContent>
-        <ContextMenuItem onClick={() => onRemove(record.root)}>移除</ContextMenuItem>
+        <ContextMenuItem onClick={() => undefined}>移除</ContextMenuItem>
       </ContextMenuContent>
     </ContextMenu>
killedBy: AppSidebar：右键移除 fireEvent.contextMenu 列表项 → 菜单出现 → 点击「移除」→ onRemove 以该项 root 调用（D4-①）
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] MethodExpression
src/components/AppSidebar.tsx:100:52
             {/* 变更项：/changes 与 /changes/:name（详情）均 active */}
             <SidebarMenuButton
               asChild
-              isActive={pathname === '/changes' || pathname.startsWith('/changes/')}
+              isActive={pathname === '/changes' || pathname.endsWith('/changes/')}
               tooltip="变更"
             >
killedBy: AppSidebar：页面导航组与系统工具组（NavLink 路由导航） active 态由 URL 派生：/changes 与 /changes/:name 激活变更项，/agent 激活 Agent 项
statusReason: expected 'false' to be 'true' // Object.is equality

[Killed] EqualityOperator
src/components/AppSidebar.tsx:100:25
             {/* 变更项：/changes 与 /changes/:name（详情）均 active */}
             <SidebarMenuButton
               asChild
-              isActive={pathname === '/changes' || pathname.startsWith('/changes/')}
+              isActive={pathname !== '/changes' || pathname.startsWith('/changes/')}
               tooltip="变更"
             >
killedBy: AppSidebar：页面导航组与系统工具组（NavLink 路由导航） pathname 无匹配前缀（/bogus）：nav 均 data-active=false，锚点与 workspace 组照常渲染不崩（active 派生安全降级，组件级不等同 App 层重定向兜底）
statusReason: expected 'true' to be 'false' // Object.is equality

[Killed] ConditionalExpression
src/components/AppSidebar.tsx:113:25
             {/* 探索项：/explores 与 /explores/:name（详情）均 active */}
             <SidebarMenuButton
               asChild
-              isActive={pathname === '/explores' || pathname.startsWith('/explores/')}
+              isActive={true}
               tooltip="探索"
             >
killedBy: App：HashRouter 自含挂载与路由初态（D2/D6/D7） 启动前 hash 已为 #/changes/add-feature：直出详情视图并以 URL 参数取数（深链直达 D7，无导航点击）
statusReason: Unable to find an accessible element with the role "heading" and name "add-feature"

Here are the accessible roles:

  list:

  Name "":
  <ul

[Killed] ConditionalExpression
src/components/AppSidebar.tsx:113:25
             {/* 探索项：/explores 与 /explores/:name（详情）均 active */}
             <SidebarMenuButton
               asChild
-              isActive={pathname === '/explores' || pathname.startsWith('/explores/')}
+              isActive={false}
               tooltip="探索"
             >
killedBy: route_pages：nav-explores 点击与 active 派生（AC-10） restored 后点击 nav-explores → hash 落 #/explores、自身 active 他项失活、list_explore_records 以当前 root 发起
statusReason: expected 'false' to be 'true' // Object.is equality

[Killed] ConditionalExpression
src/components/AppSidebar.tsx:137:50
       <SidebarGroupContent>
         <SidebarMenu>
           <SidebarMenuItem>
-            <SidebarMenuButton asChild isActive={pathname === '/agent'} tooltip="Agent 调试">
+            <SidebarMenuButton asChild isActive={true} tooltip="Agent 调试">
               <NavLink data-testid="nav-agent" to="/agent">
                 <Bot />
killedBy: App：路由化顶层页面切换（changes | agent | db） 启动（hash 空）经 / 重定向落 #/changes：清单内容在场、Agent 调试页不在场、nav-changes 激活
statusReason: expected 'true' to be 'false' // Object.is equality

[Killed] ConditionalExpression
src/components/AppSidebar.tsx:137:50
       <SidebarGroupContent>
         <SidebarMenu>
           <SidebarMenuItem>
-            <SidebarMenuButton asChild isActive={pathname === '/agent'} tooltip="Agent 调试">
+            <SidebarMenuButton asChild isActive={false} tooltip="Agent 调试">
               <NavLink data-testid="nav-agent" to="/agent">
                 <Bot />
killedBy: App：路由化顶层页面切换（changes | agent | db） 侧栏点击「Agent 调试」→ hash 落 #/agent、AgentDebugView 呈现、ChangeView 内容卸载；点击「变更」→ hash 回 #/changes 切回清单
statusReason: expected 'false' to be 'true' // Object.is equality

[Killed] EqualityOperator
src/components/AppSidebar.tsx:145:50
             </SidebarMenuButton>
           </SidebarMenuItem>
           <SidebarMenuItem>
-            <SidebarMenuButton asChild isActive={pathname === '/db'} tooltip="数据库">
+            <SidebarMenuButton asChild isActive={pathname !== '/db'} tooltip="数据库">
               <NavLink data-testid="nav-db" to="/db">
                 <Database />
killedBy: route_pages：启动根路径重定向与首屏落点 常规启动（hash 为空）→ hash 落 #/changes、清单内容渲染、取数序列为 list_workspaces + list_changes 各一次（无重定向引发的多余调用）
statusReason: expected 'true' to be 'false' // Object.is equality

[Killed] ConditionalExpression
src/components/AppSidebar.tsx:145:50
             </SidebarMenuButton>
           </SidebarMenuItem>
           <SidebarMenuItem>
-            <SidebarMenuButton asChild isActive={pathname === '/db'} tooltip="数据库">
+            <SidebarMenuButton asChild isActive={false} tooltip="数据库">
               <NavLink data-testid="nav-db" to="/db">
                 <Database />
killedBy: App：路由化顶层页面切换（changes | agent | db） 侧栏点击「数据库」→ DbInspectorView 呈现且 db_models 取数发起、其余两分支不挂载（db 分支渲染）
statusReason: expected 'false' to be 'true' // Object.is equality

[Killed] ArrowFunction
src/components/AppSidebar.tsx:181:29
         </SidebarGroupAction>
         <SidebarGroupContent>
           <SidebarMenu>
-            {workspaces.map((record) => (
-              <WorkspaceItem
-                currentRoot={currentRoot}
-                key={record.root}
-                onOpen={onOpen}
-                onRemove={onRemove}
-                record={record}
-              />
-            ))}
+            {workspaces.map(() => undefined)}
           </SidebarMenu>
         </SidebarGroupContent>
killedBy: route_pages：切换根清选中落清单 详情态点击另一 workspace 项 → hash 落 #/changes、清单呈现、list_changes 以新根（SECOND.root）发起
statusReason: Unable to find an element by: [data-testid="workspace-item"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="group/sidebar-wrapper flex min-h-svh w-full"
      data-slot="sidebar-wrapper"
