[Killed] BlockStatement
views/explores/hooks/useExploreList.ts:34:23
   onError: (message: string) => void,
 ): ExploreActions {
   const create = useCallback(
-    (name: string) => {
-      if (!root) return;
-      invoke<ExploreRecord>('create_explore_record', { root, name })
-        .then(refresh)
-        .catch((err: unknown) => onError(String(err)));
-    },
+    (name: string) => {},
     [root, refresh, onError],
   );
killedBy: useExploreList：动作薄封装（create / rename / remove 后刷新，AC-8） create：发起 create_explore_record，成功后以当前 root 重新取数、新记录入列
statusReason: expected [ { id: 1, …(4) } ] to deeply equal [ { id: 1, …(4) }, { id: 2, …(4) } ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
views/explores/hooks/useExploreList.ts:35:11
 ): ExploreActions {
   const create = useCallback(
     (name: string) => {
-      if (!root) return;
+      if (root) return;
       invoke<ExploreRecord>('create_explore_record', { root, name })
         .then(refresh)
killedBy: useExploreList：动作薄封装（create / rename / remove 后刷新，AC-8） create：发起 create_explore_record，成功后以当前 root 重新取数、新记录入列
statusReason: expected [ { id: 1, …(4) } ] to deeply equal [ { id: 1, …(4) }, { id: 2, …(4) } ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
views/explores/hooks/useExploreList.ts:35:11
 ): ExploreActions {
   const create = useCallback(
     (name: string) => {
-      if (!root) return;
+      if (false) return;
       invoke<ExploreRecord>('create_explore_record', { root, name })
         .then(refresh)
killedBy: useExploreList：无 root 动作守卫与失败语义（AC-8） root 为 null：create / rename / remove 三个动作均为 no-op（零 IPC）
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ObjectLiteral
views/explores/hooks/useExploreList.ts:36:54
   const create = useCallback(
     (name: string) => {
       if (!root) return;
-      invoke<ExploreRecord>('create_explore_record', { root, name })
+      invoke<ExploreRecord>('create_explore_record', {})
         .then(refresh)
         .catch((err: unknown) => onError(String(err)));
killedBy: useExploreList：动作薄封装（create / rename / remove 后刷新，AC-8） create：发起 create_explore_record，成功后以当前 root 重新取数、新记录入列
statusReason: expected "vi.fn()" to be called with arguments: [ 'create_explore_record', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "create_explore_record",

[Killed] StringLiteral
views/explores/hooks/useExploreList.ts:36:29
   const create = useCallback(
     (name: string) => {
       if (!root) return;
-      invoke<ExploreRecord>('create_explore_record', { root, name })
+      invoke<ExploreRecord>("", { root, name })
         .then(refresh)
         .catch((err: unknown) => onError(String(err)));
killedBy: useExploreList：动作薄封装（create / rename / remove 后刷新，AC-8） create：发起 create_explore_record，成功后以当前 root 重新取数、新记录入列
statusReason: expected "vi.fn()" to be called with arguments: [ 'create_explore_record', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "create_explore_record",

[Killed] ArrowFunction
views/explores/hooks/useExploreList.ts:38:16
       if (!root) return;
       invoke<ExploreRecord>('create_explore_record', { root, name })
         .then(refresh)
-        .catch((err: unknown) => onError(String(err)));
+        .catch(() => undefined);
     },
     [root, refresh, onError],
killedBy: useExploreList：动作薄封装（create / rename / remove 后刷新，AC-8） 动作 reject：error 置位落 error 态，不中断页面（清单保持原值）
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Survived] ArrayDeclaration
views/explores/hooks/useExploreList.ts:40:5
         .then(refresh)
         .catch((err: unknown) => onError(String(err)));
     },
-    [root, refresh, onError],
+    [],
   );
   const rename = useCallback(

[Killed] BlockStatement
views/explores/hooks/useExploreList.ts:43:40
     [root, refresh, onError],
   );
   const rename = useCallback(
-    (name: string, newName: string) => {
-      if (!root) return;
-      invoke<ExploreRecord>('rename_explore_record', { root, name, newName })
-        .then(refresh)
-        .catch((err: unknown) => onError(String(err)));
-    },
+    (name: string, newName: string) => {},
     [root, refresh, onError],
   );
killedBy: useExploreList：动作薄封装（create / rename / remove 后刷新，AC-8） rename / remove：分别发起对应命令，成功后列表刷新反映变更
statusReason: expected [ { id: 1, …(4) }, { id: 2, …(4) } ] to deeply equal [ { id: 1, …(4) }, { id: 2, …(4) } ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
views/explores/hooks/useExploreList.ts:44:11
   );
   const rename = useCallback(
     (name: string, newName: string) => {
-      if (!root) return;
+      if (false) return;
       invoke<ExploreRecord>('rename_explore_record', { root, name, newName })
         .then(refresh)
killedBy: useExploreList：无 root 动作守卫与失败语义（AC-8） root 为 null：create / rename / remove 三个动作均为 no-op（零 IPC）
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ConditionalExpression
views/explores/hooks/useExploreList.ts:44:11
   );
   const rename = useCallback(
     (name: string, newName: string) => {
-      if (!root) return;
+      if (true) return;
       invoke<ExploreRecord>('rename_explore_record', { root, name, newName })
         .then(refresh)
killedBy: useExploreList：动作薄封装（create / rename / remove 后刷新，AC-8） rename / remove：分别发起对应命令，成功后列表刷新反映变更
statusReason: expected [ { id: 1, …(4) }, { id: 2, …(4) } ] to deeply equal [ { id: 1, …(4) }, { id: 2, …(4) } ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] StringLiteral
views/explores/hooks/useExploreList.ts:45:29
   const rename = useCallback(
     (name: string, newName: string) => {
       if (!root) return;
-      invoke<ExploreRecord>('rename_explore_record', { root, name, newName })
+      invoke<ExploreRecord>("", { root, name, newName })
         .then(refresh)
         .catch((err: unknown) => onError(String(err)));
killedBy: useExploreList：动作薄封装（create / rename / remove 后刷新，AC-8） rename / remove：分别发起对应命令，成功后列表刷新反映变更
statusReason: expected [ { id: 1, …(4) }, { id: 2, …(4) } ] to deeply equal [ { id: 1, …(4) }, { id: 2, …(4) } ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
views/explores/hooks/useExploreList.ts:52:23
     [root, refresh, onError],
   );
   const remove = useCallback(
-    (name: string) => {
-      if (!root) return;
-      invoke<boolean>('delete_explore_record', { root, name })
-        .then(refresh)
-        .catch((err: unknown) => onError(String(err)));
-    },
+    (name: string) => {},
     [root, refresh, onError],
   );
killedBy: useExploreList：动作薄封装（create / rename / remove 后刷新，AC-8） rename / remove：分别发起对应命令，成功后列表刷新反映变更
statusReason: expected [ { id: 1, …(4) }, { id: 2, …(4) } ] to deeply equal [ { id: 1, …(4) } ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Survived] BooleanLiteral
views/explores/hooks/useExploreList.ts:72:42
 export function useExploreList(root: string | null): ExploreListState {
   const [records, setRecords] = useState<ExploreRecord[]>([]);
   const [recordsRoot, setRecordsRoot] = useState<string | null>(null);
-  const [loading, setLoading] = useState(false);
+  const [loading, setLoading] = useState(true);
   const [error, setError] = useState<string | null>(null);
   const [tick, setTick] = useState(0);

[Killed] ArrowFunction
views/explores/hooks/useExploreList.ts:77:31
   const [tick, setTick] = useState(0);
 
   const refresh = useCallback(() => setTick((t) => t + 1), []);
-  const onError = useCallback((message: string) => setError(message), []);
+  const onError = useCallback(() => undefined, []);
   const actions = useExploreActions(root, refresh, onError);
 
killedBy: useExploreList：动作薄封装（create / rename / remove 后刷新，AC-8） 动作 reject：error 置位落 error 态，不中断页面（清单保持原值）
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
views/explores/hooks/useExploreList.ts:81:9
   const actions = useExploreActions(root, refresh, onError);
 
   useEffect(() => {
-    if (!root) {
+    if (true) {
       setRecords([]);
       setRecordsRoot(null);
killedBy: explore_session_pipeline：详情双恢复与全链重放（AC-9/AC-5） 打开详情：read_explore 与 agent_run_chain 各发一次（互为前置不成立），文档与气泡同屏
statusReason: Unable to find an element by: [data-testid="explore-detail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="group/sidebar-wrapper flex min-h-svh w-full"
      data-slot="sidebar-wrapper"

[Killed] BlockStatement
views/explores/hooks/useExploreList.ts:81:16
   const actions = useExploreActions(root, refresh, onError);
 
   useEffect(() => {
-    if (!root) {
-      setRecords([]);
-      setRecordsRoot(null);
-      setError(null);
-      setLoading(false);
-      return;
-    }
+    if (!root) {}
     let cancelled = false;
     setLoading(true);
killedBy: useExploreList：清单取数纪律（AC-8） root 为 null：不发起任何取数，records 为空态
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] BlockStatement
views/explores/hooks/useExploreList.ts:92:25
     setLoading(true);
     setError(null);
     invoke<ExploreRecord[]>('list_explore_records', { root })
-      .then((result) => {
-        if (cancelled) return;
-        setRecords(result);
-        setRecordsRoot(root);
-        setLoading(false);
-      })
+      .then((result) => {})
       .catch((err: unknown) => {
         if (cancelled) return;
killedBy: useExploreList：清单取数纪律（AC-8） 有效 root 挂载：以 { root } 发起 list_explore_records 恰一次，records 呈现返回序
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
views/explores/hooks/useExploreList.ts:96:20
         if (cancelled) return;
         setRecords(result);
         setRecordsRoot(root);
-        setLoading(false);
+        setLoading(true);
       })
       .catch((err: unknown) => {
killedBy: useExploreList：清单取数纪律（AC-8） 有效 root 挂载：以 { root } 发起 list_explore_records 恰一次，records 呈现返回序
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] EqualityOperator
views/explores/hooks/useExploreList.ts:109:14
   }, [root, tick]);
 
   return {
-    records: recordsRoot === root ? records : [],
+    records: recordsRoot !== root ? records : [],
     loading,
     error,
killedBy: useExploreList：清单取数纪律（AC-8） 有效 root 挂载：以 { root } 发起 list_explore_records 恰一次，records 呈现返回序
statusReason: expected [] to deeply equal [ { id: 1, …(4) }, { id: 2, …(4) } ]

[Killed] ConditionalExpression
views/explores/hooks/useExploreList.ts:109:14
   }, [root, tick]);
 
   return {
-    records: recordsRoot === root ? records : [],
+    records: false ? records : [],
     loading,
     error,
killedBy: useExploreList：清单取数纪律（AC-8） 有效 root 挂载：以 { root } 发起 list_explore_records 恰一次，records 呈现返回序
statusReason: expected [] to deeply equal [ { id: 1, …(4) }, { id: 2, …(4) } ]
